<?php

$config['area'] = array (
	0 =>
			array (
				'id' => '110000',
				'name' => '北京市',
				'children' =>
					array (
						0 =>
							array (
								'id' => '110101',
								'name' => '东城区',
							),
						1 =>
							array (
								'id' => '110102',
								'name' => '西城区',
							),
						2 =>
							array (
								'id' => '110103',
								'name' => '崇文区',
							),
						3 =>
							array (
								'id' => '110104',
								'name' => '宣武区',
							),
						4 =>
							array (
								'id' => '110105',
								'name' => '朝阳区',
							),
						5 =>
							array (
								'id' => '110106',
								'name' => '丰台区',
							),
						6 =>
							array (
								'id' => '110107',
								'name' => '石景山区',
							),
						7 =>
							array (
								'id' => '110108',
								'name' => '海淀区',
							),
						8 =>
							array (
								'id' => '110109',
								'name' => '门头沟区',
							),
						9 =>
							array (
								'id' => '110111',
								'name' => '房山区',
							),
						10 =>
							array (
								'id' => '110112',
								'name' => '通州区',
							),
						11 =>
							array (
								'id' => '110113',
								'name' => '顺义区',
							),
						12 =>
							array (
								'id' => '110114',
								'name' => '昌平区',
							),
						13 =>
							array (
								'id' => '110115',
								'name' => '大兴区',
							),
						14 =>
							array (
								'id' => '110116',
								'name' => '怀柔区',
							),
						15 =>
							array (
								'id' => '110117',
								'name' => '平谷区',
							),
						16 =>
							array (
								'id' => '110200',
								'name' => '县',
								'children' =>
									array (
										0 =>
											array (
												'id' => '110228',
												'name' => '密云县',
											),
										1 =>
											array (
												'id' => '110229',
												'name' => '延庆县',
											),
									),
							),
					),
			),
		1 =>
			array (
				'id' => '120000',
				'name' => '天津市',
				'children' =>
					array (
						0 =>
							array (
								'id' => '120101',
								'name' => '和平区',
							),
						1 =>
							array (
								'id' => '120102',
								'name' => '河东区',
							),
						2 =>
							array (
								'id' => '120103',
								'name' => '河西区',
							),
						3 =>
							array (
								'id' => '120104',
								'name' => '南开区',
							),
						4 =>
							array (
								'id' => '120105',
								'name' => '河北区',
							),
						5 =>
							array (
								'id' => '120106',
								'name' => '红桥区',
							),
						6 =>
							array (
								'id' => '120107',
								'name' => '塘沽区',
							),
						7 =>
							array (
								'id' => '120108',
								'name' => '汉沽区',
							),
						8 =>
							array (
								'id' => '120109',
								'name' => '大港区',
							),
						9 =>
							array (
								'id' => '120110',
								'name' => '东丽区',
							),
						10 =>
							array (
								'id' => '120111',
								'name' => '西青区',
							),
						11 =>
							array (
								'id' => '120112',
								'name' => '津南区',
							),
						12 =>
							array (
								'id' => '120113',
								'name' => '北辰区',
							),
						13 =>
							array (
								'id' => '120114',
								'name' => '武清区',
							),
						14 =>
							array (
								'id' => '120115',
								'name' => '宝坻区',
							),
						15 =>
							array (
								'id' => '120200',
								'name' => '县',
								'children' =>
									array (
										0 =>
											array (
												'id' => '120221',
												'name' => '宁河县',
											),
										1 =>
											array (
												'id' => '120223',
												'name' => '静海县',
											),
										2 =>
											array (
												'id' => '120225',
												'name' => '蓟　县',
											),
									),
							),
					),
			),
		2 =>
			array (
				'id' => '130000',
				'name' => '河北省',
				'children' =>
					array (
						0 =>
							array (
								'id' => '130100',
								'name' => '石家庄市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '130102',
												'name' => '长安区',
											),
										1 =>
											array (
												'id' => '130103',
												'name' => '桥东区',
											),
										2 =>
											array (
												'id' => '130104',
												'name' => '桥西区',
											),
										3 =>
											array (
												'id' => '130105',
												'name' => '新华区',
											),
										4 =>
											array (
												'id' => '130107',
												'name' => '井陉矿区',
											),
										5 =>
											array (
												'id' => '130108',
												'name' => '裕华区',
											),
										6 =>
											array (
												'id' => '130121',
												'name' => '井陉县',
											),
										7 =>
											array (
												'id' => '130123',
												'name' => '正定县',
											),
										8 =>
											array (
												'id' => '130124',
												'name' => '栾城县',
											),
										9 =>
											array (
												'id' => '130125',
												'name' => '行唐县',
											),
										10 =>
											array (
												'id' => '130126',
												'name' => '灵寿县',
											),
										11 =>
											array (
												'id' => '130127',
												'name' => '高邑县',
											),
										12 =>
											array (
												'id' => '130128',
												'name' => '深泽县',
											),
										13 =>
											array (
												'id' => '130129',
												'name' => '赞皇县',
											),
										14 =>
											array (
												'id' => '130130',
												'name' => '无极县',
											),
										15 =>
											array (
												'id' => '130131',
												'name' => '平山县',
											),
										16 =>
											array (
												'id' => '130132',
												'name' => '元氏县',
											),
										17 =>
											array (
												'id' => '130133',
												'name' => '赵　县',
											),
										18 =>
											array (
												'id' => '130181',
												'name' => '辛集市',
											),
										19 =>
											array (
												'id' => '130182',
												'name' => '藁城市',
											),
										20 =>
											array (
												'id' => '130183',
												'name' => '晋州市',
											),
										21 =>
											array (
												'id' => '130184',
												'name' => '新乐市',
											),
										22 =>
											array (
												'id' => '130185',
												'name' => '鹿泉市',
											),
									),
							),
						1 =>
							array (
								'id' => '130200',
								'name' => '唐山市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '130202',
												'name' => '路南区',
											),
										1 =>
											array (
												'id' => '130203',
												'name' => '路北区',
											),
										2 =>
											array (
												'id' => '130204',
												'name' => '古冶区',
											),
										3 =>
											array (
												'id' => '130205',
												'name' => '开平区',
											),
										4 =>
											array (
												'id' => '130207',
												'name' => '丰南区',
											),
										5 =>
											array (
												'id' => '130208',
												'name' => '丰润区',
											),
										6 =>
											array (
												'id' => '130223',
												'name' => '滦　县',
											),
										7 =>
											array (
												'id' => '130224',
												'name' => '滦南县',
											),
										8 =>
											array (
												'id' => '130225',
												'name' => '乐亭县',
											),
										9 =>
											array (
												'id' => '130227',
												'name' => '迁西县',
											),
										10 =>
											array (
												'id' => '130229',
												'name' => '玉田县',
											),
										11 =>
											array (
												'id' => '130230',
												'name' => '唐海县',
											),
										12 =>
											array (
												'id' => '130281',
												'name' => '遵化市',
											),
										13 =>
											array (
												'id' => '130283',
												'name' => '迁安市',
											),
									),
							),
						2 =>
							array (
								'id' => '130300',
								'name' => '秦皇岛市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '130302',
												'name' => '海港区',
											),
										1 =>
											array (
												'id' => '130303',
												'name' => '山海关区',
											),
										2 =>
											array (
												'id' => '130304',
												'name' => '北戴河区',
											),
										3 =>
											array (
												'id' => '130321',
												'name' => '青龙满族自治县',
											),
										4 =>
											array (
												'id' => '130322',
												'name' => '昌黎县',
											),
										5 =>
											array (
												'id' => '130323',
												'name' => '抚宁县',
											),
										6 =>
											array (
												'id' => '130324',
												'name' => '卢龙县',
											),
									),
							),
						3 =>
							array (
								'id' => '130400',
								'name' => '邯郸市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '130402',
												'name' => '邯山区',
											),
										1 =>
											array (
												'id' => '130403',
												'name' => '丛台区',
											),
										2 =>
											array (
												'id' => '130404',
												'name' => '复兴区',
											),
										3 =>
											array (
												'id' => '130406',
												'name' => '峰峰矿区',
											),
										4 =>
											array (
												'id' => '130421',
												'name' => '邯郸县',
											),
										5 =>
											array (
												'id' => '130423',
												'name' => '临漳县',
											),
										6 =>
											array (
												'id' => '130424',
												'name' => '成安县',
											),
										7 =>
											array (
												'id' => '130425',
												'name' => '大名县',
											),
										8 =>
											array (
												'id' => '130426',
												'name' => '涉　县',
											),
										9 =>
											array (
												'id' => '130427',
												'name' => '磁　县',
											),
										10 =>
											array (
												'id' => '130428',
												'name' => '肥乡县',
											),
										11 =>
											array (
												'id' => '130429',
												'name' => '永年县',
											),
										12 =>
											array (
												'id' => '130430',
												'name' => '邱　县',
											),
										13 =>
											array (
												'id' => '130431',
												'name' => '鸡泽县',
											),
										14 =>
											array (
												'id' => '130432',
												'name' => '广平县',
											),
										15 =>
											array (
												'id' => '130433',
												'name' => '馆陶县',
											),
										16 =>
											array (
												'id' => '130434',
												'name' => '魏　县',
											),
										17 =>
											array (
												'id' => '130435',
												'name' => '曲周县',
											),
										18 =>
											array (
												'id' => '130481',
												'name' => '武安市',
											),
									),
							),
						4 =>
							array (
								'id' => '130500',
								'name' => '邢台市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '130502',
												'name' => '桥东区',
											),
										1 =>
											array (
												'id' => '130503',
												'name' => '桥西区',
											),
										2 =>
											array (
												'id' => '130521',
												'name' => '邢台县',
											),
										3 =>
											array (
												'id' => '130522',
												'name' => '临城县',
											),
										4 =>
											array (
												'id' => '130523',
												'name' => '内丘县',
											),
										5 =>
											array (
												'id' => '130524',
												'name' => '柏乡县',
											),
										6 =>
											array (
												'id' => '130525',
												'name' => '隆尧县',
											),
										7 =>
											array (
												'id' => '130526',
												'name' => '任　县',
											),
										8 =>
											array (
												'id' => '130527',
												'name' => '南和县',
											),
										9 =>
											array (
												'id' => '130528',
												'name' => '宁晋县',
											),
										10 =>
											array (
												'id' => '130529',
												'name' => '巨鹿县',
											),
										11 =>
											array (
												'id' => '130530',
												'name' => '新河县',
											),
										12 =>
											array (
												'id' => '130531',
												'name' => '广宗县',
											),
										13 =>
											array (
												'id' => '130532',
												'name' => '平乡县',
											),
										14 =>
											array (
												'id' => '130533',
												'name' => '威　县',
											),
										15 =>
											array (
												'id' => '130534',
												'name' => '清河县',
											),
										16 =>
											array (
												'id' => '130535',
												'name' => '临西县',
											),
										17 =>
											array (
												'id' => '130581',
												'name' => '南宫市',
											),
										18 =>
											array (
												'id' => '130582',
												'name' => '沙河市',
											),
									),
							),
						5 =>
							array (
								'id' => '130600',
								'name' => '保定市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '130602',
												'name' => '新市区',
											),
										1 =>
											array (
												'id' => '130603',
												'name' => '北市区',
											),
										2 =>
											array (
												'id' => '130604',
												'name' => '南市区',
											),
										3 =>
											array (
												'id' => '130621',
												'name' => '满城县',
											),
										4 =>
											array (
												'id' => '130622',
												'name' => '清苑县',
											),
										5 =>
											array (
												'id' => '130623',
												'name' => '涞水县',
											),
										6 =>
											array (
												'id' => '130624',
												'name' => '阜平县',
											),
										7 =>
											array (
												'id' => '130625',
												'name' => '徐水县',
											),
										8 =>
											array (
												'id' => '130626',
												'name' => '定兴县',
											),
										9 =>
											array (
												'id' => '130627',
												'name' => '唐　县',
											),
										10 =>
											array (
												'id' => '130628',
												'name' => '高阳县',
											),
										11 =>
											array (
												'id' => '130629',
												'name' => '容城县',
											),
										12 =>
											array (
												'id' => '130630',
												'name' => '涞源县',
											),
										13 =>
											array (
												'id' => '130631',
												'name' => '望都县',
											),
										14 =>
											array (
												'id' => '130632',
												'name' => '安新县',
											),
										15 =>
											array (
												'id' => '130633',
												'name' => '易　县',
											),
										16 =>
											array (
												'id' => '130634',
												'name' => '曲阳县',
											),
										17 =>
											array (
												'id' => '130635',
												'name' => '蠡　县',
											),
										18 =>
											array (
												'id' => '130636',
												'name' => '顺平县',
											),
										19 =>
											array (
												'id' => '130637',
												'name' => '博野县',
											),
										20 =>
											array (
												'id' => '130638',
												'name' => '雄　县',
											),
										21 =>
											array (
												'id' => '130681',
												'name' => '涿州市',
											),
										22 =>
											array (
												'id' => '130682',
												'name' => '定州市',
											),
										23 =>
											array (
												'id' => '130683',
												'name' => '安国市',
											),
										24 =>
											array (
												'id' => '130684',
												'name' => '高碑店市',
											),
									),
							),
						6 =>
							array (
								'id' => '130700',
								'name' => '张家口市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '130702',
												'name' => '桥东区',
											),
										1 =>
											array (
												'id' => '130703',
												'name' => '桥西区',
											),
										2 =>
											array (
												'id' => '130705',
												'name' => '宣化区',
											),
										3 =>
											array (
												'id' => '130706',
												'name' => '下花园区',
											),
										4 =>
											array (
												'id' => '130721',
												'name' => '宣化县',
											),
										5 =>
											array (
												'id' => '130722',
												'name' => '张北县',
											),
										6 =>
											array (
												'id' => '130723',
												'name' => '康保县',
											),
										7 =>
											array (
												'id' => '130724',
												'name' => '沽源县',
											),
										8 =>
											array (
												'id' => '130725',
												'name' => '尚义县',
											),
										9 =>
											array (
												'id' => '130726',
												'name' => '蔚　县',
											),
										10 =>
											array (
												'id' => '130727',
												'name' => '阳原县',
											),
										11 =>
											array (
												'id' => '130728',
												'name' => '怀安县',
											),
										12 =>
											array (
												'id' => '130729',
												'name' => '万全县',
											),
										13 =>
											array (
												'id' => '130730',
												'name' => '怀来县',
											),
										14 =>
											array (
												'id' => '130731',
												'name' => '涿鹿县',
											),
										15 =>
											array (
												'id' => '130732',
												'name' => '赤城县',
											),
										16 =>
											array (
												'id' => '130733',
												'name' => '崇礼县',
											),
									),
							),
						7 =>
							array (
								'id' => '130800',
								'name' => '承德市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '130802',
												'name' => '双桥区',
											),
										1 =>
											array (
												'id' => '130803',
												'name' => '双滦区',
											),
										2 =>
											array (
												'id' => '130804',
												'name' => '鹰手营子矿区',
											),
										3 =>
											array (
												'id' => '130821',
												'name' => '承德县',
											),
										4 =>
											array (
												'id' => '130822',
												'name' => '兴隆县',
											),
										5 =>
											array (
												'id' => '130823',
												'name' => '平泉县',
											),
										6 =>
											array (
												'id' => '130824',
												'name' => '滦平县',
											),
										7 =>
											array (
												'id' => '130825',
												'name' => '隆化县',
											),
										8 =>
											array (
												'id' => '130826',
												'name' => '丰宁满族自治县',
											),
										9 =>
											array (
												'id' => '130827',
												'name' => '宽城满族自治县',
											),
										10 =>
											array (
												'id' => '130828',
												'name' => '围场满族蒙古族自治县',
											),
									),
							),
						8 =>
							array (
								'id' => '130900',
								'name' => '沧州市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '130902',
												'name' => '新华区',
											),
										1 =>
											array (
												'id' => '130903',
												'name' => '运河区',
											),
										2 =>
											array (
												'id' => '130921',
												'name' => '沧　县',
											),
										3 =>
											array (
												'id' => '130922',
												'name' => '青　县',
											),
										4 =>
											array (
												'id' => '130923',
												'name' => '东光县',
											),
										5 =>
											array (
												'id' => '130924',
												'name' => '海兴县',
											),
										6 =>
											array (
												'id' => '130925',
												'name' => '盐山县',
											),
										7 =>
											array (
												'id' => '130926',
												'name' => '肃宁县',
											),
										8 =>
											array (
												'id' => '130927',
												'name' => '南皮县',
											),
										9 =>
											array (
												'id' => '130928',
												'name' => '吴桥县',
											),
										10 =>
											array (
												'id' => '130929',
												'name' => '献　县',
											),
										11 =>
											array (
												'id' => '130930',
												'name' => '孟村回族自治县',
											),
										12 =>
											array (
												'id' => '130981',
												'name' => '泊头市',
											),
										13 =>
											array (
												'id' => '130982',
												'name' => '任丘市',
											),
										14 =>
											array (
												'id' => '130983',
												'name' => '黄骅市',
											),
										15 =>
											array (
												'id' => '130984',
												'name' => '河间市',
											),
									),
							),
						9 =>
							array (
								'id' => '131000',
								'name' => '廊坊市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '131002',
												'name' => '安次区',
											),
										1 =>
											array (
												'id' => '131003',
												'name' => '广阳区',
											),
										2 =>
											array (
												'id' => '131022',
												'name' => '固安县',
											),
										3 =>
											array (
												'id' => '131023',
												'name' => '永清县',
											),
										4 =>
											array (
												'id' => '131024',
												'name' => '香河县',
											),
										5 =>
											array (
												'id' => '131025',
												'name' => '大城县',
											),
										6 =>
											array (
												'id' => '131026',
												'name' => '文安县',
											),
										7 =>
											array (
												'id' => '131028',
												'name' => '大厂回族自治县',
											),
										8 =>
											array (
												'id' => '131081',
												'name' => '霸州市',
											),
										9 =>
											array (
												'id' => '131082',
												'name' => '三河市',
											),
									),
							),
						10 =>
							array (
								'id' => '131100',
								'name' => '衡水市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '131102',
												'name' => '桃城区',
											),
										1 =>
											array (
												'id' => '131121',
												'name' => '枣强县',
											),
										2 =>
											array (
												'id' => '131122',
												'name' => '武邑县',
											),
										3 =>
											array (
												'id' => '131123',
												'name' => '武强县',
											),
										4 =>
											array (
												'id' => '131124',
												'name' => '饶阳县',
											),
										5 =>
											array (
												'id' => '131125',
												'name' => '安平县',
											),
										6 =>
											array (
												'id' => '131126',
												'name' => '故城县',
											),
										7 =>
											array (
												'id' => '131127',
												'name' => '景　县',
											),
										8 =>
											array (
												'id' => '131128',
												'name' => '阜城县',
											),
										9 =>
											array (
												'id' => '131181',
												'name' => '冀州市',
											),
										10 =>
											array (
												'id' => '131182',
												'name' => '深州市',
											),
									),
							),
					),
			),
		3 =>
			array (
				'id' => '140000',
				'name' => '山西省',
				'children' =>
					array (
						0 =>
							array (
								'id' => '140100',
								'name' => '太原市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '140105',
												'name' => '小店区',
											),
										1 =>
											array (
												'id' => '140106',
												'name' => '迎泽区',
											),
										2 =>
											array (
												'id' => '140107',
												'name' => '杏花岭区',
											),
										3 =>
											array (
												'id' => '140108',
												'name' => '尖草坪区',
											),
										4 =>
											array (
												'id' => '140109',
												'name' => '万柏林区',
											),
										5 =>
											array (
												'id' => '140110',
												'name' => '晋源区',
											),
										6 =>
											array (
												'id' => '140121',
												'name' => '清徐县',
											),
										7 =>
											array (
												'id' => '140122',
												'name' => '阳曲县',
											),
										8 =>
											array (
												'id' => '140123',
												'name' => '娄烦县',
											),
										9 =>
											array (
												'id' => '140181',
												'name' => '古交市',
											),
									),
							),
						1 =>
							array (
								'id' => '140200',
								'name' => '大同市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '140202',
												'name' => '城　区',
											),
										1 =>
											array (
												'id' => '140203',
												'name' => '矿　区',
											),
										2 =>
											array (
												'id' => '140211',
												'name' => '南郊区',
											),
										3 =>
											array (
												'id' => '140212',
												'name' => '新荣区',
											),
										4 =>
											array (
												'id' => '140221',
												'name' => '阳高县',
											),
										5 =>
											array (
												'id' => '140222',
												'name' => '天镇县',
											),
										6 =>
											array (
												'id' => '140223',
												'name' => '广灵县',
											),
										7 =>
											array (
												'id' => '140224',
												'name' => '灵丘县',
											),
										8 =>
											array (
												'id' => '140225',
												'name' => '浑源县',
											),
										9 =>
											array (
												'id' => '140226',
												'name' => '左云县',
											),
										10 =>
											array (
												'id' => '140227',
												'name' => '大同县',
											),
									),
							),
						2 =>
							array (
								'id' => '140300',
								'name' => '阳泉市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '140302',
												'name' => '城　区',
											),
										1 =>
											array (
												'id' => '140303',
												'name' => '矿　区',
											),
										2 =>
											array (
												'id' => '140311',
												'name' => '郊　区',
											),
										3 =>
											array (
												'id' => '140321',
												'name' => '平定县',
											),
										4 =>
											array (
												'id' => '140322',
												'name' => '盂　县',
											),
									),
							),
						3 =>
							array (
								'id' => '140400',
								'name' => '长治市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '140402',
												'name' => '城　区',
											),
										1 =>
											array (
												'id' => '140411',
												'name' => '郊　区',
											),
										2 =>
											array (
												'id' => '140421',
												'name' => '长治县',
											),
										3 =>
											array (
												'id' => '140423',
												'name' => '襄垣县',
											),
										4 =>
											array (
												'id' => '140424',
												'name' => '屯留县',
											),
										5 =>
											array (
												'id' => '140425',
												'name' => '平顺县',
											),
										6 =>
											array (
												'id' => '140426',
												'name' => '黎城县',
											),
										7 =>
											array (
												'id' => '140427',
												'name' => '壶关县',
											),
										8 =>
											array (
												'id' => '140428',
												'name' => '长子县',
											),
										9 =>
											array (
												'id' => '140429',
												'name' => '武乡县',
											),
										10 =>
											array (
												'id' => '140430',
												'name' => '沁　县',
											),
										11 =>
											array (
												'id' => '140431',
												'name' => '沁源县',
											),
										12 =>
											array (
												'id' => '140481',
												'name' => '潞城市',
											),
									),
							),
						4 =>
							array (
								'id' => '140500',
								'name' => '晋城市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '140502',
												'name' => '城　区',
											),
										1 =>
											array (
												'id' => '140521',
												'name' => '沁水县',
											),
										2 =>
											array (
												'id' => '140522',
												'name' => '阳城县',
											),
										3 =>
											array (
												'id' => '140524',
												'name' => '陵川县',
											),
										4 =>
											array (
												'id' => '140525',
												'name' => '泽州县',
											),
										5 =>
											array (
												'id' => '140581',
												'name' => '高平市',
											),
									),
							),
						5 =>
							array (
								'id' => '140600',
								'name' => '朔州市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '140602',
												'name' => '朔城区',
											),
										1 =>
											array (
												'id' => '140603',
												'name' => '平鲁区',
											),
										2 =>
											array (
												'id' => '140621',
												'name' => '山阴县',
											),
										3 =>
											array (
												'id' => '140622',
												'name' => '应　县',
											),
										4 =>
											array (
												'id' => '140623',
												'name' => '右玉县',
											),
										5 =>
											array (
												'id' => '140624',
												'name' => '怀仁县',
											),
									),
							),
						6 =>
							array (
								'id' => '140700',
								'name' => '晋中市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '140702',
												'name' => '榆次区',
											),
										1 =>
											array (
												'id' => '140721',
												'name' => '榆社县',
											),
										2 =>
											array (
												'id' => '140722',
												'name' => '左权县',
											),
										3 =>
											array (
												'id' => '140723',
												'name' => '和顺县',
											),
										4 =>
											array (
												'id' => '140724',
												'name' => '昔阳县',
											),
										5 =>
											array (
												'id' => '140725',
												'name' => '寿阳县',
											),
										6 =>
											array (
												'id' => '140726',
												'name' => '太谷县',
											),
										7 =>
											array (
												'id' => '140727',
												'name' => '祁　县',
											),
										8 =>
											array (
												'id' => '140728',
												'name' => '平遥县',
											),
										9 =>
											array (
												'id' => '140729',
												'name' => '灵石县',
											),
										10 =>
											array (
												'id' => '140781',
												'name' => '介休市',
											),
									),
							),
						7 =>
							array (
								'id' => '140800',
								'name' => '运城市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '140802',
												'name' => '盐湖区',
											),
										1 =>
											array (
												'id' => '140821',
												'name' => '临猗县',
											),
										2 =>
											array (
												'id' => '140822',
												'name' => '万荣县',
											),
										3 =>
											array (
												'id' => '140823',
												'name' => '闻喜县',
											),
										4 =>
											array (
												'id' => '140824',
												'name' => '稷山县',
											),
										5 =>
											array (
												'id' => '140825',
												'name' => '新绛县',
											),
										6 =>
											array (
												'id' => '140826',
												'name' => '绛　县',
											),
										7 =>
											array (
												'id' => '140827',
												'name' => '垣曲县',
											),
										8 =>
											array (
												'id' => '140828',
												'name' => '夏　县',
											),
										9 =>
											array (
												'id' => '140829',
												'name' => '平陆县',
											),
										10 =>
											array (
												'id' => '140830',
												'name' => '芮城县',
											),
										11 =>
											array (
												'id' => '140881',
												'name' => '永济市',
											),
										12 =>
											array (
												'id' => '140882',
												'name' => '河津市',
											),
									),
							),
						8 =>
							array (
								'id' => '140900',
								'name' => '忻州市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '140902',
												'name' => '忻府区',
											),
										1 =>
											array (
												'id' => '140921',
												'name' => '定襄县',
											),
										2 =>
											array (
												'id' => '140922',
												'name' => '五台县',
											),
										3 =>
											array (
												'id' => '140923',
												'name' => '代　县',
											),
										4 =>
											array (
												'id' => '140924',
												'name' => '繁峙县',
											),
										5 =>
											array (
												'id' => '140925',
												'name' => '宁武县',
											),
										6 =>
											array (
												'id' => '140926',
												'name' => '静乐县',
											),
										7 =>
											array (
												'id' => '140927',
												'name' => '神池县',
											),
										8 =>
											array (
												'id' => '140928',
												'name' => '五寨县',
											),
										9 =>
											array (
												'id' => '140929',
												'name' => '岢岚县',
											),
										10 =>
											array (
												'id' => '140930',
												'name' => '河曲县',
											),
										11 =>
											array (
												'id' => '140931',
												'name' => '保德县',
											),
										12 =>
											array (
												'id' => '140932',
												'name' => '偏关县',
											),
										13 =>
											array (
												'id' => '140981',
												'name' => '原平市',
											),
									),
							),
						9 =>
							array (
								'id' => '141000',
								'name' => '临汾市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '141002',
												'name' => '尧都区',
											),
										1 =>
											array (
												'id' => '141021',
												'name' => '曲沃县',
											),
										2 =>
											array (
												'id' => '141022',
												'name' => '翼城县',
											),
										3 =>
											array (
												'id' => '141023',
												'name' => '襄汾县',
											),
										4 =>
											array (
												'id' => '141024',
												'name' => '洪洞县',
											),
										5 =>
											array (
												'id' => '141025',
												'name' => '古　县',
											),
										6 =>
											array (
												'id' => '141026',
												'name' => '安泽县',
											),
										7 =>
											array (
												'id' => '141027',
												'name' => '浮山县',
											),
										8 =>
											array (
												'id' => '141028',
												'name' => '吉　县',
											),
										9 =>
											array (
												'id' => '141029',
												'name' => '乡宁县',
											),
										10 =>
											array (
												'id' => '141030',
												'name' => '大宁县',
											),
										11 =>
											array (
												'id' => '141031',
												'name' => '隰　县',
											),
										12 =>
											array (
												'id' => '141032',
												'name' => '永和县',
											),
										13 =>
											array (
												'id' => '141033',
												'name' => '蒲　县',
											),
										14 =>
											array (
												'id' => '141034',
												'name' => '汾西县',
											),
										15 =>
											array (
												'id' => '141081',
												'name' => '侯马市',
											),
										16 =>
											array (
												'id' => '141082',
												'name' => '霍州市',
											),
									),
							),
						10 =>
							array (
								'id' => '141100',
								'name' => '吕梁市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '141102',
												'name' => '离石区',
											),
										1 =>
											array (
												'id' => '141121',
												'name' => '文水县',
											),
										2 =>
											array (
												'id' => '141122',
												'name' => '交城县',
											),
										3 =>
											array (
												'id' => '141123',
												'name' => '兴　县',
											),
										4 =>
											array (
												'id' => '141124',
												'name' => '临　县',
											),
										5 =>
											array (
												'id' => '141125',
												'name' => '柳林县',
											),
										6 =>
											array (
												'id' => '141126',
												'name' => '石楼县',
											),
										7 =>
											array (
												'id' => '141127',
												'name' => '岚　县',
											),
										8 =>
											array (
												'id' => '141128',
												'name' => '方山县',
											),
										9 =>
											array (
												'id' => '141129',
												'name' => '中阳县',
											),
										10 =>
											array (
												'id' => '141130',
												'name' => '交口县',
											),
										11 =>
											array (
												'id' => '141181',
												'name' => '孝义市',
											),
										12 =>
											array (
												'id' => '141182',
												'name' => '汾阳市',
											),
									),
							),
					),
			),
		4 =>
			array (
				'id' => '150000',
				'name' => '内蒙古自治区',
				'children' =>
					array (
						0 =>
							array (
								'id' => '150100',
								'name' => '呼和浩特市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '150102',
												'name' => '新城区',
											),
										1 =>
											array (
												'id' => '150103',
												'name' => '回民区',
											),
										2 =>
											array (
												'id' => '150104',
												'name' => '玉泉区',
											),
										3 =>
											array (
												'id' => '150105',
												'name' => '赛罕区',
											),
										4 =>
											array (
												'id' => '150121',
												'name' => '土默特左旗',
											),
										5 =>
											array (
												'id' => '150122',
												'name' => '托克托县',
											),
										6 =>
											array (
												'id' => '150123',
												'name' => '和林格尔县',
											),
										7 =>
											array (
												'id' => '150124',
												'name' => '清水河县',
											),
										8 =>
											array (
												'id' => '150125',
												'name' => '武川县',
											),
									),
							),
						1 =>
							array (
								'id' => '150200',
								'name' => '包头市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '150202',
												'name' => '东河区',
											),
										1 =>
											array (
												'id' => '150203',
												'name' => '昆都仑区',
											),
										2 =>
											array (
												'id' => '150204',
												'name' => '青山区',
											),
										3 =>
											array (
												'id' => '150205',
												'name' => '石拐区',
											),
										4 =>
											array (
												'id' => '150206',
												'name' => '白云矿区',
											),
										5 =>
											array (
												'id' => '150207',
												'name' => '九原区',
											),
										6 =>
											array (
												'id' => '150221',
												'name' => '土默特右旗',
											),
										7 =>
											array (
												'id' => '150222',
												'name' => '固阳县',
											),
										8 =>
											array (
												'id' => '150223',
												'name' => '达尔罕茂明安联合旗',
											),
									),
							),
						2 =>
							array (
								'id' => '150300',
								'name' => '乌海市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '150302',
												'name' => '海勃湾区',
											),
										1 =>
											array (
												'id' => '150303',
												'name' => '海南区',
											),
										2 =>
											array (
												'id' => '150304',
												'name' => '乌达区',
											),
									),
							),
						3 =>
							array (
								'id' => '150400',
								'name' => '赤峰市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '150402',
												'name' => '红山区',
											),
										1 =>
											array (
												'id' => '150403',
												'name' => '元宝山区',
											),
										2 =>
											array (
												'id' => '150404',
												'name' => '松山区',
											),
										3 =>
											array (
												'id' => '150421',
												'name' => '阿鲁科尔沁旗',
											),
										4 =>
											array (
												'id' => '150422',
												'name' => '巴林左旗',
											),
										5 =>
											array (
												'id' => '150423',
												'name' => '巴林右旗',
											),
										6 =>
											array (
												'id' => '150424',
												'name' => '林西县',
											),
										7 =>
											array (
												'id' => '150425',
												'name' => '克什克腾旗',
											),
										8 =>
											array (
												'id' => '150426',
												'name' => '翁牛特旗',
											),
										9 =>
											array (
												'id' => '150428',
												'name' => '喀喇沁旗',
											),
										10 =>
											array (
												'id' => '150429',
												'name' => '宁城县',
											),
										11 =>
											array (
												'id' => '150430',
												'name' => '敖汉旗',
											),
									),
							),
						4 =>
							array (
								'id' => '150500',
								'name' => '通辽市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '150502',
												'name' => '科尔沁区',
											),
										1 =>
											array (
												'id' => '150521',
												'name' => '科尔沁左翼中旗',
											),
										2 =>
											array (
												'id' => '150522',
												'name' => '科尔沁左翼后旗',
											),
										3 =>
											array (
												'id' => '150523',
												'name' => '开鲁县',
											),
										4 =>
											array (
												'id' => '150524',
												'name' => '库伦旗',
											),
										5 =>
											array (
												'id' => '150525',
												'name' => '奈曼旗',
											),
										6 =>
											array (
												'id' => '150526',
												'name' => '扎鲁特旗',
											),
										7 =>
											array (
												'id' => '150581',
												'name' => '霍林郭勒市',
											),
									),
							),
						5 =>
							array (
								'id' => '150600',
								'name' => '鄂尔多斯市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '150602',
												'name' => '东胜区',
											),
										1 =>
											array (
												'id' => '150621',
												'name' => '达拉特旗',
											),
										2 =>
											array (
												'id' => '150622',
												'name' => '准格尔旗',
											),
										3 =>
											array (
												'id' => '150623',
												'name' => '鄂托克前旗',
											),
										4 =>
											array (
												'id' => '150624',
												'name' => '鄂托克旗',
											),
										5 =>
											array (
												'id' => '150625',
												'name' => '杭锦旗',
											),
										6 =>
											array (
												'id' => '150626',
												'name' => '乌审旗',
											),
										7 =>
											array (
												'id' => '150627',
												'name' => '伊金霍洛旗',
											),
									),
							),
						6 =>
							array (
								'id' => '150700',
								'name' => '呼伦贝尔市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '150702',
												'name' => '海拉尔区',
											),
										1 =>
											array (
												'id' => '150721',
												'name' => '阿荣旗',
											),
										2 =>
											array (
												'id' => '150722',
												'name' => '莫力达瓦达斡尔族自治旗',
											),
										3 =>
											array (
												'id' => '150723',
												'name' => '鄂伦春自治旗',
											),
										4 =>
											array (
												'id' => '150724',
												'name' => '鄂温克族自治旗',
											),
										5 =>
											array (
												'id' => '150725',
												'name' => '陈巴尔虎旗',
											),
										6 =>
											array (
												'id' => '150726',
												'name' => '新巴尔虎左旗',
											),
										7 =>
											array (
												'id' => '150727',
												'name' => '新巴尔虎右旗',
											),
										8 =>
											array (
												'id' => '150781',
												'name' => '满洲里市',
											),
										9 =>
											array (
												'id' => '150782',
												'name' => '牙克石市',
											),
										10 =>
											array (
												'id' => '150783',
												'name' => '扎兰屯市',
											),
										11 =>
											array (
												'id' => '150784',
												'name' => '额尔古纳市',
											),
										12 =>
											array (
												'id' => '150785',
												'name' => '根河市',
											),
									),
							),
						7 =>
							array (
								'id' => '150800',
								'name' => '巴彦淖尔市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '150802',
												'name' => '临河区',
											),
										1 =>
											array (
												'id' => '150821',
												'name' => '五原县',
											),
										2 =>
											array (
												'id' => '150822',
												'name' => '磴口县',
											),
										3 =>
											array (
												'id' => '150823',
												'name' => '乌拉特前旗',
											),
										4 =>
											array (
												'id' => '150824',
												'name' => '乌拉特中旗',
											),
										5 =>
											array (
												'id' => '150825',
												'name' => '乌拉特后旗',
											),
										6 =>
											array (
												'id' => '150826',
												'name' => '杭锦后旗',
											),
									),
							),
						8 =>
							array (
								'id' => '150900',
								'name' => '乌兰察布市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '150902',
												'name' => '集宁区',
											),
										1 =>
											array (
												'id' => '150921',
												'name' => '卓资县',
											),
										2 =>
											array (
												'id' => '150922',
												'name' => '化德县',
											),
										3 =>
											array (
												'id' => '150923',
												'name' => '商都县',
											),
										4 =>
											array (
												'id' => '150924',
												'name' => '兴和县',
											),
										5 =>
											array (
												'id' => '150925',
												'name' => '凉城县',
											),
										6 =>
											array (
												'id' => '150926',
												'name' => '察哈尔右翼前旗',
											),
										7 =>
											array (
												'id' => '150927',
												'name' => '察哈尔右翼中旗',
											),
										8 =>
											array (
												'id' => '150928',
												'name' => '察哈尔右翼后旗',
											),
										9 =>
											array (
												'id' => '150929',
												'name' => '四子王旗',
											),
										10 =>
											array (
												'id' => '150981',
												'name' => '丰镇市',
											),
									),
							),
						9 =>
							array (
								'id' => '152200',
								'name' => '兴安盟',
								'children' =>
									array (
										0 =>
											array (
												'id' => '152201',
												'name' => '乌兰浩特市',
											),
										1 =>
											array (
												'id' => '152202',
												'name' => '阿尔山市',
											),
										2 =>
											array (
												'id' => '152221',
												'name' => '科尔沁右翼前旗',
											),
										3 =>
											array (
												'id' => '152222',
												'name' => '科尔沁右翼中旗',
											),
										4 =>
											array (
												'id' => '152223',
												'name' => '扎赉特旗',
											),
										5 =>
											array (
												'id' => '152224',
												'name' => '突泉县',
											),
									),
							),
						10 =>
							array (
								'id' => '152500',
								'name' => '锡林郭勒盟',
								'children' =>
									array (
										0 =>
											array (
												'id' => '152501',
												'name' => '二连浩特市',
											),
										1 =>
											array (
												'id' => '152502',
												'name' => '锡林浩特市',
											),
										2 =>
											array (
												'id' => '152522',
												'name' => '阿巴嘎旗',
											),
										3 =>
											array (
												'id' => '152523',
												'name' => '苏尼特左旗',
											),
										4 =>
											array (
												'id' => '152524',
												'name' => '苏尼特右旗',
											),
										5 =>
											array (
												'id' => '152525',
												'name' => '东乌珠穆沁旗',
											),
										6 =>
											array (
												'id' => '152526',
												'name' => '西乌珠穆沁旗',
											),
										7 =>
											array (
												'id' => '152527',
												'name' => '太仆寺旗',
											),
										8 =>
											array (
												'id' => '152528',
												'name' => '镶黄旗',
											),
										9 =>
											array (
												'id' => '152529',
												'name' => '正镶白旗',
											),
										10 =>
											array (
												'id' => '152530',
												'name' => '正蓝旗',
											),
										11 =>
											array (
												'id' => '152531',
												'name' => '多伦县',
											),
									),
							),
						11 =>
							array (
								'id' => '152900',
								'name' => '阿拉善盟',
								'children' =>
									array (
										0 =>
											array (
												'id' => '152921',
												'name' => '阿拉善左旗',
											),
										1 =>
											array (
												'id' => '152922',
												'name' => '阿拉善右旗',
											),
										2 =>
											array (
												'id' => '152923',
												'name' => '额济纳旗',
											),
									),
							),
					),
			),
		5 =>
			array (
				'id' => '210000',
				'name' => '辽宁省',
				'children' =>
					array (
						0 =>
							array (
								'id' => '210100',
								'name' => '沈阳市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '210102',
												'name' => '和平区',
											),
										1 =>
											array (
												'id' => '210103',
												'name' => '沈河区',
											),
										2 =>
											array (
												'id' => '210104',
												'name' => '大东区',
											),
										3 =>
											array (
												'id' => '210105',
												'name' => '皇姑区',
											),
										4 =>
											array (
												'id' => '210106',
												'name' => '铁西区',
											),
										5 =>
											array (
												'id' => '210111',
												'name' => '苏家屯区',
											),
										6 =>
											array (
												'id' => '210112',
												'name' => '东陵区',
											),
										7 =>
											array (
												'id' => '210113',
												'name' => '新城子区',
											),
										8 =>
											array (
												'id' => '210114',
												'name' => '于洪区',
											),
										9 =>
											array (
												'id' => '210122',
												'name' => '辽中县',
											),
										10 =>
											array (
												'id' => '210123',
												'name' => '康平县',
											),
										11 =>
											array (
												'id' => '210124',
												'name' => '法库县',
											),
										12 =>
											array (
												'id' => '210181',
												'name' => '新民市',
											),
									),
							),
						1 =>
							array (
								'id' => '210200',
								'name' => '大连市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '210202',
												'name' => '中山区',
											),
										1 =>
											array (
												'id' => '210203',
												'name' => '西岗区',
											),
										2 =>
											array (
												'id' => '210204',
												'name' => '沙河口区',
											),
										3 =>
											array (
												'id' => '210211',
												'name' => '甘井子区',
											),
										4 =>
											array (
												'id' => '210212',
												'name' => '旅顺口区',
											),
										5 =>
											array (
												'id' => '210213',
												'name' => '金州区',
											),
										6 =>
											array (
												'id' => '210224',
												'name' => '长海县',
											),
										7 =>
											array (
												'id' => '210281',
												'name' => '瓦房店市',
											),
										8 =>
											array (
												'id' => '210282',
												'name' => '普兰店市',
											),
										9 =>
											array (
												'id' => '210283',
												'name' => '庄河市',
											),
									),
							),
						2 =>
							array (
								'id' => '210300',
								'name' => '鞍山市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '210302',
												'name' => '铁东区',
											),
										1 =>
											array (
												'id' => '210303',
												'name' => '铁西区',
											),
										2 =>
											array (
												'id' => '210304',
												'name' => '立山区',
											),
										3 =>
											array (
												'id' => '210311',
												'name' => '千山区',
											),
										4 =>
											array (
												'id' => '210321',
												'name' => '台安县',
											),
										5 =>
											array (
												'id' => '210323',
												'name' => '岫岩满族自治县',
											),
										6 =>
											array (
												'id' => '210381',
												'name' => '海城市',
											),
									),
							),
						3 =>
							array (
								'id' => '210400',
								'name' => '抚顺市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '210402',
												'name' => '新抚区',
											),
										1 =>
											array (
												'id' => '210403',
												'name' => '东洲区',
											),
										2 =>
											array (
												'id' => '210404',
												'name' => '望花区',
											),
										3 =>
											array (
												'id' => '210411',
												'name' => '顺城区',
											),
										4 =>
											array (
												'id' => '210421',
												'name' => '抚顺县',
											),
										5 =>
											array (
												'id' => '210422',
												'name' => '新宾满族自治县',
											),
										6 =>
											array (
												'id' => '210423',
												'name' => '清原满族自治县',
											),
									),
							),
						4 =>
							array (
								'id' => '210500',
								'name' => '本溪市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '210502',
												'name' => '平山区',
											),
										1 =>
											array (
												'id' => '210503',
												'name' => '溪湖区',
											),
										2 =>
											array (
												'id' => '210504',
												'name' => '明山区',
											),
										3 =>
											array (
												'id' => '210505',
												'name' => '南芬区',
											),
										4 =>
											array (
												'id' => '210521',
												'name' => '本溪满族自治县',
											),
										5 =>
											array (
												'id' => '210522',
												'name' => '桓仁满族自治县',
											),
									),
							),
						5 =>
							array (
								'id' => '210600',
								'name' => '丹东市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '210602',
												'name' => '元宝区',
											),
										1 =>
											array (
												'id' => '210603',
												'name' => '振兴区',
											),
										2 =>
											array (
												'id' => '210604',
												'name' => '振安区',
											),
										3 =>
											array (
												'id' => '210624',
												'name' => '宽甸满族自治县',
											),
										4 =>
											array (
												'id' => '210681',
												'name' => '东港市',
											),
										5 =>
											array (
												'id' => '210682',
												'name' => '凤城市',
											),
									),
							),
						6 =>
							array (
								'id' => '210700',
								'name' => '锦州市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '210702',
												'name' => '古塔区',
											),
										1 =>
											array (
												'id' => '210703',
												'name' => '凌河区',
											),
										2 =>
											array (
												'id' => '210711',
												'name' => '太和区',
											),
										3 =>
											array (
												'id' => '210726',
												'name' => '黑山县',
											),
										4 =>
											array (
												'id' => '210727',
												'name' => '义　县',
											),
										5 =>
											array (
												'id' => '210781',
												'name' => '凌海市',
											),
										6 =>
											array (
												'id' => '210782',
												'name' => '北宁市',
											),
									),
							),
						7 =>
							array (
								'id' => '210800',
								'name' => '营口市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '210802',
												'name' => '站前区',
											),
										1 =>
											array (
												'id' => '210803',
												'name' => '西市区',
											),
										2 =>
											array (
												'id' => '210804',
												'name' => '鲅鱼圈区',
											),
										3 =>
											array (
												'id' => '210811',
												'name' => '老边区',
											),
										4 =>
											array (
												'id' => '210881',
												'name' => '盖州市',
											),
										5 =>
											array (
												'id' => '210882',
												'name' => '大石桥市',
											),
									),
							),
						8 =>
							array (
								'id' => '210900',
								'name' => '阜新市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '210902',
												'name' => '海州区',
											),
										1 =>
											array (
												'id' => '210903',
												'name' => '新邱区',
											),
										2 =>
											array (
												'id' => '210904',
												'name' => '太平区',
											),
										3 =>
											array (
												'id' => '210905',
												'name' => '清河门区',
											),
										4 =>
											array (
												'id' => '210911',
												'name' => '细河区',
											),
										5 =>
											array (
												'id' => '210921',
												'name' => '阜新蒙古族自治县',
											),
										6 =>
											array (
												'id' => '210922',
												'name' => '彰武县',
											),
									),
							),
						9 =>
							array (
								'id' => '211000',
								'name' => '辽阳市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '211002',
												'name' => '白塔区',
											),
										1 =>
											array (
												'id' => '211003',
												'name' => '文圣区',
											),
										2 =>
											array (
												'id' => '211004',
												'name' => '宏伟区',
											),
										3 =>
											array (
												'id' => '211005',
												'name' => '弓长岭区',
											),
										4 =>
											array (
												'id' => '211011',
												'name' => '太子河区',
											),
										5 =>
											array (
												'id' => '211021',
												'name' => '辽阳县',
											),
										6 =>
											array (
												'id' => '211081',
												'name' => '灯塔市',
											),
									),
							),
						10 =>
							array (
								'id' => '211100',
								'name' => '盘锦市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '211102',
												'name' => '双台子区',
											),
										1 =>
											array (
												'id' => '211103',
												'name' => '兴隆台区',
											),
										2 =>
											array (
												'id' => '211121',
												'name' => '大洼县',
											),
										3 =>
											array (
												'id' => '211122',
												'name' => '盘山县',
											),
									),
							),
						11 =>
							array (
								'id' => '211200',
								'name' => '铁岭市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '211202',
												'name' => '银州区',
											),
										1 =>
											array (
												'id' => '211204',
												'name' => '清河区',
											),
										2 =>
											array (
												'id' => '211221',
												'name' => '铁岭县',
											),
										3 =>
											array (
												'id' => '211223',
												'name' => '西丰县',
											),
										4 =>
											array (
												'id' => '211224',
												'name' => '昌图县',
											),
										5 =>
											array (
												'id' => '211281',
												'name' => '调兵山市',
											),
										6 =>
											array (
												'id' => '211282',
												'name' => '开原市',
											),
									),
							),
						12 =>
							array (
								'id' => '211300',
								'name' => '朝阳市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '211302',
												'name' => '双塔区',
											),
										1 =>
											array (
												'id' => '211303',
												'name' => '龙城区',
											),
										2 =>
											array (
												'id' => '211321',
												'name' => '朝阳县',
											),
										3 =>
											array (
												'id' => '211322',
												'name' => '建平县',
											),
										4 =>
											array (
												'id' => '211324',
												'name' => '喀喇沁左翼蒙古族自治县',
											),
										5 =>
											array (
												'id' => '211381',
												'name' => '北票市',
											),
										6 =>
											array (
												'id' => '211382',
												'name' => '凌源市',
											),
									),
							),
						13 =>
							array (
								'id' => '211400',
								'name' => '葫芦岛市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '211402',
												'name' => '连山区',
											),
										1 =>
											array (
												'id' => '211403',
												'name' => '龙港区',
											),
										2 =>
											array (
												'id' => '211404',
												'name' => '南票区',
											),
										3 =>
											array (
												'id' => '211421',
												'name' => '绥中县',
											),
										4 =>
											array (
												'id' => '211422',
												'name' => '建昌县',
											),
										5 =>
											array (
												'id' => '211481',
												'name' => '兴城市',
											),
									),
							),
					),
			),
		6 =>
			array (
				'id' => '220000',
				'name' => '吉林省',
				'children' =>
					array (
						0 =>
							array (
								'id' => '220100',
								'name' => '长春市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '220102',
												'name' => '南关区',
											),
										1 =>
											array (
												'id' => '220103',
												'name' => '宽城区',
											),
										2 =>
											array (
												'id' => '220104',
												'name' => '朝阳区',
											),
										3 =>
											array (
												'id' => '220105',
												'name' => '二道区',
											),
										4 =>
											array (
												'id' => '220106',
												'name' => '绿园区',
											),
										5 =>
											array (
												'id' => '220112',
												'name' => '双阳区',
											),
										6 =>
											array (
												'id' => '220122',
												'name' => '农安县',
											),
										7 =>
											array (
												'id' => '220181',
												'name' => '九台市',
											),
										8 =>
											array (
												'id' => '220182',
												'name' => '榆树市',
											),
										9 =>
											array (
												'id' => '220183',
												'name' => '德惠市',
											),
									),
							),
						1 =>
							array (
								'id' => '220200',
								'name' => '吉林市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '220202',
												'name' => '昌邑区',
											),
										1 =>
											array (
												'id' => '220203',
												'name' => '龙潭区',
											),
										2 =>
											array (
												'id' => '220204',
												'name' => '船营区',
											),
										3 =>
											array (
												'id' => '220211',
												'name' => '丰满区',
											),
										4 =>
											array (
												'id' => '220221',
												'name' => '永吉县',
											),
										5 =>
											array (
												'id' => '220281',
												'name' => '蛟河市',
											),
										6 =>
											array (
												'id' => '220282',
												'name' => '桦甸市',
											),
										7 =>
											array (
												'id' => '220283',
												'name' => '舒兰市',
											),
										8 =>
											array (
												'id' => '220284',
												'name' => '磐石市',
											),
									),
							),
						2 =>
							array (
								'id' => '220300',
								'name' => '四平市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '220302',
												'name' => '铁西区',
											),
										1 =>
											array (
												'id' => '220303',
												'name' => '铁东区',
											),
										2 =>
											array (
												'id' => '220322',
												'name' => '梨树县',
											),
										3 =>
											array (
												'id' => '220323',
												'name' => '伊通满族自治县',
											),
										4 =>
											array (
												'id' => '220381',
												'name' => '公主岭市',
											),
										5 =>
											array (
												'id' => '220382',
												'name' => '双辽市',
											),
									),
							),
						3 =>
							array (
								'id' => '220400',
								'name' => '辽源市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '220402',
												'name' => '龙山区',
											),
										1 =>
											array (
												'id' => '220403',
												'name' => '西安区',
											),
										2 =>
											array (
												'id' => '220421',
												'name' => '东丰县',
											),
										3 =>
											array (
												'id' => '220422',
												'name' => '东辽县',
											),
									),
							),
						4 =>
							array (
								'id' => '220500',
								'name' => '通化市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '220502',
												'name' => '东昌区',
											),
										1 =>
											array (
												'id' => '220503',
												'name' => '二道江区',
											),
										2 =>
											array (
												'id' => '220521',
												'name' => '通化县',
											),
										3 =>
											array (
												'id' => '220523',
												'name' => '辉南县',
											),
										4 =>
											array (
												'id' => '220524',
												'name' => '柳河县',
											),
										5 =>
											array (
												'id' => '220581',
												'name' => '梅河口市',
											),
										6 =>
											array (
												'id' => '220582',
												'name' => '集安市',
											),
									),
							),
						5 =>
							array (
								'id' => '220600',
								'name' => '白山市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '220602',
												'name' => '八道江区',
											),
										1 =>
											array (
												'id' => '220621',
												'name' => '抚松县',
											),
										2 =>
											array (
												'id' => '220622',
												'name' => '靖宇县',
											),
										3 =>
											array (
												'id' => '220623',
												'name' => '长白朝鲜族自治县',
											),
										4 =>
											array (
												'id' => '220625',
												'name' => '江源县',
											),
										5 =>
											array (
												'id' => '220681',
												'name' => '临江市',
											),
									),
							),
						6 =>
							array (
								'id' => '220700',
								'name' => '松原市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '220702',
												'name' => '宁江区',
											),
										1 =>
											array (
												'id' => '220721',
												'name' => '前郭尔罗斯蒙古族自治县',
											),
										2 =>
											array (
												'id' => '220722',
												'name' => '长岭县',
											),
										3 =>
											array (
												'id' => '220723',
												'name' => '乾安县',
											),
										4 =>
											array (
												'id' => '220724',
												'name' => '扶余县',
											),
									),
							),
						7 =>
							array (
								'id' => '220800',
								'name' => '白城市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '220802',
												'name' => '洮北区',
											),
										1 =>
											array (
												'id' => '220821',
												'name' => '镇赉县',
											),
										2 =>
											array (
												'id' => '220822',
												'name' => '通榆县',
											),
										3 =>
											array (
												'id' => '220881',
												'name' => '洮南市',
											),
										4 =>
											array (
												'id' => '220882',
												'name' => '大安市',
											),
									),
							),
						8 =>
							array (
								'id' => '222400',
								'name' => '延边朝鲜族自治州',
								'children' =>
									array (
										0 =>
											array (
												'id' => '222401',
												'name' => '延吉市',
											),
										1 =>
											array (
												'id' => '222402',
												'name' => '图们市',
											),
										2 =>
											array (
												'id' => '222403',
												'name' => '敦化市',
											),
										3 =>
											array (
												'id' => '222404',
												'name' => '珲春市',
											),
										4 =>
											array (
												'id' => '222405',
												'name' => '龙井市',
											),
										5 =>
											array (
												'id' => '222406',
												'name' => '和龙市',
											),
										6 =>
											array (
												'id' => '222424',
												'name' => '汪清县',
											),
										7 =>
											array (
												'id' => '222426',
												'name' => '安图县',
											),
									),
							),
					),
			),
		7 =>
			array (
				'id' => '230000',
				'name' => '黑龙江省',
				'children' =>
					array (
						0 =>
							array (
								'id' => '230100',
								'name' => '哈尔滨市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '230102',
												'name' => '道里区',
											),
										1 =>
											array (
												'id' => '230103',
												'name' => '南岗区',
											),
										2 =>
											array (
												'id' => '230104',
												'name' => '道外区',
											),
										3 =>
											array (
												'id' => '230106',
												'name' => '香坊区',
											),
										4 =>
											array (
												'id' => '230107',
												'name' => '动力区',
											),
										5 =>
											array (
												'id' => '230108',
												'name' => '平房区',
											),
										6 =>
											array (
												'id' => '230109',
												'name' => '松北区',
											),
										7 =>
											array (
												'id' => '230111',
												'name' => '呼兰区',
											),
										8 =>
											array (
												'id' => '230123',
												'name' => '依兰县',
											),
										9 =>
											array (
												'id' => '230124',
												'name' => '方正县',
											),
										10 =>
											array (
												'id' => '230125',
												'name' => '宾　县',
											),
										11 =>
											array (
												'id' => '230126',
												'name' => '巴彦县',
											),
										12 =>
											array (
												'id' => '230127',
												'name' => '木兰县',
											),
										13 =>
											array (
												'id' => '230128',
												'name' => '通河县',
											),
										14 =>
											array (
												'id' => '230129',
												'name' => '延寿县',
											),
										15 =>
											array (
												'id' => '230181',
												'name' => '阿城市',
											),
										16 =>
											array (
												'id' => '230182',
												'name' => '双城市',
											),
										17 =>
											array (
												'id' => '230183',
												'name' => '尚志市',
											),
										18 =>
											array (
												'id' => '230184',
												'name' => '五常市',
											),
									),
							),
						1 =>
							array (
								'id' => '230200',
								'name' => '齐齐哈尔市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '230202',
												'name' => '龙沙区',
											),
										1 =>
											array (
												'id' => '230203',
												'name' => '建华区',
											),
										2 =>
											array (
												'id' => '230204',
												'name' => '铁锋区',
											),
										3 =>
											array (
												'id' => '230205',
												'name' => '昂昂溪区',
											),
										4 =>
											array (
												'id' => '230206',
												'name' => '富拉尔基区',
											),
										5 =>
											array (
												'id' => '230207',
												'name' => '碾子山区',
											),
										6 =>
											array (
												'id' => '230208',
												'name' => '梅里斯达斡尔族区',
											),
										7 =>
											array (
												'id' => '230221',
												'name' => '龙江县',
											),
										8 =>
											array (
												'id' => '230223',
												'name' => '依安县',
											),
										9 =>
											array (
												'id' => '230224',
												'name' => '泰来县',
											),
										10 =>
											array (
												'id' => '230225',
												'name' => '甘南县',
											),
										11 =>
											array (
												'id' => '230227',
												'name' => '富裕县',
											),
										12 =>
											array (
												'id' => '230229',
												'name' => '克山县',
											),
										13 =>
											array (
												'id' => '230230',
												'name' => '克东县',
											),
										14 =>
											array (
												'id' => '230231',
												'name' => '拜泉县',
											),
										15 =>
											array (
												'id' => '230281',
												'name' => '讷河市',
											),
									),
							),
						2 =>
							array (
								'id' => '230300',
								'name' => '鸡西市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '230302',
												'name' => '鸡冠区',
											),
										1 =>
											array (
												'id' => '230303',
												'name' => '恒山区',
											),
										2 =>
											array (
												'id' => '230304',
												'name' => '滴道区',
											),
										3 =>
											array (
												'id' => '230305',
												'name' => '梨树区',
											),
										4 =>
											array (
												'id' => '230306',
												'name' => '城子河区',
											),
										5 =>
											array (
												'id' => '230307',
												'name' => '麻山区',
											),
										6 =>
											array (
												'id' => '230321',
												'name' => '鸡东县',
											),
										7 =>
											array (
												'id' => '230381',
												'name' => '虎林市',
											),
										8 =>
											array (
												'id' => '230382',
												'name' => '密山市',
											),
									),
							),
						3 =>
							array (
								'id' => '230400',
								'name' => '鹤岗市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '230402',
												'name' => '向阳区',
											),
										1 =>
											array (
												'id' => '230403',
												'name' => '工农区',
											),
										2 =>
											array (
												'id' => '230404',
												'name' => '南山区',
											),
										3 =>
											array (
												'id' => '230405',
												'name' => '兴安区',
											),
										4 =>
											array (
												'id' => '230406',
												'name' => '东山区',
											),
										5 =>
											array (
												'id' => '230407',
												'name' => '兴山区',
											),
										6 =>
											array (
												'id' => '230421',
												'name' => '萝北县',
											),
										7 =>
											array (
												'id' => '230422',
												'name' => '绥滨县',
											),
									),
							),
						4 =>
							array (
								'id' => '230500',
								'name' => '双鸭山市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '230502',
												'name' => '尖山区',
											),
										1 =>
											array (
												'id' => '230503',
												'name' => '岭东区',
											),
										2 =>
											array (
												'id' => '230505',
												'name' => '四方台区',
											),
										3 =>
											array (
												'id' => '230506',
												'name' => '宝山区',
											),
										4 =>
											array (
												'id' => '230521',
												'name' => '集贤县',
											),
										5 =>
											array (
												'id' => '230522',
												'name' => '友谊县',
											),
										6 =>
											array (
												'id' => '230523',
												'name' => '宝清县',
											),
										7 =>
											array (
												'id' => '230524',
												'name' => '饶河县',
											),
									),
							),
						5 =>
							array (
								'id' => '230600',
								'name' => '大庆市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '230602',
												'name' => '萨尔图区',
											),
										1 =>
											array (
												'id' => '230603',
												'name' => '龙凤区',
											),
										2 =>
											array (
												'id' => '230604',
												'name' => '让胡路区',
											),
										3 =>
											array (
												'id' => '230605',
												'name' => '红岗区',
											),
										4 =>
											array (
												'id' => '230606',
												'name' => '大同区',
											),
										5 =>
											array (
												'id' => '230621',
												'name' => '肇州县',
											),
										6 =>
											array (
												'id' => '230622',
												'name' => '肇源县',
											),
										7 =>
											array (
												'id' => '230623',
												'name' => '林甸县',
											),
										8 =>
											array (
												'id' => '230624',
												'name' => '杜尔伯特蒙古族自治县',
											),
									),
							),
						6 =>
							array (
								'id' => '230700',
								'name' => '伊春市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '230702',
												'name' => '伊春区',
											),
										1 =>
											array (
												'id' => '230703',
												'name' => '南岔区',
											),
										2 =>
											array (
												'id' => '230704',
												'name' => '友好区',
											),
										3 =>
											array (
												'id' => '230705',
												'name' => '西林区',
											),
										4 =>
											array (
												'id' => '230706',
												'name' => '翠峦区',
											),
										5 =>
											array (
												'id' => '230707',
												'name' => '新青区',
											),
										6 =>
											array (
												'id' => '230708',
												'name' => '美溪区',
											),
										7 =>
											array (
												'id' => '230709',
												'name' => '金山屯区',
											),
										8 =>
											array (
												'id' => '230710',
												'name' => '五营区',
											),
										9 =>
											array (
												'id' => '230711',
												'name' => '乌马河区',
											),
										10 =>
											array (
												'id' => '230712',
												'name' => '汤旺河区',
											),
										11 =>
											array (
												'id' => '230713',
												'name' => '带岭区',
											),
										12 =>
											array (
												'id' => '230714',
												'name' => '乌伊岭区',
											),
										13 =>
											array (
												'id' => '230715',
												'name' => '红星区',
											),
										14 =>
											array (
												'id' => '230716',
												'name' => '上甘岭区',
											),
										15 =>
											array (
												'id' => '230722',
												'name' => '嘉荫县',
											),
										16 =>
											array (
												'id' => '230781',
												'name' => '铁力市',
											),
									),
							),
						7 =>
							array (
								'id' => '230800',
								'name' => '佳木斯市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '230802',
												'name' => '永红区',
											),
										1 =>
											array (
												'id' => '230803',
												'name' => '向阳区',
											),
										2 =>
											array (
												'id' => '230804',
												'name' => '前进区',
											),
										3 =>
											array (
												'id' => '230805',
												'name' => '东风区',
											),
										4 =>
											array (
												'id' => '230811',
												'name' => '郊　区',
											),
										5 =>
											array (
												'id' => '230822',
												'name' => '桦南县',
											),
										6 =>
											array (
												'id' => '230826',
												'name' => '桦川县',
											),
										7 =>
											array (
												'id' => '230828',
												'name' => '汤原县',
											),
										8 =>
											array (
												'id' => '230833',
												'name' => '抚远县',
											),
										9 =>
											array (
												'id' => '230881',
												'name' => '同江市',
											),
										10 =>
											array (
												'id' => '230882',
												'name' => '富锦市',
											),
									),
							),
						8 =>
							array (
								'id' => '230900',
								'name' => '七台河市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '230902',
												'name' => '新兴区',
											),
										1 =>
											array (
												'id' => '230903',
												'name' => '桃山区',
											),
										2 =>
											array (
												'id' => '230904',
												'name' => '茄子河区',
											),
										3 =>
											array (
												'id' => '230921',
												'name' => '勃利县',
											),
									),
							),
						9 =>
							array (
								'id' => '231000',
								'name' => '牡丹江市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '231002',
												'name' => '东安区',
											),
										1 =>
											array (
												'id' => '231003',
												'name' => '阳明区',
											),
										2 =>
											array (
												'id' => '231004',
												'name' => '爱民区',
											),
										3 =>
											array (
												'id' => '231005',
												'name' => '西安区',
											),
										4 =>
											array (
												'id' => '231024',
												'name' => '东宁县',
											),
										5 =>
											array (
												'id' => '231025',
												'name' => '林口县',
											),
										6 =>
											array (
												'id' => '231081',
												'name' => '绥芬河市',
											),
										7 =>
											array (
												'id' => '231083',
												'name' => '海林市',
											),
										8 =>
											array (
												'id' => '231084',
												'name' => '宁安市',
											),
										9 =>
											array (
												'id' => '231085',
												'name' => '穆棱市',
											),
									),
							),
						10 =>
							array (
								'id' => '231100',
								'name' => '黑河市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '231102',
												'name' => '爱辉区',
											),
										1 =>
											array (
												'id' => '231121',
												'name' => '嫩江县',
											),
										2 =>
											array (
												'id' => '231123',
												'name' => '逊克县',
											),
										3 =>
											array (
												'id' => '231124',
												'name' => '孙吴县',
											),
										4 =>
											array (
												'id' => '231181',
												'name' => '北安市',
											),
										5 =>
											array (
												'id' => '231182',
												'name' => '五大连池市',
											),
									),
							),
						11 =>
							array (
								'id' => '231200',
								'name' => '绥化市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '231202',
												'name' => '北林区',
											),
										1 =>
											array (
												'id' => '231221',
												'name' => '望奎县',
											),
										2 =>
											array (
												'id' => '231222',
												'name' => '兰西县',
											),
										3 =>
											array (
												'id' => '231223',
												'name' => '青冈县',
											),
										4 =>
											array (
												'id' => '231224',
												'name' => '庆安县',
											),
										5 =>
											array (
												'id' => '231225',
												'name' => '明水县',
											),
										6 =>
											array (
												'id' => '231226',
												'name' => '绥棱县',
											),
										7 =>
											array (
												'id' => '231281',
												'name' => '安达市',
											),
										8 =>
											array (
												'id' => '231282',
												'name' => '肇东市',
											),
										9 =>
											array (
												'id' => '231283',
												'name' => '海伦市',
											),
									),
							),
						12 =>
							array (
								'id' => '232700',
								'name' => '大兴安岭地区',
								'children' =>
									array (
										0 =>
											array (
												'id' => '232721',
												'name' => '呼玛县',
											),
										1 =>
											array (
												'id' => '232722',
												'name' => '塔河县',
											),
										2 =>
											array (
												'id' => '232723',
												'name' => '漠河县',
											),
									),
							),
					),
			),
		8 =>
			array (
				'id' => '310000',
				'name' => '上海市',
				'children' =>
					array (
						0 =>
							array (
								'id' => '310101',
								'name' => '黄浦区',
							),
						1 =>
							array (
								'id' => '310103',
								'name' => '卢湾区',
							),
						2 =>
							array (
								'id' => '310104',
								'name' => '徐汇区',
							),
						3 =>
							array (
								'id' => '310105',
								'name' => '长宁区',
							),
						4 =>
							array (
								'id' => '310106',
								'name' => '静安区',
							),
						5 =>
							array (
								'id' => '310107',
								'name' => '普陀区',
							),
						6 =>
							array (
								'id' => '310108',
								'name' => '闸北区',
							),
						7 =>
							array (
								'id' => '310109',
								'name' => '虹口区',
							),
						8 =>
							array (
								'id' => '310110',
								'name' => '杨浦区',
							),
						9 =>
							array (
								'id' => '310112',
								'name' => '闵行区',
							),
						10 =>
							array (
								'id' => '310113',
								'name' => '宝山区',
							),
						11 =>
							array (
								'id' => '310114',
								'name' => '嘉定区',
							),
						12 =>
							array (
								'id' => '310115',
								'name' => '浦东新区',
							),
						13 =>
							array (
								'id' => '310116',
								'name' => '金山区',
							),
						14 =>
							array (
								'id' => '310117',
								'name' => '松江区',
							),
						15 =>
							array (
								'id' => '310118',
								'name' => '青浦区',
							),
						16 =>
							array (
								'id' => '310119',
								'name' => '南汇区',
							),
						17 =>
							array (
								'id' => '310120',
								'name' => '奉贤区',
							),
						18 =>
							array (
								'id' => '310200',
								'name' => '县',
								'children' =>
									array (
										0 =>
											array (
												'id' => '310230',
												'name' => '崇明县',
											),
									),
							),
					),
			),
		9 =>
			array (
				'id' => '320000',
				'name' => '江苏省',
				'children' =>
					array (
						0 =>
							array (
								'id' => '320100',
								'name' => '南京市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '320102',
												'name' => '玄武区',
											),
										1 =>
											array (
												'id' => '320103',
												'name' => '白下区',
											),
										2 =>
											array (
												'id' => '320104',
												'name' => '秦淮区',
											),
										3 =>
											array (
												'id' => '320105',
												'name' => '建邺区',
											),
										4 =>
											array (
												'id' => '320106',
												'name' => '鼓楼区',
											),
										5 =>
											array (
												'id' => '320107',
												'name' => '下关区',
											),
										6 =>
											array (
												'id' => '320111',
												'name' => '浦口区',
											),
										7 =>
											array (
												'id' => '320113',
												'name' => '栖霞区',
											),
										8 =>
											array (
												'id' => '320114',
												'name' => '雨花台区',
											),
										9 =>
											array (
												'id' => '320115',
												'name' => '江宁区',
											),
										10 =>
											array (
												'id' => '320116',
												'name' => '六合区',
											),
										11 =>
											array (
												'id' => '320124',
												'name' => '溧水县',
											),
										12 =>
											array (
												'id' => '320125',
												'name' => '高淳县',
											),
									),
							),
						1 =>
							array (
								'id' => '320200',
								'name' => '无锡市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '320202',
												'name' => '崇安区',
											),
										1 =>
											array (
												'id' => '320203',
												'name' => '南长区',
											),
										2 =>
											array (
												'id' => '320204',
												'name' => '北塘区',
											),
										3 =>
											array (
												'id' => '320205',
												'name' => '锡山区',
											),
										4 =>
											array (
												'id' => '320206',
												'name' => '惠山区',
											),
										5 =>
											array (
												'id' => '320211',
												'name' => '滨湖区',
											),
										6 =>
											array (
												'id' => '320281',
												'name' => '江阴市',
											),
										7 =>
											array (
												'id' => '320282',
												'name' => '宜兴市',
											),
									),
							),
						2 =>
							array (
								'id' => '320300',
								'name' => '徐州市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '320302',
												'name' => '鼓楼区',
											),
										1 =>
											array (
												'id' => '320303',
												'name' => '云龙区',
											),
										2 =>
											array (
												'id' => '320304',
												'name' => '九里区',
											),
										3 =>
											array (
												'id' => '320305',
												'name' => '贾汪区',
											),
										4 =>
											array (
												'id' => '320311',
												'name' => '泉山区',
											),
										5 =>
											array (
												'id' => '320321',
												'name' => '丰　县',
											),
										6 =>
											array (
												'id' => '320322',
												'name' => '沛　县',
											),
										7 =>
											array (
												'id' => '320323',
												'name' => '铜山县',
											),
										8 =>
											array (
												'id' => '320324',
												'name' => '睢宁县',
											),
										9 =>
											array (
												'id' => '320381',
												'name' => '新沂市',
											),
										10 =>
											array (
												'id' => '320382',
												'name' => '邳州市',
											),
									),
							),
						3 =>
							array (
								'id' => '320400',
								'name' => '常州市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '320402',
												'name' => '天宁区',
											),
										1 =>
											array (
												'id' => '320404',
												'name' => '钟楼区',
											),
										2 =>
											array (
												'id' => '320405',
												'name' => '戚墅堰区',
											),
										3 =>
											array (
												'id' => '320411',
												'name' => '新北区',
											),
										4 =>
											array (
												'id' => '320412',
												'name' => '武进区',
											),
										5 =>
											array (
												'id' => '320481',
												'name' => '溧阳市',
											),
										6 =>
											array (
												'id' => '320482',
												'name' => '金坛市',
											),
									),
							),
						4 =>
							array (
								'id' => '320500',
								'name' => '苏州市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '320502',
												'name' => '沧浪区',
											),
										1 =>
											array (
												'id' => '320503',
												'name' => '平江区',
											),
										2 =>
											array (
												'id' => '320504',
												'name' => '金阊区',
											),
										3 =>
											array (
												'id' => '320505',
												'name' => '虎丘区',
											),
										4 =>
											array (
												'id' => '320506',
												'name' => '吴中区',
											),
										5 =>
											array (
												'id' => '320507',
												'name' => '相城区',
											),
										6 =>
											array (
												'id' => '320581',
												'name' => '常熟市',
											),
										7 =>
											array (
												'id' => '320582',
												'name' => '张家港市',
											),
										8 =>
											array (
												'id' => '320583',
												'name' => '昆山市',
											),
										9 =>
											array (
												'id' => '320584',
												'name' => '吴江市',
											),
										10 =>
											array (
												'id' => '320585',
												'name' => '太仓市',
											),
									),
							),
						5 =>
							array (
								'id' => '320600',
								'name' => '南通市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '320602',
												'name' => '崇川区',
											),
										1 =>
											array (
												'id' => '320611',
												'name' => '港闸区',
											),
										2 =>
											array (
												'id' => '320621',
												'name' => '海安县',
											),
										3 =>
											array (
												'id' => '320623',
												'name' => '如东县',
											),
										4 =>
											array (
												'id' => '320681',
												'name' => '启东市',
											),
										5 =>
											array (
												'id' => '320682',
												'name' => '如皋市',
											),
										6 =>
											array (
												'id' => '320683',
												'name' => '通州市',
											),
										7 =>
											array (
												'id' => '320684',
												'name' => '海门市',
											),
									),
							),
						6 =>
							array (
								'id' => '320700',
								'name' => '连云港市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '320703',
												'name' => '连云区',
											),
										1 =>
											array (
												'id' => '320705',
												'name' => '新浦区',
											),
										2 =>
											array (
												'id' => '320706',
												'name' => '海州区',
											),
										3 =>
											array (
												'id' => '320721',
												'name' => '赣榆县',
											),
										4 =>
											array (
												'id' => '320722',
												'name' => '东海县',
											),
										5 =>
											array (
												'id' => '320723',
												'name' => '灌云县',
											),
										6 =>
											array (
												'id' => '320724',
												'name' => '灌南县',
											),
									),
							),
						7 =>
							array (
								'id' => '320800',
								'name' => '淮安市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '320802',
												'name' => '清河区',
											),
										1 =>
											array (
												'id' => '320803',
												'name' => '楚州区',
											),
										2 =>
											array (
												'id' => '320804',
												'name' => '淮阴区',
											),
										3 =>
											array (
												'id' => '320811',
												'name' => '清浦区',
											),
										4 =>
											array (
												'id' => '320826',
												'name' => '涟水县',
											),
										5 =>
											array (
												'id' => '320829',
												'name' => '洪泽县',
											),
										6 =>
											array (
												'id' => '320830',
												'name' => '盱眙县',
											),
										7 =>
											array (
												'id' => '320831',
												'name' => '金湖县',
											),
									),
							),
						8 =>
							array (
								'id' => '320900',
								'name' => '盐城市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '320902',
												'name' => '亭湖区',
											),
										1 =>
											array (
												'id' => '320903',
												'name' => '盐都区',
											),
										2 =>
											array (
												'id' => '320921',
												'name' => '响水县',
											),
										3 =>
											array (
												'id' => '320922',
												'name' => '滨海县',
											),
										4 =>
											array (
												'id' => '320923',
												'name' => '阜宁县',
											),
										5 =>
											array (
												'id' => '320924',
												'name' => '射阳县',
											),
										6 =>
											array (
												'id' => '320925',
												'name' => '建湖县',
											),
										7 =>
											array (
												'id' => '320981',
												'name' => '东台市',
											),
										8 =>
											array (
												'id' => '320982',
												'name' => '大丰市',
											),
									),
							),
						9 =>
							array (
								'id' => '321000',
								'name' => '扬州市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '321002',
												'name' => '广陵区',
											),
										1 =>
											array (
												'id' => '321003',
												'name' => '邗江区',
											),
										2 =>
											array (
												'id' => '321011',
												'name' => '郊　区',
											),
										3 =>
											array (
												'id' => '321023',
												'name' => '宝应县',
											),
										4 =>
											array (
												'id' => '321081',
												'name' => '仪征市',
											),
										5 =>
											array (
												'id' => '321084',
												'name' => '高邮市',
											),
										6 =>
											array (
												'id' => '321088',
												'name' => '江都市',
											),
									),
							),
						10 =>
							array (
								'id' => '321100',
								'name' => '镇江市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '321102',
												'name' => '京口区',
											),
										1 =>
											array (
												'id' => '321111',
												'name' => '润州区',
											),
										2 =>
											array (
												'id' => '321112',
												'name' => '丹徒区',
											),
										3 =>
											array (
												'id' => '321181',
												'name' => '丹阳市',
											),
										4 =>
											array (
												'id' => '321182',
												'name' => '扬中市',
											),
										5 =>
											array (
												'id' => '321183',
												'name' => '句容市',
											),
									),
							),
						11 =>
							array (
								'id' => '321200',
								'name' => '泰州市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '321202',
												'name' => '海陵区',
											),
										1 =>
											array (
												'id' => '321203',
												'name' => '高港区',
											),
										2 =>
											array (
												'id' => '321281',
												'name' => '兴化市',
											),
										3 =>
											array (
												'id' => '321282',
												'name' => '靖江市',
											),
										4 =>
											array (
												'id' => '321283',
												'name' => '泰兴市',
											),
										5 =>
											array (
												'id' => '321284',
												'name' => '姜堰市',
											),
									),
							),
						12 =>
							array (
								'id' => '321300',
								'name' => '宿迁市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '321302',
												'name' => '宿城区',
											),
										1 =>
											array (
												'id' => '321311',
												'name' => '宿豫区',
											),
										2 =>
											array (
												'id' => '321322',
												'name' => '沭阳县',
											),
										3 =>
											array (
												'id' => '321323',
												'name' => '泗阳县',
											),
										4 =>
											array (
												'id' => '321324',
												'name' => '泗洪县',
											),
									),
							),
					),
			),
		10 =>
			array (
				'id' => '330000',
				'name' => '浙江省',
				'children' =>
					array (
						0 =>
							array (
								'id' => '330100',
								'name' => '杭州市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '330102',
												'name' => '上城区',
											),
										1 =>
											array (
												'id' => '330103',
												'name' => '下城区',
											),
										2 =>
											array (
												'id' => '330104',
												'name' => '江干区',
											),
										3 =>
											array (
												'id' => '330105',
												'name' => '拱墅区',
											),
										4 =>
											array (
												'id' => '330106',
												'name' => '西湖区',
											),
										5 =>
											array (
												'id' => '330108',
												'name' => '滨江区',
											),
										6 =>
											array (
												'id' => '330109',
												'name' => '萧山区',
											),
										7 =>
											array (
												'id' => '330110',
												'name' => '余杭区',
											),
										8 =>
											array (
												'id' => '330122',
												'name' => '桐庐县',
											),
										9 =>
											array (
												'id' => '330127',
												'name' => '淳安县',
											),
										10 =>
											array (
												'id' => '330182',
												'name' => '建德市',
											),
										11 =>
											array (
												'id' => '330183',
												'name' => '富阳市',
											),
										12 =>
											array (
												'id' => '330185',
												'name' => '临安市',
											),
									),
							),
						1 =>
							array (
								'id' => '330200',
								'name' => '宁波市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '330203',
												'name' => '海曙区',
											),
										1 =>
											array (
												'id' => '330204',
												'name' => '江东区',
											),
										2 =>
											array (
												'id' => '330205',
												'name' => '江北区',
											),
										3 =>
											array (
												'id' => '330206',
												'name' => '北仑区',
											),
										4 =>
											array (
												'id' => '330211',
												'name' => '镇海区',
											),
										5 =>
											array (
												'id' => '330212',
												'name' => '鄞州区',
											),
										6 =>
											array (
												'id' => '330225',
												'name' => '象山县',
											),
										7 =>
											array (
												'id' => '330226',
												'name' => '宁海县',
											),
										8 =>
											array (
												'id' => '330281',
												'name' => '余姚市',
											),
										9 =>
											array (
												'id' => '330282',
												'name' => '慈溪市',
											),
										10 =>
											array (
												'id' => '330283',
												'name' => '奉化市',
											),
									),
							),
						2 =>
							array (
								'id' => '330300',
								'name' => '温州市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '330302',
												'name' => '鹿城区',
											),
										1 =>
											array (
												'id' => '330303',
												'name' => '龙湾区',
											),
										2 =>
											array (
												'id' => '330304',
												'name' => '瓯海区',
											),
										3 =>
											array (
												'id' => '330322',
												'name' => '洞头县',
											),
										4 =>
											array (
												'id' => '330324',
												'name' => '永嘉县',
											),
										5 =>
											array (
												'id' => '330326',
												'name' => '平阳县',
											),
										6 =>
											array (
												'id' => '330327',
												'name' => '苍南县',
											),
										7 =>
											array (
												'id' => '330328',
												'name' => '文成县',
											),
										8 =>
											array (
												'id' => '330329',
												'name' => '泰顺县',
											),
										9 =>
											array (
												'id' => '330381',
												'name' => '瑞安市',
											),
										10 =>
											array (
												'id' => '330382',
												'name' => '乐清市',
											),
									),
							),
						3 =>
							array (
								'id' => '330400',
								'name' => '嘉兴市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '330402',
												'name' => '秀城区',
											),
										1 =>
											array (
												'id' => '330411',
												'name' => '秀洲区',
											),
										2 =>
											array (
												'id' => '330421',
												'name' => '嘉善县',
											),
										3 =>
											array (
												'id' => '330424',
												'name' => '海盐县',
											),
										4 =>
											array (
												'id' => '330481',
												'name' => '海宁市',
											),
										5 =>
											array (
												'id' => '330482',
												'name' => '平湖市',
											),
										6 =>
											array (
												'id' => '330483',
												'name' => '桐乡市',
											),
									),
							),
						4 =>
							array (
								'id' => '330500',
								'name' => '湖州市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '330502',
												'name' => '吴兴区',
											),
										1 =>
											array (
												'id' => '330503',
												'name' => '南浔区',
											),
										2 =>
											array (
												'id' => '330521',
												'name' => '德清县',
											),
										3 =>
											array (
												'id' => '330522',
												'name' => '长兴县',
											),
										4 =>
											array (
												'id' => '330523',
												'name' => '安吉县',
											),
									),
							),
						5 =>
							array (
								'id' => '330600',
								'name' => '绍兴市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '330602',
												'name' => '越城区',
											),
										1 =>
											array (
												'id' => '330621',
												'name' => '绍兴县',
											),
										2 =>
											array (
												'id' => '330624',
												'name' => '新昌县',
											),
										3 =>
											array (
												'id' => '330681',
												'name' => '诸暨市',
											),
										4 =>
											array (
												'id' => '330682',
												'name' => '上虞市',
											),
										5 =>
											array (
												'id' => '330683',
												'name' => '嵊州市',
											),
									),
							),
						6 =>
							array (
								'id' => '330700',
								'name' => '金华市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '330702',
												'name' => '婺城区',
											),
										1 =>
											array (
												'id' => '330703',
												'name' => '金东区',
											),
										2 =>
											array (
												'id' => '330723',
												'name' => '武义县',
											),
										3 =>
											array (
												'id' => '330726',
												'name' => '浦江县',
											),
										4 =>
											array (
												'id' => '330727',
												'name' => '磐安县',
											),
										5 =>
											array (
												'id' => '330781',
												'name' => '兰溪市',
											),
										6 =>
											array (
												'id' => '330782',
												'name' => '义乌市',
											),
										7 =>
											array (
												'id' => '330783',
												'name' => '东阳市',
											),
										8 =>
											array (
												'id' => '330784',
												'name' => '永康市',
											),
									),
							),
						7 =>
							array (
								'id' => '330800',
								'name' => '衢州市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '330802',
												'name' => '柯城区',
											),
										1 =>
											array (
												'id' => '330803',
												'name' => '衢江区',
											),
										2 =>
											array (
												'id' => '330822',
												'name' => '常山县',
											),
										3 =>
											array (
												'id' => '330824',
												'name' => '开化县',
											),
										4 =>
											array (
												'id' => '330825',
												'name' => '龙游县',
											),
										5 =>
											array (
												'id' => '330881',
												'name' => '江山市',
											),
									),
							),
						8 =>
							array (
								'id' => '330900',
								'name' => '舟山市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '330902',
												'name' => '定海区',
											),
										1 =>
											array (
												'id' => '330903',
												'name' => '普陀区',
											),
										2 =>
											array (
												'id' => '330921',
												'name' => '岱山县',
											),
										3 =>
											array (
												'id' => '330922',
												'name' => '嵊泗县',
											),
									),
							),
						9 =>
							array (
								'id' => '331000',
								'name' => '台州市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '331002',
												'name' => '椒江区',
											),
										1 =>
											array (
												'id' => '331003',
												'name' => '黄岩区',
											),
										2 =>
											array (
												'id' => '331004',
												'name' => '路桥区',
											),
										3 =>
											array (
												'id' => '331021',
												'name' => '玉环县',
											),
										4 =>
											array (
												'id' => '331022',
												'name' => '三门县',
											),
										5 =>
											array (
												'id' => '331023',
												'name' => '天台县',
											),
										6 =>
											array (
												'id' => '331024',
												'name' => '仙居县',
											),
										7 =>
											array (
												'id' => '331081',
												'name' => '温岭市',
											),
										8 =>
											array (
												'id' => '331082',
												'name' => '临海市',
											),
									),
							),
						10 =>
							array (
								'id' => '331100',
								'name' => '丽水市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '331102',
												'name' => '莲都区',
											),
										1 =>
											array (
												'id' => '331121',
												'name' => '青田县',
											),
										2 =>
											array (
												'id' => '331122',
												'name' => '缙云县',
											),
										3 =>
											array (
												'id' => '331123',
												'name' => '遂昌县',
											),
										4 =>
											array (
												'id' => '331124',
												'name' => '松阳县',
											),
										5 =>
											array (
												'id' => '331125',
												'name' => '云和县',
											),
										6 =>
											array (
												'id' => '331126',
												'name' => '庆元县',
											),
										7 =>
											array (
												'id' => '331127',
												'name' => '景宁畲族自治县',
											),
										8 =>
											array (
												'id' => '331181',
												'name' => '龙泉市',
											),
									),
							),
					),
			),
		11 =>
			array (
				'id' => '340000',
				'name' => '安徽省',
				'children' =>
					array (
						0 =>
							array (
								'id' => '340100',
								'name' => '合肥市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '340102',
												'name' => '瑶海区',
											),
										1 =>
											array (
												'id' => '340103',
												'name' => '庐阳区',
											),
										2 =>
											array (
												'id' => '340104',
												'name' => '蜀山区',
											),
										3 =>
											array (
												'id' => '340111',
												'name' => '包河区',
											),
										4 =>
											array (
												'id' => '340121',
												'name' => '长丰县',
											),
										5 =>
											array (
												'id' => '340122',
												'name' => '肥东县',
											),
										6 =>
											array (
												'id' => '340123',
												'name' => '肥西县',
											),
									),
							),
						1 =>
							array (
								'id' => '340200',
								'name' => '芜湖市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '340202',
												'name' => '镜湖区',
											),
										1 =>
											array (
												'id' => '340203',
												'name' => '马塘区',
											),
										2 =>
											array (
												'id' => '340204',
												'name' => '新芜区',
											),
										3 =>
											array (
												'id' => '340207',
												'name' => '鸠江区',
											),
										4 =>
											array (
												'id' => '340221',
												'name' => '芜湖县',
											),
										5 =>
											array (
												'id' => '340222',
												'name' => '繁昌县',
											),
										6 =>
											array (
												'id' => '340223',
												'name' => '南陵县',
											),
									),
							),
						2 =>
							array (
								'id' => '340300',
								'name' => '蚌埠市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '340302',
												'name' => '龙子湖区',
											),
										1 =>
											array (
												'id' => '340303',
												'name' => '蚌山区',
											),
										2 =>
											array (
												'id' => '340304',
												'name' => '禹会区',
											),
										3 =>
											array (
												'id' => '340311',
												'name' => '淮上区',
											),
										4 =>
											array (
												'id' => '340321',
												'name' => '怀远县',
											),
										5 =>
											array (
												'id' => '340322',
												'name' => '五河县',
											),
										6 =>
											array (
												'id' => '340323',
												'name' => '固镇县',
											),
									),
							),
						3 =>
							array (
								'id' => '340400',
								'name' => '淮南市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '340402',
												'name' => '大通区',
											),
										1 =>
											array (
												'id' => '340403',
												'name' => '田家庵区',
											),
										2 =>
											array (
												'id' => '340404',
												'name' => '谢家集区',
											),
										3 =>
											array (
												'id' => '340405',
												'name' => '八公山区',
											),
										4 =>
											array (
												'id' => '340406',
												'name' => '潘集区',
											),
										5 =>
											array (
												'id' => '340421',
												'name' => '凤台县',
											),
									),
							),
						4 =>
							array (
								'id' => '340500',
								'name' => '马鞍山市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '340502',
												'name' => '金家庄区',
											),
										1 =>
											array (
												'id' => '340503',
												'name' => '花山区',
											),
										2 =>
											array (
												'id' => '340504',
												'name' => '雨山区',
											),
										3 =>
											array (
												'id' => '340521',
												'name' => '当涂县',
											),
									),
							),
						5 =>
							array (
								'id' => '340600',
								'name' => '淮北市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '340602',
												'name' => '杜集区',
											),
										1 =>
											array (
												'id' => '340603',
												'name' => '相山区',
											),
										2 =>
											array (
												'id' => '340604',
												'name' => '烈山区',
											),
										3 =>
											array (
												'id' => '340621',
												'name' => '濉溪县',
											),
									),
							),
						6 =>
							array (
								'id' => '340700',
								'name' => '铜陵市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '340702',
												'name' => '铜官山区',
											),
										1 =>
											array (
												'id' => '340703',
												'name' => '狮子山区',
											),
										2 =>
											array (
												'id' => '340711',
												'name' => '郊　区',
											),
										3 =>
											array (
												'id' => '340721',
												'name' => '铜陵县',
											),
									),
							),
						7 =>
							array (
								'id' => '340800',
								'name' => '安庆市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '340802',
												'name' => '迎江区',
											),
										1 =>
											array (
												'id' => '340803',
												'name' => '大观区',
											),
										2 =>
											array (
												'id' => '340811',
												'name' => '郊　区',
											),
										3 =>
											array (
												'id' => '340822',
												'name' => '怀宁县',
											),
										4 =>
											array (
												'id' => '340823',
												'name' => '枞阳县',
											),
										5 =>
											array (
												'id' => '340824',
												'name' => '潜山县',
											),
										6 =>
											array (
												'id' => '340825',
												'name' => '太湖县',
											),
										7 =>
											array (
												'id' => '340826',
												'name' => '宿松县',
											),
										8 =>
											array (
												'id' => '340827',
												'name' => '望江县',
											),
										9 =>
											array (
												'id' => '340828',
												'name' => '岳西县',
											),
										10 =>
											array (
												'id' => '340881',
												'name' => '桐城市',
											),
									),
							),
						8 =>
							array (
								'id' => '341000',
								'name' => '黄山市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '341002',
												'name' => '屯溪区',
											),
										1 =>
											array (
												'id' => '341003',
												'name' => '黄山区',
											),
										2 =>
											array (
												'id' => '341004',
												'name' => '徽州区',
											),
										3 =>
											array (
												'id' => '341021',
												'name' => '歙　县',
											),
										4 =>
											array (
												'id' => '341022',
												'name' => '休宁县',
											),
										5 =>
											array (
												'id' => '341023',
												'name' => '黟　县',
											),
										6 =>
											array (
												'id' => '341024',
												'name' => '祁门县',
											),
									),
							),
						9 =>
							array (
								'id' => '341100',
								'name' => '滁州市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '341102',
												'name' => '琅琊区',
											),
										1 =>
											array (
												'id' => '341103',
												'name' => '南谯区',
											),
										2 =>
											array (
												'id' => '341122',
												'name' => '来安县',
											),
										3 =>
											array (
												'id' => '341124',
												'name' => '全椒县',
											),
										4 =>
											array (
												'id' => '341125',
												'name' => '定远县',
											),
										5 =>
											array (
												'id' => '341126',
												'name' => '凤阳县',
											),
										6 =>
											array (
												'id' => '341181',
												'name' => '天长市',
											),
										7 =>
											array (
												'id' => '341182',
												'name' => '明光市',
											),
									),
							),
						10 =>
							array (
								'id' => '341200',
								'name' => '阜阳市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '341202',
												'name' => '颍州区',
											),
										1 =>
											array (
												'id' => '341203',
												'name' => '颍东区',
											),
										2 =>
											array (
												'id' => '341204',
												'name' => '颍泉区',
											),
										3 =>
											array (
												'id' => '341221',
												'name' => '临泉县',
											),
										4 =>
											array (
												'id' => '341222',
												'name' => '太和县',
											),
										5 =>
											array (
												'id' => '341225',
												'name' => '阜南县',
											),
										6 =>
											array (
												'id' => '341226',
												'name' => '颍上县',
											),
										7 =>
											array (
												'id' => '341282',
												'name' => '界首市',
											),
									),
							),
						11 =>
							array (
								'id' => '341300',
								'name' => '宿州市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '341302',
												'name' => '墉桥区',
											),
										1 =>
											array (
												'id' => '341321',
												'name' => '砀山县',
											),
										2 =>
											array (
												'id' => '341322',
												'name' => '萧　县',
											),
										3 =>
											array (
												'id' => '341323',
												'name' => '灵璧县',
											),
										4 =>
											array (
												'id' => '341324',
												'name' => '泗　县',
											),
									),
							),
						12 =>
							array (
								'id' => '341400',
								'name' => '巢湖市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '341402',
												'name' => '居巢区',
											),
										1 =>
											array (
												'id' => '341421',
												'name' => '庐江县',
											),
										2 =>
											array (
												'id' => '341422',
												'name' => '无为县',
											),
										3 =>
											array (
												'id' => '341423',
												'name' => '含山县',
											),
										4 =>
											array (
												'id' => '341424',
												'name' => '和　县',
											),
									),
							),
						13 =>
							array (
								'id' => '341500',
								'name' => '六安市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '341502',
												'name' => '金安区',
											),
										1 =>
											array (
												'id' => '341503',
												'name' => '裕安区',
											),
										2 =>
											array (
												'id' => '341521',
												'name' => '寿　县',
											),
										3 =>
											array (
												'id' => '341522',
												'name' => '霍邱县',
											),
										4 =>
											array (
												'id' => '341523',
												'name' => '舒城县',
											),
										5 =>
											array (
												'id' => '341524',
												'name' => '金寨县',
											),
										6 =>
											array (
												'id' => '341525',
												'name' => '霍山县',
											),
									),
							),
						14 =>
							array (
								'id' => '341600',
								'name' => '亳州市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '341602',
												'name' => '谯城区',
											),
										1 =>
											array (
												'id' => '341621',
												'name' => '涡阳县',
											),
										2 =>
											array (
												'id' => '341622',
												'name' => '蒙城县',
											),
										3 =>
											array (
												'id' => '341623',
												'name' => '利辛县',
											),
									),
							),
						15 =>
							array (
								'id' => '341700',
								'name' => '池州市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '341702',
												'name' => '贵池区',
											),
										1 =>
											array (
												'id' => '341721',
												'name' => '东至县',
											),
										2 =>
											array (
												'id' => '341722',
												'name' => '石台县',
											),
										3 =>
											array (
												'id' => '341723',
												'name' => '青阳县',
											),
									),
							),
						16 =>
							array (
								'id' => '341800',
								'name' => '宣城市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '341802',
												'name' => '宣州区',
											),
										1 =>
											array (
												'id' => '341821',
												'name' => '郎溪县',
											),
										2 =>
											array (
												'id' => '341822',
												'name' => '广德县',
											),
										3 =>
											array (
												'id' => '341823',
												'name' => '泾　县',
											),
										4 =>
											array (
												'id' => '341824',
												'name' => '绩溪县',
											),
										5 =>
											array (
												'id' => '341825',
												'name' => '旌德县',
											),
										6 =>
											array (
												'id' => '341881',
												'name' => '宁国市',
											),
									),
							),
					),
			),
		12 =>
			array (
				'id' => '350000',
				'name' => '福建省',
				'children' =>
					array (
						0 =>
							array (
								'id' => '350100',
								'name' => '福州市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '350102',
												'name' => '鼓楼区',
											),
										1 =>
											array (
												'id' => '350103',
												'name' => '台江区',
											),
										2 =>
											array (
												'id' => '350104',
												'name' => '仓山区',
											),
										3 =>
											array (
												'id' => '350105',
												'name' => '马尾区',
											),
										4 =>
											array (
												'id' => '350111',
												'name' => '晋安区',
											),
										5 =>
											array (
												'id' => '350121',
												'name' => '闽侯县',
											),
										6 =>
											array (
												'id' => '350122',
												'name' => '连江县',
											),
										7 =>
											array (
												'id' => '350123',
												'name' => '罗源县',
											),
										8 =>
											array (
												'id' => '350124',
												'name' => '闽清县',
											),
										9 =>
											array (
												'id' => '350125',
												'name' => '永泰县',
											),
										10 =>
											array (
												'id' => '350128',
												'name' => '平潭县',
											),
										11 =>
											array (
												'id' => '350181',
												'name' => '福清市',
											),
										12 =>
											array (
												'id' => '350182',
												'name' => '长乐市',
											),
									),
							),
						1 =>
							array (
								'id' => '350200',
								'name' => '厦门市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '350203',
												'name' => '思明区',
											),
										1 =>
											array (
												'id' => '350205',
												'name' => '海沧区',
											),
										2 =>
											array (
												'id' => '350206',
												'name' => '湖里区',
											),
										3 =>
											array (
												'id' => '350211',
												'name' => '集美区',
											),
										4 =>
											array (
												'id' => '350212',
												'name' => '同安区',
											),
										5 =>
											array (
												'id' => '350213',
												'name' => '翔安区',
											),
									),
							),
						2 =>
							array (
								'id' => '350300',
								'name' => '莆田市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '350302',
												'name' => '城厢区',
											),
										1 =>
											array (
												'id' => '350303',
												'name' => '涵江区',
											),
										2 =>
											array (
												'id' => '350304',
												'name' => '荔城区',
											),
										3 =>
											array (
												'id' => '350305',
												'name' => '秀屿区',
											),
										4 =>
											array (
												'id' => '350322',
												'name' => '仙游县',
											),
									),
							),
						3 =>
							array (
								'id' => '350400',
								'name' => '三明市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '350402',
												'name' => '梅列区',
											),
										1 =>
											array (
												'id' => '350403',
												'name' => '三元区',
											),
										2 =>
											array (
												'id' => '350421',
												'name' => '明溪县',
											),
										3 =>
											array (
												'id' => '350423',
												'name' => '清流县',
											),
										4 =>
											array (
												'id' => '350424',
												'name' => '宁化县',
											),
										5 =>
											array (
												'id' => '350425',
												'name' => '大田县',
											),
										6 =>
											array (
												'id' => '350426',
												'name' => '尤溪县',
											),
										7 =>
											array (
												'id' => '350427',
												'name' => '沙　县',
											),
										8 =>
											array (
												'id' => '350428',
												'name' => '将乐县',
											),
										9 =>
											array (
												'id' => '350429',
												'name' => '泰宁县',
											),
										10 =>
											array (
												'id' => '350430',
												'name' => '建宁县',
											),
										11 =>
											array (
												'id' => '350481',
												'name' => '永安市',
											),
									),
							),
						4 =>
							array (
								'id' => '350500',
								'name' => '泉州市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '350502',
												'name' => '鲤城区',
											),
										1 =>
											array (
												'id' => '350503',
												'name' => '丰泽区',
											),
										2 =>
											array (
												'id' => '350504',
												'name' => '洛江区',
											),
										3 =>
											array (
												'id' => '350505',
												'name' => '泉港区',
											),
										4 =>
											array (
												'id' => '350521',
												'name' => '惠安县',
											),
										5 =>
											array (
												'id' => '350524',
												'name' => '安溪县',
											),
										6 =>
											array (
												'id' => '350525',
												'name' => '永春县',
											),
										7 =>
											array (
												'id' => '350526',
												'name' => '德化县',
											),
										8 =>
											array (
												'id' => '350527',
												'name' => '金门县',
											),
										9 =>
											array (
												'id' => '350581',
												'name' => '石狮市',
											),
										10 =>
											array (
												'id' => '350582',
												'name' => '晋江市',
											),
										11 =>
											array (
												'id' => '350583',
												'name' => '南安市',
											),
									),
							),
						5 =>
							array (
								'id' => '350600',
								'name' => '漳州市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '350602',
												'name' => '芗城区',
											),
										1 =>
											array (
												'id' => '350603',
												'name' => '龙文区',
											),
										2 =>
											array (
												'id' => '350622',
												'name' => '云霄县',
											),
										3 =>
											array (
												'id' => '350623',
												'name' => '漳浦县',
											),
										4 =>
											array (
												'id' => '350624',
												'name' => '诏安县',
											),
										5 =>
											array (
												'id' => '350625',
												'name' => '长泰县',
											),
										6 =>
											array (
												'id' => '350626',
												'name' => '东山县',
											),
										7 =>
											array (
												'id' => '350627',
												'name' => '南靖县',
											),
										8 =>
											array (
												'id' => '350628',
												'name' => '平和县',
											),
										9 =>
											array (
												'id' => '350629',
												'name' => '华安县',
											),
										10 =>
											array (
												'id' => '350681',
												'name' => '龙海市',
											),
									),
							),
						6 =>
							array (
								'id' => '350700',
								'name' => '南平市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '350702',
												'name' => '延平区',
											),
										1 =>
											array (
												'id' => '350721',
												'name' => '顺昌县',
											),
										2 =>
											array (
												'id' => '350722',
												'name' => '浦城县',
											),
										3 =>
											array (
												'id' => '350723',
												'name' => '光泽县',
											),
										4 =>
											array (
												'id' => '350724',
												'name' => '松溪县',
											),
										5 =>
											array (
												'id' => '350725',
												'name' => '政和县',
											),
										6 =>
											array (
												'id' => '350781',
												'name' => '邵武市',
											),
										7 =>
											array (
												'id' => '350782',
												'name' => '武夷山市',
											),
										8 =>
											array (
												'id' => '350783',
												'name' => '建瓯市',
											),
										9 =>
											array (
												'id' => '350784',
												'name' => '建阳市',
											),
									),
							),
						7 =>
							array (
								'id' => '350800',
								'name' => '龙岩市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '350802',
												'name' => '新罗区',
											),
										1 =>
											array (
												'id' => '350821',
												'name' => '长汀县',
											),
										2 =>
											array (
												'id' => '350822',
												'name' => '永定县',
											),
										3 =>
											array (
												'id' => '350823',
												'name' => '上杭县',
											),
										4 =>
											array (
												'id' => '350824',
												'name' => '武平县',
											),
										5 =>
											array (
												'id' => '350825',
												'name' => '连城县',
											),
										6 =>
											array (
												'id' => '350881',
												'name' => '漳平市',
											),
									),
							),
						8 =>
							array (
								'id' => '350900',
								'name' => '宁德市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '350902',
												'name' => '蕉城区',
											),
										1 =>
											array (
												'id' => '350921',
												'name' => '霞浦县',
											),
										2 =>
											array (
												'id' => '350922',
												'name' => '古田县',
											),
										3 =>
											array (
												'id' => '350923',
												'name' => '屏南县',
											),
										4 =>
											array (
												'id' => '350924',
												'name' => '寿宁县',
											),
										5 =>
											array (
												'id' => '350925',
												'name' => '周宁县',
											),
										6 =>
											array (
												'id' => '350926',
												'name' => '柘荣县',
											),
										7 =>
											array (
												'id' => '350981',
												'name' => '福安市',
											),
										8 =>
											array (
												'id' => '350982',
												'name' => '福鼎市',
											),
									),
							),
					),
			),
		13 =>
			array (
				'id' => '360000',
				'name' => '江西省',
				'children' =>
					array (
						0 =>
							array (
								'id' => '360100',
								'name' => '南昌市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '360102',
												'name' => '东湖区',
											),
										1 =>
											array (
												'id' => '360103',
												'name' => '西湖区',
											),
										2 =>
											array (
												'id' => '360104',
												'name' => '青云谱区',
											),
										3 =>
											array (
												'id' => '360105',
												'name' => '湾里区',
											),
										4 =>
											array (
												'id' => '360111',
												'name' => '青山湖区',
											),
										5 =>
											array (
												'id' => '360121',
												'name' => '南昌县',
											),
										6 =>
											array (
												'id' => '360122',
												'name' => '新建县',
											),
										7 =>
											array (
												'id' => '360123',
												'name' => '安义县',
											),
										8 =>
											array (
												'id' => '360124',
												'name' => '进贤县',
											),
									),
							),
						1 =>
							array (
								'id' => '360200',
								'name' => '景德镇市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '360202',
												'name' => '昌江区',
											),
										1 =>
											array (
												'id' => '360203',
												'name' => '珠山区',
											),
										2 =>
											array (
												'id' => '360222',
												'name' => '浮梁县',
											),
										3 =>
											array (
												'id' => '360281',
												'name' => '乐平市',
											),
									),
							),
						2 =>
							array (
								'id' => '360300',
								'name' => '萍乡市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '360302',
												'name' => '安源区',
											),
										1 =>
											array (
												'id' => '360313',
												'name' => '湘东区',
											),
										2 =>
											array (
												'id' => '360321',
												'name' => '莲花县',
											),
										3 =>
											array (
												'id' => '360322',
												'name' => '上栗县',
											),
										4 =>
											array (
												'id' => '360323',
												'name' => '芦溪县',
											),
									),
							),
						3 =>
							array (
								'id' => '360400',
								'name' => '九江市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '360402',
												'name' => '庐山区',
											),
										1 =>
											array (
												'id' => '360403',
												'name' => '浔阳区',
											),
										2 =>
											array (
												'id' => '360421',
												'name' => '九江县',
											),
										3 =>
											array (
												'id' => '360423',
												'name' => '武宁县',
											),
										4 =>
											array (
												'id' => '360424',
												'name' => '修水县',
											),
										5 =>
											array (
												'id' => '360425',
												'name' => '永修县',
											),
										6 =>
											array (
												'id' => '360426',
												'name' => '德安县',
											),
										7 =>
											array (
												'id' => '360427',
												'name' => '星子县',
											),
										8 =>
											array (
												'id' => '360428',
												'name' => '都昌县',
											),
										9 =>
											array (
												'id' => '360429',
												'name' => '湖口县',
											),
										10 =>
											array (
												'id' => '360430',
												'name' => '彭泽县',
											),
										11 =>
											array (
												'id' => '360481',
												'name' => '瑞昌市',
											),
									),
							),
						4 =>
							array (
								'id' => '360500',
								'name' => '新余市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '360502',
												'name' => '渝水区',
											),
										1 =>
											array (
												'id' => '360521',
												'name' => '分宜县',
											),
									),
							),
						5 =>
							array (
								'id' => '360600',
								'name' => '鹰潭市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '360602',
												'name' => '月湖区',
											),
										1 =>
											array (
												'id' => '360622',
												'name' => '余江县',
											),
										2 =>
											array (
												'id' => '360681',
												'name' => '贵溪市',
											),
									),
							),
						6 =>
							array (
								'id' => '360700',
								'name' => '赣州市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '360702',
												'name' => '章贡区',
											),
										1 =>
											array (
												'id' => '360721',
												'name' => '赣　县',
											),
										2 =>
											array (
												'id' => '360722',
												'name' => '信丰县',
											),
										3 =>
											array (
												'id' => '360723',
												'name' => '大余县',
											),
										4 =>
											array (
												'id' => '360724',
												'name' => '上犹县',
											),
										5 =>
											array (
												'id' => '360725',
												'name' => '崇义县',
											),
										6 =>
											array (
												'id' => '360726',
												'name' => '安远县',
											),
										7 =>
											array (
												'id' => '360727',
												'name' => '龙南县',
											),
										8 =>
											array (
												'id' => '360728',
												'name' => '定南县',
											),
										9 =>
											array (
												'id' => '360729',
												'name' => '全南县',
											),
										10 =>
											array (
												'id' => '360730',
												'name' => '宁都县',
											),
										11 =>
											array (
												'id' => '360731',
												'name' => '于都县',
											),
										12 =>
											array (
												'id' => '360732',
												'name' => '兴国县',
											),
										13 =>
											array (
												'id' => '360733',
												'name' => '会昌县',
											),
										14 =>
											array (
												'id' => '360734',
												'name' => '寻乌县',
											),
										15 =>
											array (
												'id' => '360735',
												'name' => '石城县',
											),
										16 =>
											array (
												'id' => '360781',
												'name' => '瑞金市',
											),
										17 =>
											array (
												'id' => '360782',
												'name' => '南康市',
											),
									),
							),
						7 =>
							array (
								'id' => '360800',
								'name' => '吉安市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '360802',
												'name' => '吉州区',
											),
										1 =>
											array (
												'id' => '360803',
												'name' => '青原区',
											),
										2 =>
											array (
												'id' => '360821',
												'name' => '吉安县',
											),
										3 =>
											array (
												'id' => '360822',
												'name' => '吉水县',
											),
										4 =>
											array (
												'id' => '360823',
												'name' => '峡江县',
											),
										5 =>
											array (
												'id' => '360824',
												'name' => '新干县',
											),
										6 =>
											array (
												'id' => '360825',
												'name' => '永丰县',
											),
										7 =>
											array (
												'id' => '360826',
												'name' => '泰和县',
											),
										8 =>
											array (
												'id' => '360827',
												'name' => '遂川县',
											),
										9 =>
											array (
												'id' => '360828',
												'name' => '万安县',
											),
										10 =>
											array (
												'id' => '360829',
												'name' => '安福县',
											),
										11 =>
											array (
												'id' => '360830',
												'name' => '永新县',
											),
										12 =>
											array (
												'id' => '360881',
												'name' => '井冈山市',
											),
									),
							),
						8 =>
							array (
								'id' => '360900',
								'name' => '宜春市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '360902',
												'name' => '袁州区',
											),
										1 =>
											array (
												'id' => '360921',
												'name' => '奉新县',
											),
										2 =>
											array (
												'id' => '360922',
												'name' => '万载县',
											),
										3 =>
											array (
												'id' => '360923',
												'name' => '上高县',
											),
										4 =>
											array (
												'id' => '360924',
												'name' => '宜丰县',
											),
										5 =>
											array (
												'id' => '360925',
												'name' => '靖安县',
											),
										6 =>
											array (
												'id' => '360926',
												'name' => '铜鼓县',
											),
										7 =>
											array (
												'id' => '360981',
												'name' => '丰城市',
											),
										8 =>
											array (
												'id' => '360982',
												'name' => '樟树市',
											),
										9 =>
											array (
												'id' => '360983',
												'name' => '高安市',
											),
									),
							),
						9 =>
							array (
								'id' => '361000',
								'name' => '抚州市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '361002',
												'name' => '临川区',
											),
										1 =>
											array (
												'id' => '361021',
												'name' => '南城县',
											),
										2 =>
											array (
												'id' => '361022',
												'name' => '黎川县',
											),
										3 =>
											array (
												'id' => '361023',
												'name' => '南丰县',
											),
										4 =>
											array (
												'id' => '361024',
												'name' => '崇仁县',
											),
										5 =>
											array (
												'id' => '361025',
												'name' => '乐安县',
											),
										6 =>
											array (
												'id' => '361026',
												'name' => '宜黄县',
											),
										7 =>
											array (
												'id' => '361027',
												'name' => '金溪县',
											),
										8 =>
											array (
												'id' => '361028',
												'name' => '资溪县',
											),
										9 =>
											array (
												'id' => '361029',
												'name' => '东乡县',
											),
										10 =>
											array (
												'id' => '361030',
												'name' => '广昌县',
											),
									),
							),
						10 =>
							array (
								'id' => '361100',
								'name' => '上饶市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '361102',
												'name' => '信州区',
											),
										1 =>
											array (
												'id' => '361121',
												'name' => '上饶县',
											),
										2 =>
											array (
												'id' => '361122',
												'name' => '广丰县',
											),
										3 =>
											array (
												'id' => '361123',
												'name' => '玉山县',
											),
										4 =>
											array (
												'id' => '361124',
												'name' => '铅山县',
											),
										5 =>
											array (
												'id' => '361125',
												'name' => '横峰县',
											),
										6 =>
											array (
												'id' => '361126',
												'name' => '弋阳县',
											),
										7 =>
											array (
												'id' => '361127',
												'name' => '余干县',
											),
										8 =>
											array (
												'id' => '361128',
												'name' => '鄱阳县',
											),
										9 =>
											array (
												'id' => '361129',
												'name' => '万年县',
											),
										10 =>
											array (
												'id' => '361130',
												'name' => '婺源县',
											),
										11 =>
											array (
												'id' => '361181',
												'name' => '德兴市',
											),
									),
							),
					),
			),
		14 =>
			array (
				'id' => '370000',
				'name' => '山东省',
				'children' =>
					array (
						0 =>
							array (
								'id' => '370100',
								'name' => '济南市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '370102',
												'name' => '历下区',
											),
										1 =>
											array (
												'id' => '370103',
												'name' => '市中区',
											),
										2 =>
											array (
												'id' => '370104',
												'name' => '槐荫区',
											),
										3 =>
											array (
												'id' => '370105',
												'name' => '天桥区',
											),
										4 =>
											array (
												'id' => '370112',
												'name' => '历城区',
											),
										5 =>
											array (
												'id' => '370113',
												'name' => '长清区',
											),
										6 =>
											array (
												'id' => '370124',
												'name' => '平阴县',
											),
										7 =>
											array (
												'id' => '370125',
												'name' => '济阳县',
											),
										8 =>
											array (
												'id' => '370126',
												'name' => '商河县',
											),
										9 =>
											array (
												'id' => '370181',
												'name' => '章丘市',
											),
									),
							),
						1 =>
							array (
								'id' => '370200',
								'name' => '青岛市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '370202',
												'name' => '市南区',
											),
										1 =>
											array (
												'id' => '370203',
												'name' => '市北区',
											),
										2 =>
											array (
												'id' => '370205',
												'name' => '四方区',
											),
										3 =>
											array (
												'id' => '370211',
												'name' => '黄岛区',
											),
										4 =>
											array (
												'id' => '370212',
												'name' => '崂山区',
											),
										5 =>
											array (
												'id' => '370213',
												'name' => '李沧区',
											),
										6 =>
											array (
												'id' => '370214',
												'name' => '城阳区',
											),
										7 =>
											array (
												'id' => '370281',
												'name' => '胶州市',
											),
										8 =>
											array (
												'id' => '370282',
												'name' => '即墨市',
											),
										9 =>
											array (
												'id' => '370283',
												'name' => '平度市',
											),
										10 =>
											array (
												'id' => '370284',
												'name' => '胶南市',
											),
										11 =>
											array (
												'id' => '370285',
												'name' => '莱西市',
											),
									),
							),
						2 =>
							array (
								'id' => '370300',
								'name' => '淄博市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '370302',
												'name' => '淄川区',
											),
										1 =>
											array (
												'id' => '370303',
												'name' => '张店区',
											),
										2 =>
											array (
												'id' => '370304',
												'name' => '博山区',
											),
										3 =>
											array (
												'id' => '370305',
												'name' => '临淄区',
											),
										4 =>
											array (
												'id' => '370306',
												'name' => '周村区',
											),
										5 =>
											array (
												'id' => '370321',
												'name' => '桓台县',
											),
										6 =>
											array (
												'id' => '370322',
												'name' => '高青县',
											),
										7 =>
											array (
												'id' => '370323',
												'name' => '沂源县',
											),
									),
							),
						3 =>
							array (
								'id' => '370400',
								'name' => '枣庄市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '370402',
												'name' => '市中区',
											),
										1 =>
											array (
												'id' => '370403',
												'name' => '薛城区',
											),
										2 =>
											array (
												'id' => '370404',
												'name' => '峄城区',
											),
										3 =>
											array (
												'id' => '370405',
												'name' => '台儿庄区',
											),
										4 =>
											array (
												'id' => '370406',
												'name' => '山亭区',
											),
										5 =>
											array (
												'id' => '370481',
												'name' => '滕州市',
											),
									),
							),
						4 =>
							array (
								'id' => '370500',
								'name' => '东营市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '370502',
												'name' => '东营区',
											),
										1 =>
											array (
												'id' => '370503',
												'name' => '河口区',
											),
										2 =>
											array (
												'id' => '370521',
												'name' => '垦利县',
											),
										3 =>
											array (
												'id' => '370522',
												'name' => '利津县',
											),
										4 =>
											array (
												'id' => '370523',
												'name' => '广饶县',
											),
									),
							),
						5 =>
							array (
								'id' => '370600',
								'name' => '烟台市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '370602',
												'name' => '芝罘区',
											),
										1 =>
											array (
												'id' => '370611',
												'name' => '福山区',
											),
										2 =>
											array (
												'id' => '370612',
												'name' => '牟平区',
											),
										3 =>
											array (
												'id' => '370613',
												'name' => '莱山区',
											),
										4 =>
											array (
												'id' => '370634',
												'name' => '长岛县',
											),
										5 =>
											array (
												'id' => '370681',
												'name' => '龙口市',
											),
										6 =>
											array (
												'id' => '370682',
												'name' => '莱阳市',
											),
										7 =>
											array (
												'id' => '370683',
												'name' => '莱州市',
											),
										8 =>
											array (
												'id' => '370684',
												'name' => '蓬莱市',
											),
										9 =>
											array (
												'id' => '370685',
												'name' => '招远市',
											),
										10 =>
											array (
												'id' => '370686',
												'name' => '栖霞市',
											),
										11 =>
											array (
												'id' => '370687',
												'name' => '海阳市',
											),
									),
							),
						6 =>
							array (
								'id' => '370700',
								'name' => '潍坊市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '370702',
												'name' => '潍城区',
											),
										1 =>
											array (
												'id' => '370703',
												'name' => '寒亭区',
											),
										2 =>
											array (
												'id' => '370704',
												'name' => '坊子区',
											),
										3 =>
											array (
												'id' => '370705',
												'name' => '奎文区',
											),
										4 =>
											array (
												'id' => '370724',
												'name' => '临朐县',
											),
										5 =>
											array (
												'id' => '370725',
												'name' => '昌乐县',
											),
										6 =>
											array (
												'id' => '370781',
												'name' => '青州市',
											),
										7 =>
											array (
												'id' => '370782',
												'name' => '诸城市',
											),
										8 =>
											array (
												'id' => '370783',
												'name' => '寿光市',
											),
										9 =>
											array (
												'id' => '370784',
												'name' => '安丘市',
											),
										10 =>
											array (
												'id' => '370785',
												'name' => '高密市',
											),
										11 =>
											array (
												'id' => '370786',
												'name' => '昌邑市',
											),
									),
							),
						7 =>
							array (
								'id' => '370800',
								'name' => '济宁市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '370802',
												'name' => '市中区',
											),
										1 =>
											array (
												'id' => '370811',
												'name' => '任城区',
											),
										2 =>
											array (
												'id' => '370826',
												'name' => '微山县',
											),
										3 =>
											array (
												'id' => '370827',
												'name' => '鱼台县',
											),
										4 =>
											array (
												'id' => '370828',
												'name' => '金乡县',
											),
										5 =>
											array (
												'id' => '370829',
												'name' => '嘉祥县',
											),
										6 =>
											array (
												'id' => '370830',
												'name' => '汶上县',
											),
										7 =>
											array (
												'id' => '370831',
												'name' => '泗水县',
											),
										8 =>
											array (
												'id' => '370832',
												'name' => '梁山县',
											),
										9 =>
											array (
												'id' => '370881',
												'name' => '曲阜市',
											),
										10 =>
											array (
												'id' => '370882',
												'name' => '兖州市',
											),
										11 =>
											array (
												'id' => '370883',
												'name' => '邹城市',
											),
									),
							),
						8 =>
							array (
								'id' => '370900',
								'name' => '泰安市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '370902',
												'name' => '泰山区',
											),
										1 =>
											array (
												'id' => '370903',
												'name' => '岱岳区',
											),
										2 =>
											array (
												'id' => '370921',
												'name' => '宁阳县',
											),
										3 =>
											array (
												'id' => '370923',
												'name' => '东平县',
											),
										4 =>
											array (
												'id' => '370982',
												'name' => '新泰市',
											),
										5 =>
											array (
												'id' => '370983',
												'name' => '肥城市',
											),
									),
							),
						9 =>
							array (
								'id' => '371000',
								'name' => '威海市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '371002',
												'name' => '环翠区',
											),
										1 =>
											array (
												'id' => '371081',
												'name' => '文登市',
											),
										2 =>
											array (
												'id' => '371082',
												'name' => '荣成市',
											),
										3 =>
											array (
												'id' => '371083',
												'name' => '乳山市',
											),
									),
							),
						10 =>
							array (
								'id' => '371100',
								'name' => '日照市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '371102',
												'name' => '东港区',
											),
										1 =>
											array (
												'id' => '371103',
												'name' => '岚山区',
											),
										2 =>
											array (
												'id' => '371121',
												'name' => '五莲县',
											),
										3 =>
											array (
												'id' => '371122',
												'name' => '莒　县',
											),
									),
							),
						11 =>
							array (
								'id' => '371200',
								'name' => '莱芜市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '371202',
												'name' => '莱城区',
											),
										1 =>
											array (
												'id' => '371203',
												'name' => '钢城区',
											),
									),
							),
						12 =>
							array (
								'id' => '371300',
								'name' => '临沂市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '371302',
												'name' => '兰山区',
											),
										1 =>
											array (
												'id' => '371311',
												'name' => '罗庄区',
											),
										2 =>
											array (
												'id' => '371312',
												'name' => '河东区',
											),
										3 =>
											array (
												'id' => '371321',
												'name' => '沂南县',
											),
										4 =>
											array (
												'id' => '371322',
												'name' => '郯城县',
											),
										5 =>
											array (
												'id' => '371323',
												'name' => '沂水县',
											),
										6 =>
											array (
												'id' => '371324',
												'name' => '苍山县',
											),
										7 =>
											array (
												'id' => '371325',
												'name' => '费　县',
											),
										8 =>
											array (
												'id' => '371326',
												'name' => '平邑县',
											),
										9 =>
											array (
												'id' => '371327',
												'name' => '莒南县',
											),
										10 =>
											array (
												'id' => '371328',
												'name' => '蒙阴县',
											),
										11 =>
											array (
												'id' => '371329',
												'name' => '临沭县',
											),
									),
							),
						13 =>
							array (
								'id' => '371400',
								'name' => '德州市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '371402',
												'name' => '德城区',
											),
										1 =>
											array (
												'id' => '371421',
												'name' => '陵　县',
											),
										2 =>
											array (
												'id' => '371422',
												'name' => '宁津县',
											),
										3 =>
											array (
												'id' => '371423',
												'name' => '庆云县',
											),
										4 =>
											array (
												'id' => '371424',
												'name' => '临邑县',
											),
										5 =>
											array (
												'id' => '371425',
												'name' => '齐河县',
											),
										6 =>
											array (
												'id' => '371426',
												'name' => '平原县',
											),
										7 =>
											array (
												'id' => '371427',
												'name' => '夏津县',
											),
										8 =>
											array (
												'id' => '371428',
												'name' => '武城县',
											),
										9 =>
											array (
												'id' => '371481',
												'name' => '乐陵市',
											),
										10 =>
											array (
												'id' => '371482',
												'name' => '禹城市',
											),
									),
							),
						14 =>
							array (
								'id' => '371500',
								'name' => '聊城市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '371502',
												'name' => '东昌府区',
											),
										1 =>
											array (
												'id' => '371521',
												'name' => '阳谷县',
											),
										2 =>
											array (
												'id' => '371522',
												'name' => '莘　县',
											),
										3 =>
											array (
												'id' => '371523',
												'name' => '茌平县',
											),
										4 =>
											array (
												'id' => '371524',
												'name' => '东阿县',
											),
										5 =>
											array (
												'id' => '371525',
												'name' => '冠　县',
											),
										6 =>
											array (
												'id' => '371526',
												'name' => '高唐县',
											),
										7 =>
											array (
												'id' => '371581',
												'name' => '临清市',
											),
									),
							),
						15 =>
							array (
								'id' => '371600',
								'name' => '滨州市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '371602',
												'name' => '滨城区',
											),
										1 =>
											array (
												'id' => '371621',
												'name' => '惠民县',
											),
										2 =>
											array (
												'id' => '371622',
												'name' => '阳信县',
											),
										3 =>
											array (
												'id' => '371623',
												'name' => '无棣县',
											),
										4 =>
											array (
												'id' => '371624',
												'name' => '沾化县',
											),
										5 =>
											array (
												'id' => '371625',
												'name' => '博兴县',
											),
										6 =>
											array (
												'id' => '371626',
												'name' => '邹平县',
											),
									),
							),
						16 =>
							array (
								'id' => '371700',
								'name' => '荷泽市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '371702',
												'name' => '牡丹区',
											),
										1 =>
											array (
												'id' => '371721',
												'name' => '曹　县',
											),
										2 =>
											array (
												'id' => '371722',
												'name' => '单　县',
											),
										3 =>
											array (
												'id' => '371723',
												'name' => '成武县',
											),
										4 =>
											array (
												'id' => '371724',
												'name' => '巨野县',
											),
										5 =>
											array (
												'id' => '371725',
												'name' => '郓城县',
											),
										6 =>
											array (
												'id' => '371726',
												'name' => '鄄城县',
											),
										7 =>
											array (
												'id' => '371727',
												'name' => '定陶县',
											),
										8 =>
											array (
												'id' => '371728',
												'name' => '东明县',
											),
									),
							),
					),
			),
		15 =>
			array (
				'id' => '410000',
				'name' => '河南省',
				'children' =>
					array (
						0 =>
							array (
								'id' => '410100',
								'name' => '郑州市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '410102',
												'name' => '中原区',
											),
										1 =>
											array (
												'id' => '410103',
												'name' => '二七区',
											),
										2 =>
											array (
												'id' => '410104',
												'name' => '管城回族区',
											),
										3 =>
											array (
												'id' => '410105',
												'name' => '金水区',
											),
										4 =>
											array (
												'id' => '410106',
												'name' => '上街区',
											),
										5 =>
											array (
												'id' => '410108',
												'name' => '邙山区',
											),
										6 =>
											array (
												'id' => '410122',
												'name' => '中牟县',
											),
										7 =>
											array (
												'id' => '410181',
												'name' => '巩义市',
											),
										8 =>
											array (
												'id' => '410182',
												'name' => '荥阳市',
											),
										9 =>
											array (
												'id' => '410183',
												'name' => '新密市',
											),
										10 =>
											array (
												'id' => '410184',
												'name' => '新郑市',
											),
										11 =>
											array (
												'id' => '410185',
												'name' => '登封市',
											),
									),
							),
						1 =>
							array (
								'id' => '410200',
								'name' => '开封市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '410202',
												'name' => '龙亭区',
											),
										1 =>
											array (
												'id' => '410203',
												'name' => '顺河回族区',
											),
										2 =>
											array (
												'id' => '410204',
												'name' => '鼓楼区',
											),
										3 =>
											array (
												'id' => '410205',
												'name' => '南关区',
											),
										4 =>
											array (
												'id' => '410211',
												'name' => '郊　区',
											),
										5 =>
											array (
												'id' => '410221',
												'name' => '杞　县',
											),
										6 =>
											array (
												'id' => '410222',
												'name' => '通许县',
											),
										7 =>
											array (
												'id' => '410223',
												'name' => '尉氏县',
											),
										8 =>
											array (
												'id' => '410224',
												'name' => '开封县',
											),
										9 =>
											array (
												'id' => '410225',
												'name' => '兰考县',
											),
									),
							),
						2 =>
							array (
								'id' => '410300',
								'name' => '洛阳市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '410302',
												'name' => '老城区',
											),
										1 =>
											array (
												'id' => '410303',
												'name' => '西工区',
											),
										2 =>
											array (
												'id' => '410304',
												'name' => '廛河回族区',
											),
										3 =>
											array (
												'id' => '410305',
												'name' => '涧西区',
											),
										4 =>
											array (
												'id' => '410306',
												'name' => '吉利区',
											),
										5 =>
											array (
												'id' => '410307',
												'name' => '洛龙区',
											),
										6 =>
											array (
												'id' => '410322',
												'name' => '孟津县',
											),
										7 =>
											array (
												'id' => '410323',
												'name' => '新安县',
											),
										8 =>
											array (
												'id' => '410324',
												'name' => '栾川县',
											),
										9 =>
											array (
												'id' => '410325',
												'name' => '嵩　县',
											),
										10 =>
											array (
												'id' => '410326',
												'name' => '汝阳县',
											),
										11 =>
											array (
												'id' => '410327',
												'name' => '宜阳县',
											),
										12 =>
											array (
												'id' => '410328',
												'name' => '洛宁县',
											),
										13 =>
											array (
												'id' => '410329',
												'name' => '伊川县',
											),
										14 =>
											array (
												'id' => '410381',
												'name' => '偃师市',
											),
									),
							),
						3 =>
							array (
								'id' => '410400',
								'name' => '平顶山市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '410402',
												'name' => '新华区',
											),
										1 =>
											array (
												'id' => '410403',
												'name' => '卫东区',
											),
										2 =>
											array (
												'id' => '410404',
												'name' => '石龙区',
											),
										3 =>
											array (
												'id' => '410411',
												'name' => '湛河区',
											),
										4 =>
											array (
												'id' => '410421',
												'name' => '宝丰县',
											),
										5 =>
											array (
												'id' => '410422',
												'name' => '叶　县',
											),
										6 =>
											array (
												'id' => '410423',
												'name' => '鲁山县',
											),
										7 =>
											array (
												'id' => '410425',
												'name' => '郏　县',
											),
										8 =>
											array (
												'id' => '410481',
												'name' => '舞钢市',
											),
										9 =>
											array (
												'id' => '410482',
												'name' => '汝州市',
											),
									),
							),
						4 =>
							array (
								'id' => '410500',
								'name' => '安阳市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '410502',
												'name' => '文峰区',
											),
										1 =>
											array (
												'id' => '410503',
												'name' => '北关区',
											),
										2 =>
											array (
												'id' => '410505',
												'name' => '殷都区',
											),
										3 =>
											array (
												'id' => '410506',
												'name' => '龙安区',
											),
										4 =>
											array (
												'id' => '410522',
												'name' => '安阳县',
											),
										5 =>
											array (
												'id' => '410523',
												'name' => '汤阴县',
											),
										6 =>
											array (
												'id' => '410526',
												'name' => '滑　县',
											),
										7 =>
											array (
												'id' => '410527',
												'name' => '内黄县',
											),
										8 =>
											array (
												'id' => '410581',
												'name' => '林州市',
											),
									),
							),
						5 =>
							array (
								'id' => '410600',
								'name' => '鹤壁市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '410602',
												'name' => '鹤山区',
											),
										1 =>
											array (
												'id' => '410603',
												'name' => '山城区',
											),
										2 =>
											array (
												'id' => '410611',
												'name' => '淇滨区',
											),
										3 =>
											array (
												'id' => '410621',
												'name' => '浚　县',
											),
										4 =>
											array (
												'id' => '410622',
												'name' => '淇　县',
											),
									),
							),
						6 =>
							array (
								'id' => '410700',
								'name' => '新乡市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '410702',
												'name' => '红旗区',
											),
										1 =>
											array (
												'id' => '410703',
												'name' => '卫滨区',
											),
										2 =>
											array (
												'id' => '410704',
												'name' => '凤泉区',
											),
										3 =>
											array (
												'id' => '410711',
												'name' => '牧野区',
											),
										4 =>
											array (
												'id' => '410721',
												'name' => '新乡县',
											),
										5 =>
											array (
												'id' => '410724',
												'name' => '获嘉县',
											),
										6 =>
											array (
												'id' => '410725',
												'name' => '原阳县',
											),
										7 =>
											array (
												'id' => '410726',
												'name' => '延津县',
											),
										8 =>
											array (
												'id' => '410727',
												'name' => '封丘县',
											),
										9 =>
											array (
												'id' => '410728',
												'name' => '长垣县',
											),
										10 =>
											array (
												'id' => '410781',
												'name' => '卫辉市',
											),
										11 =>
											array (
												'id' => '410782',
												'name' => '辉县市',
											),
									),
							),
						7 =>
							array (
								'id' => '410800',
								'name' => '焦作市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '410802',
												'name' => '解放区',
											),
										1 =>
											array (
												'id' => '410803',
												'name' => '中站区',
											),
										2 =>
											array (
												'id' => '410804',
												'name' => '马村区',
											),
										3 =>
											array (
												'id' => '410811',
												'name' => '山阳区',
											),
										4 =>
											array (
												'id' => '410821',
												'name' => '修武县',
											),
										5 =>
											array (
												'id' => '410822',
												'name' => '博爱县',
											),
										6 =>
											array (
												'id' => '410823',
												'name' => '武陟县',
											),
										7 =>
											array (
												'id' => '410825',
												'name' => '温　县',
											),
										8 =>
											array (
												'id' => '410881',
												'name' => '济源市',
											),
										9 =>
											array (
												'id' => '410882',
												'name' => '沁阳市',
											),
										10 =>
											array (
												'id' => '410883',
												'name' => '孟州市',
											),
									),
							),
						8 =>
							array (
								'id' => '410900',
								'name' => '濮阳市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '410902',
												'name' => '华龙区',
											),
										1 =>
											array (
												'id' => '410922',
												'name' => '清丰县',
											),
										2 =>
											array (
												'id' => '410923',
												'name' => '南乐县',
											),
										3 =>
											array (
												'id' => '410926',
												'name' => '范　县',
											),
										4 =>
											array (
												'id' => '410927',
												'name' => '台前县',
											),
										5 =>
											array (
												'id' => '410928',
												'name' => '濮阳县',
											),
									),
							),
						9 =>
							array (
								'id' => '411000',
								'name' => '许昌市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '411002',
												'name' => '魏都区',
											),
										1 =>
											array (
												'id' => '411023',
												'name' => '许昌县',
											),
										2 =>
											array (
												'id' => '411024',
												'name' => '鄢陵县',
											),
										3 =>
											array (
												'id' => '411025',
												'name' => '襄城县',
											),
										4 =>
											array (
												'id' => '411081',
												'name' => '禹州市',
											),
										5 =>
											array (
												'id' => '411082',
												'name' => '长葛市',
											),
									),
							),
						10 =>
							array (
								'id' => '411100',
								'name' => '漯河市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '411102',
												'name' => '源汇区',
											),
										1 =>
											array (
												'id' => '411103',
												'name' => '郾城区',
											),
										2 =>
											array (
												'id' => '411104',
												'name' => '召陵区',
											),
										3 =>
											array (
												'id' => '411121',
												'name' => '舞阳县',
											),
										4 =>
											array (
												'id' => '411122',
												'name' => '临颍县',
											),
									),
							),
						11 =>
							array (
								'id' => '411200',
								'name' => '三门峡市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '411202',
												'name' => '湖滨区',
											),
										1 =>
											array (
												'id' => '411221',
												'name' => '渑池县',
											),
										2 =>
											array (
												'id' => '411222',
												'name' => '陕　县',
											),
										3 =>
											array (
												'id' => '411224',
												'name' => '卢氏县',
											),
										4 =>
											array (
												'id' => '411281',
												'name' => '义马市',
											),
										5 =>
											array (
												'id' => '411282',
												'name' => '灵宝市',
											),
									),
							),
						12 =>
							array (
								'id' => '411300',
								'name' => '南阳市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '411302',
												'name' => '宛城区',
											),
										1 =>
											array (
												'id' => '411303',
												'name' => '卧龙区',
											),
										2 =>
											array (
												'id' => '411321',
												'name' => '南召县',
											),
										3 =>
											array (
												'id' => '411322',
												'name' => '方城县',
											),
										4 =>
											array (
												'id' => '411323',
												'name' => '西峡县',
											),
										5 =>
											array (
												'id' => '411324',
												'name' => '镇平县',
											),
										6 =>
											array (
												'id' => '411325',
												'name' => '内乡县',
											),
										7 =>
											array (
												'id' => '411326',
												'name' => '淅川县',
											),
										8 =>
											array (
												'id' => '411327',
												'name' => '社旗县',
											),
										9 =>
											array (
												'id' => '411328',
												'name' => '唐河县',
											),
										10 =>
											array (
												'id' => '411329',
												'name' => '新野县',
											),
										11 =>
											array (
												'id' => '411330',
												'name' => '桐柏县',
											),
										12 =>
											array (
												'id' => '411381',
												'name' => '邓州市',
											),
									),
							),
						13 =>
							array (
								'id' => '411400',
								'name' => '商丘市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '411402',
												'name' => '梁园区',
											),
										1 =>
											array (
												'id' => '411403',
												'name' => '睢阳区',
											),
										2 =>
											array (
												'id' => '411421',
												'name' => '民权县',
											),
										3 =>
											array (
												'id' => '411422',
												'name' => '睢　县',
											),
										4 =>
											array (
												'id' => '411423',
												'name' => '宁陵县',
											),
										5 =>
											array (
												'id' => '411424',
												'name' => '柘城县',
											),
										6 =>
											array (
												'id' => '411425',
												'name' => '虞城县',
											),
										7 =>
											array (
												'id' => '411426',
												'name' => '夏邑县',
											),
										8 =>
											array (
												'id' => '411481',
												'name' => '永城市',
											),
									),
							),
						14 =>
							array (
								'id' => '411500',
								'name' => '信阳市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '411502',
												'name' => '师河区',
											),
										1 =>
											array (
												'id' => '411503',
												'name' => '平桥区',
											),
										2 =>
											array (
												'id' => '411521',
												'name' => '罗山县',
											),
										3 =>
											array (
												'id' => '411522',
												'name' => '光山县',
											),
										4 =>
											array (
												'id' => '411523',
												'name' => '新　县',
											),
										5 =>
											array (
												'id' => '411524',
												'name' => '商城县',
											),
										6 =>
											array (
												'id' => '411525',
												'name' => '固始县',
											),
										7 =>
											array (
												'id' => '411526',
												'name' => '潢川县',
											),
										8 =>
											array (
												'id' => '411527',
												'name' => '淮滨县',
											),
										9 =>
											array (
												'id' => '411528',
												'name' => '息　县',
											),
									),
							),
						15 =>
							array (
								'id' => '411600',
								'name' => '周口市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '411602',
												'name' => '川汇区',
											),
										1 =>
											array (
												'id' => '411621',
												'name' => '扶沟县',
											),
										2 =>
											array (
												'id' => '411622',
												'name' => '西华县',
											),
										3 =>
											array (
												'id' => '411623',
												'name' => '商水县',
											),
										4 =>
											array (
												'id' => '411624',
												'name' => '沈丘县',
											),
										5 =>
											array (
												'id' => '411625',
												'name' => '郸城县',
											),
										6 =>
											array (
												'id' => '411626',
												'name' => '淮阳县',
											),
										7 =>
											array (
												'id' => '411627',
												'name' => '太康县',
											),
										8 =>
											array (
												'id' => '411628',
												'name' => '鹿邑县',
											),
										9 =>
											array (
												'id' => '411681',
												'name' => '项城市',
											),
									),
							),
						16 =>
							array (
								'id' => '411700',
								'name' => '驻马店市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '411702',
												'name' => '驿城区',
											),
										1 =>
											array (
												'id' => '411721',
												'name' => '西平县',
											),
										2 =>
											array (
												'id' => '411722',
												'name' => '上蔡县',
											),
										3 =>
											array (
												'id' => '411723',
												'name' => '平舆县',
											),
										4 =>
											array (
												'id' => '411724',
												'name' => '正阳县',
											),
										5 =>
											array (
												'id' => '411725',
												'name' => '确山县',
											),
										6 =>
											array (
												'id' => '411726',
												'name' => '泌阳县',
											),
										7 =>
											array (
												'id' => '411727',
												'name' => '汝南县',
											),
										8 =>
											array (
												'id' => '411728',
												'name' => '遂平县',
											),
										9 =>
											array (
												'id' => '411729',
												'name' => '新蔡县',
											),
									),
							),
					),
			),
		16 =>
			array (
				'id' => '420000',
				'name' => '湖北省',
				'children' =>
					array (
						0 =>
							array (
								'id' => '420100',
								'name' => '武汉市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '420102',
												'name' => '江岸区',
											),
										1 =>
											array (
												'id' => '420103',
												'name' => '江汉区',
											),
										2 =>
											array (
												'id' => '420104',
												'name' => '乔口区',
											),
										3 =>
											array (
												'id' => '420105',
												'name' => '汉阳区',
											),
										4 =>
											array (
												'id' => '420106',
												'name' => '武昌区',
											),
										5 =>
											array (
												'id' => '420107',
												'name' => '青山区',
											),
										6 =>
											array (
												'id' => '420111',
												'name' => '洪山区',
											),
										7 =>
											array (
												'id' => '420112',
												'name' => '东西湖区',
											),
										8 =>
											array (
												'id' => '420113',
												'name' => '汉南区',
											),
										9 =>
											array (
												'id' => '420114',
												'name' => '蔡甸区',
											),
										10 =>
											array (
												'id' => '420115',
												'name' => '江夏区',
											),
										11 =>
											array (
												'id' => '420116',
												'name' => '黄陂区',
											),
										12 =>
											array (
												'id' => '420117',
												'name' => '新洲区',
											),
									),
							),
						1 =>
							array (
								'id' => '420200',
								'name' => '黄石市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '420202',
												'name' => '黄石港区',
											),
										1 =>
											array (
												'id' => '420203',
												'name' => '西塞山区',
											),
										2 =>
											array (
												'id' => '420204',
												'name' => '下陆区',
											),
										3 =>
											array (
												'id' => '420205',
												'name' => '铁山区',
											),
										4 =>
											array (
												'id' => '420222',
												'name' => '阳新县',
											),
										5 =>
											array (
												'id' => '420281',
												'name' => '大冶市',
											),
									),
							),
						2 =>
							array (
								'id' => '420300',
								'name' => '十堰市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '420302',
												'name' => '茅箭区',
											),
										1 =>
											array (
												'id' => '420303',
												'name' => '张湾区',
											),
										2 =>
											array (
												'id' => '420321',
												'name' => '郧　县',
											),
										3 =>
											array (
												'id' => '420322',
												'name' => '郧西县',
											),
										4 =>
											array (
												'id' => '420323',
												'name' => '竹山县',
											),
										5 =>
											array (
												'id' => '420324',
												'name' => '竹溪县',
											),
										6 =>
											array (
												'id' => '420325',
												'name' => '房　县',
											),
										7 =>
											array (
												'id' => '420381',
												'name' => '丹江口市',
											),
									),
							),
						3 =>
							array (
								'id' => '420500',
								'name' => '宜昌市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '420502',
												'name' => '西陵区',
											),
										1 =>
											array (
												'id' => '420503',
												'name' => '伍家岗区',
											),
										2 =>
											array (
												'id' => '420504',
												'name' => '点军区',
											),
										3 =>
											array (
												'id' => '420505',
												'name' => '猇亭区',
											),
										4 =>
											array (
												'id' => '420506',
												'name' => '夷陵区',
											),
										5 =>
											array (
												'id' => '420525',
												'name' => '远安县',
											),
										6 =>
											array (
												'id' => '420526',
												'name' => '兴山县',
											),
										7 =>
											array (
												'id' => '420527',
												'name' => '秭归县',
											),
										8 =>
											array (
												'id' => '420528',
												'name' => '长阳土家族自治县',
											),
										9 =>
											array (
												'id' => '420529',
												'name' => '五峰土家族自治县',
											),
										10 =>
											array (
												'id' => '420581',
												'name' => '宜都市',
											),
										11 =>
											array (
												'id' => '420582',
												'name' => '当阳市',
											),
										12 =>
											array (
												'id' => '420583',
												'name' => '枝江市',
											),
									),
							),
						4 =>
							array (
								'id' => '420600',
								'name' => '襄樊市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '420602',
												'name' => '襄城区',
											),
										1 =>
											array (
												'id' => '420606',
												'name' => '樊城区',
											),
										2 =>
											array (
												'id' => '420607',
												'name' => '襄阳区',
											),
										3 =>
											array (
												'id' => '420624',
												'name' => '南漳县',
											),
										4 =>
											array (
												'id' => '420625',
												'name' => '谷城县',
											),
										5 =>
											array (
												'id' => '420626',
												'name' => '保康县',
											),
										6 =>
											array (
												'id' => '420682',
												'name' => '老河口市',
											),
										7 =>
											array (
												'id' => '420683',
												'name' => '枣阳市',
											),
										8 =>
											array (
												'id' => '420684',
												'name' => '宜城市',
											),
									),
							),
						5 =>
							array (
								'id' => '420700',
								'name' => '鄂州市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '420702',
												'name' => '梁子湖区',
											),
										1 =>
											array (
												'id' => '420703',
												'name' => '华容区',
											),
										2 =>
											array (
												'id' => '420704',
												'name' => '鄂城区',
											),
									),
							),
						6 =>
							array (
								'id' => '420800',
								'name' => '荆门市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '420802',
												'name' => '东宝区',
											),
										1 =>
											array (
												'id' => '420804',
												'name' => '掇刀区',
											),
										2 =>
											array (
												'id' => '420821',
												'name' => '京山县',
											),
										3 =>
											array (
												'id' => '420822',
												'name' => '沙洋县',
											),
										4 =>
											array (
												'id' => '420881',
												'name' => '钟祥市',
											),
									),
							),
						7 =>
							array (
								'id' => '420900',
								'name' => '孝感市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '420902',
												'name' => '孝南区',
											),
										1 =>
											array (
												'id' => '420921',
												'name' => '孝昌县',
											),
										2 =>
											array (
												'id' => '420922',
												'name' => '大悟县',
											),
										3 =>
											array (
												'id' => '420923',
												'name' => '云梦县',
											),
										4 =>
											array (
												'id' => '420981',
												'name' => '应城市',
											),
										5 =>
											array (
												'id' => '420982',
												'name' => '安陆市',
											),
										6 =>
											array (
												'id' => '420984',
												'name' => '汉川市',
											),
									),
							),
						8 =>
							array (
								'id' => '421000',
								'name' => '荆州市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '421002',
												'name' => '沙市区',
											),
										1 =>
											array (
												'id' => '421003',
												'name' => '荆州区',
											),
										2 =>
											array (
												'id' => '421022',
												'name' => '公安县',
											),
										3 =>
											array (
												'id' => '421023',
												'name' => '监利县',
											),
										4 =>
											array (
												'id' => '421024',
												'name' => '江陵县',
											),
										5 =>
											array (
												'id' => '421081',
												'name' => '石首市',
											),
										6 =>
											array (
												'id' => '421083',
												'name' => '洪湖市',
											),
										7 =>
											array (
												'id' => '421087',
												'name' => '松滋市',
											),
									),
							),
						9 =>
							array (
								'id' => '421100',
								'name' => '黄冈市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '421102',
												'name' => '黄州区',
											),
										1 =>
											array (
												'id' => '421121',
												'name' => '团风县',
											),
										2 =>
											array (
												'id' => '421122',
												'name' => '红安县',
											),
										3 =>
											array (
												'id' => '421123',
												'name' => '罗田县',
											),
										4 =>
											array (
												'id' => '421124',
												'name' => '英山县',
											),
										5 =>
											array (
												'id' => '421125',
												'name' => '浠水县',
											),
										6 =>
											array (
												'id' => '421126',
												'name' => '蕲春县',
											),
										7 =>
											array (
												'id' => '421127',
												'name' => '黄梅县',
											),
										8 =>
											array (
												'id' => '421181',
												'name' => '麻城市',
											),
										9 =>
											array (
												'id' => '421182',
												'name' => '武穴市',
											),
									),
							),
						10 =>
							array (
								'id' => '421200',
								'name' => '咸宁市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '421202',
												'name' => '咸安区',
											),
										1 =>
											array (
												'id' => '421221',
												'name' => '嘉鱼县',
											),
										2 =>
											array (
												'id' => '421222',
												'name' => '通城县',
											),
										3 =>
											array (
												'id' => '421223',
												'name' => '崇阳县',
											),
										4 =>
											array (
												'id' => '421224',
												'name' => '通山县',
											),
										5 =>
											array (
												'id' => '421281',
												'name' => '赤壁市',
											),
									),
							),
						11 =>
							array (
								'id' => '421300',
								'name' => '随州市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '421302',
												'name' => '曾都区',
											),
										1 =>
											array (
												'id' => '421381',
												'name' => '广水市',
											),
									),
							),
						12 =>
							array (
								'id' => '422800',
								'name' => '恩施土家族苗族自治州',
								'children' =>
									array (
										0 =>
											array (
												'id' => '422801',
												'name' => '恩施市',
											),
										1 =>
											array (
												'id' => '422802',
												'name' => '利川市',
											),
										2 =>
											array (
												'id' => '422822',
												'name' => '建始县',
											),
										3 =>
											array (
												'id' => '422823',
												'name' => '巴东县',
											),
										4 =>
											array (
												'id' => '422825',
												'name' => '宣恩县',
											),
										5 =>
											array (
												'id' => '422826',
												'name' => '咸丰县',
											),
										6 =>
											array (
												'id' => '422827',
												'name' => '来凤县',
											),
										7 =>
											array (
												'id' => '422828',
												'name' => '鹤峰县',
											),
									),
							),
						13 =>
							array (
								'id' => '429000',
								'name' => '省直辖行政单位',
								'children' =>
									array (
										0 =>
											array (
												'id' => '429004',
												'name' => '仙桃市',
											),
										1 =>
											array (
												'id' => '429005',
												'name' => '潜江市',
											),
										2 =>
											array (
												'id' => '429006',
												'name' => '天门市',
											),
										3 =>
											array (
												'id' => '429021',
												'name' => '神农架林区',
											),
									),
							),
					),
			),
		17 =>
			array (
				'id' => '430000',
				'name' => '湖南省',
				'children' =>
					array (
						0 =>
							array (
								'id' => '430100',
								'name' => '长沙市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '430102',
												'name' => '芙蓉区',
											),
										1 =>
											array (
												'id' => '430103',
												'name' => '天心区',
											),
										2 =>
											array (
												'id' => '430104',
												'name' => '岳麓区',
											),
										3 =>
											array (
												'id' => '430105',
												'name' => '开福区',
											),
										4 =>
											array (
												'id' => '430111',
												'name' => '雨花区',
											),
										5 =>
											array (
												'id' => '430121',
												'name' => '长沙县',
											),
										6 =>
											array (
												'id' => '430122',
												'name' => '望城县',
											),
										7 =>
											array (
												'id' => '430124',
												'name' => '宁乡县',
											),
										8 =>
											array (
												'id' => '430181',
												'name' => '浏阳市',
											),
									),
							),
						1 =>
							array (
								'id' => '430200',
								'name' => '株洲市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '430202',
												'name' => '荷塘区',
											),
										1 =>
											array (
												'id' => '430203',
												'name' => '芦淞区',
											),
										2 =>
											array (
												'id' => '430204',
												'name' => '石峰区',
											),
										3 =>
											array (
												'id' => '430211',
												'name' => '天元区',
											),
										4 =>
											array (
												'id' => '430221',
												'name' => '株洲县',
											),
										5 =>
											array (
												'id' => '430223',
												'name' => '攸　县',
											),
										6 =>
											array (
												'id' => '430224',
												'name' => '茶陵县',
											),
										7 =>
											array (
												'id' => '430225',
												'name' => '炎陵县',
											),
										8 =>
											array (
												'id' => '430281',
												'name' => '醴陵市',
											),
									),
							),
						2 =>
							array (
								'id' => '430300',
								'name' => '湘潭市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '430302',
												'name' => '雨湖区',
											),
										1 =>
											array (
												'id' => '430304',
												'name' => '岳塘区',
											),
										2 =>
											array (
												'id' => '430321',
												'name' => '湘潭县',
											),
										3 =>
											array (
												'id' => '430381',
												'name' => '湘乡市',
											),
										4 =>
											array (
												'id' => '430382',
												'name' => '韶山市',
											),
									),
							),
						3 =>
							array (
								'id' => '430400',
								'name' => '衡阳市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '430405',
												'name' => '珠晖区',
											),
										1 =>
											array (
												'id' => '430406',
												'name' => '雁峰区',
											),
										2 =>
											array (
												'id' => '430407',
												'name' => '石鼓区',
											),
										3 =>
											array (
												'id' => '430408',
												'name' => '蒸湘区',
											),
										4 =>
											array (
												'id' => '430412',
												'name' => '南岳区',
											),
										5 =>
											array (
												'id' => '430421',
												'name' => '衡阳县',
											),
										6 =>
											array (
												'id' => '430422',
												'name' => '衡南县',
											),
										7 =>
											array (
												'id' => '430423',
												'name' => '衡山县',
											),
										8 =>
											array (
												'id' => '430424',
												'name' => '衡东县',
											),
										9 =>
											array (
												'id' => '430426',
												'name' => '祁东县',
											),
										10 =>
											array (
												'id' => '430481',
												'name' => '耒阳市',
											),
										11 =>
											array (
												'id' => '430482',
												'name' => '常宁市',
											),
									),
							),
						4 =>
							array (
								'id' => '430500',
								'name' => '邵阳市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '430502',
												'name' => '双清区',
											),
										1 =>
											array (
												'id' => '430503',
												'name' => '大祥区',
											),
										2 =>
											array (
												'id' => '430511',
												'name' => '北塔区',
											),
										3 =>
											array (
												'id' => '430521',
												'name' => '邵东县',
											),
										4 =>
											array (
												'id' => '430522',
												'name' => '新邵县',
											),
										5 =>
											array (
												'id' => '430523',
												'name' => '邵阳县',
											),
										6 =>
											array (
												'id' => '430524',
												'name' => '隆回县',
											),
										7 =>
											array (
												'id' => '430525',
												'name' => '洞口县',
											),
										8 =>
											array (
												'id' => '430527',
												'name' => '绥宁县',
											),
										9 =>
											array (
												'id' => '430528',
												'name' => '新宁县',
											),
										10 =>
											array (
												'id' => '430529',
												'name' => '城步苗族自治县',
											),
										11 =>
											array (
												'id' => '430581',
												'name' => '武冈市',
											),
									),
							),
						5 =>
							array (
								'id' => '430600',
								'name' => '岳阳市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '430602',
												'name' => '岳阳楼区',
											),
										1 =>
											array (
												'id' => '430603',
												'name' => '云溪区',
											),
										2 =>
											array (
												'id' => '430611',
												'name' => '君山区',
											),
										3 =>
											array (
												'id' => '430621',
												'name' => '岳阳县',
											),
										4 =>
											array (
												'id' => '430623',
												'name' => '华容县',
											),
										5 =>
											array (
												'id' => '430624',
												'name' => '湘阴县',
											),
										6 =>
											array (
												'id' => '430626',
												'name' => '平江县',
											),
										7 =>
											array (
												'id' => '430681',
												'name' => '汨罗市',
											),
										8 =>
											array (
												'id' => '430682',
												'name' => '临湘市',
											),
									),
							),
						6 =>
							array (
								'id' => '430700',
								'name' => '常德市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '430702',
												'name' => '武陵区',
											),
										1 =>
											array (
												'id' => '430703',
												'name' => '鼎城区',
											),
										2 =>
											array (
												'id' => '430721',
												'name' => '安乡县',
											),
										3 =>
											array (
												'id' => '430722',
												'name' => '汉寿县',
											),
										4 =>
											array (
												'id' => '430723',
												'name' => '澧　县',
											),
										5 =>
											array (
												'id' => '430724',
												'name' => '临澧县',
											),
										6 =>
											array (
												'id' => '430725',
												'name' => '桃源县',
											),
										7 =>
											array (
												'id' => '430726',
												'name' => '石门县',
											),
										8 =>
											array (
												'id' => '430781',
												'name' => '津市市',
											),
									),
							),
						7 =>
							array (
								'id' => '430800',
								'name' => '张家界市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '430802',
												'name' => '永定区',
											),
										1 =>
											array (
												'id' => '430811',
												'name' => '武陵源区',
											),
										2 =>
											array (
												'id' => '430821',
												'name' => '慈利县',
											),
										3 =>
											array (
												'id' => '430822',
												'name' => '桑植县',
											),
									),
							),
						8 =>
							array (
								'id' => '430900',
								'name' => '益阳市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '430902',
												'name' => '资阳区',
											),
										1 =>
											array (
												'id' => '430903',
												'name' => '赫山区',
											),
										2 =>
											array (
												'id' => '430921',
												'name' => '南　县',
											),
										3 =>
											array (
												'id' => '430922',
												'name' => '桃江县',
											),
										4 =>
											array (
												'id' => '430923',
												'name' => '安化县',
											),
										5 =>
											array (
												'id' => '430981',
												'name' => '沅江市',
											),
									),
							),
						9 =>
							array (
								'id' => '431000',
								'name' => '郴州市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '431002',
												'name' => '北湖区',
											),
										1 =>
											array (
												'id' => '431003',
												'name' => '苏仙区',
											),
										2 =>
											array (
												'id' => '431021',
												'name' => '桂阳县',
											),
										3 =>
											array (
												'id' => '431022',
												'name' => '宜章县',
											),
										4 =>
											array (
												'id' => '431023',
												'name' => '永兴县',
											),
										5 =>
											array (
												'id' => '431024',
												'name' => '嘉禾县',
											),
										6 =>
											array (
												'id' => '431025',
												'name' => '临武县',
											),
										7 =>
											array (
												'id' => '431026',
												'name' => '汝城县',
											),
										8 =>
											array (
												'id' => '431027',
												'name' => '桂东县',
											),
										9 =>
											array (
												'id' => '431028',
												'name' => '安仁县',
											),
										10 =>
											array (
												'id' => '431081',
												'name' => '资兴市',
											),
									),
							),
						10 =>
							array (
								'id' => '431100',
								'name' => '永州市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '431102',
												'name' => '芝山区',
											),
										1 =>
											array (
												'id' => '431103',
												'name' => '冷水滩区',
											),
										2 =>
											array (
												'id' => '431121',
												'name' => '祁阳县',
											),
										3 =>
											array (
												'id' => '431122',
												'name' => '东安县',
											),
										4 =>
											array (
												'id' => '431123',
												'name' => '双牌县',
											),
										5 =>
											array (
												'id' => '431124',
												'name' => '道　县',
											),
										6 =>
											array (
												'id' => '431125',
												'name' => '江永县',
											),
										7 =>
											array (
												'id' => '431126',
												'name' => '宁远县',
											),
										8 =>
											array (
												'id' => '431127',
												'name' => '蓝山县',
											),
										9 =>
											array (
												'id' => '431128',
												'name' => '新田县',
											),
										10 =>
											array (
												'id' => '431129',
												'name' => '江华瑶族自治县',
											),
									),
							),
						11 =>
							array (
								'id' => '431200',
								'name' => '怀化市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '431202',
												'name' => '鹤城区',
											),
										1 =>
											array (
												'id' => '431221',
												'name' => '中方县',
											),
										2 =>
											array (
												'id' => '431222',
												'name' => '沅陵县',
											),
										3 =>
											array (
												'id' => '431223',
												'name' => '辰溪县',
											),
										4 =>
											array (
												'id' => '431224',
												'name' => '溆浦县',
											),
										5 =>
											array (
												'id' => '431225',
												'name' => '会同县',
											),
										6 =>
											array (
												'id' => '431226',
												'name' => '麻阳苗族自治县',
											),
										7 =>
											array (
												'id' => '431227',
												'name' => '新晃侗族自治县',
											),
										8 =>
											array (
												'id' => '431228',
												'name' => '芷江侗族自治县',
											),
										9 =>
											array (
												'id' => '431229',
												'name' => '靖州苗族侗族自治县',
											),
										10 =>
											array (
												'id' => '431230',
												'name' => '通道侗族自治县',
											),
										11 =>
											array (
												'id' => '431281',
												'name' => '洪江市',
											),
									),
							),
						12 =>
							array (
								'id' => '431300',
								'name' => '娄底市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '431302',
												'name' => '娄星区',
											),
										1 =>
											array (
												'id' => '431321',
												'name' => '双峰县',
											),
										2 =>
											array (
												'id' => '431322',
												'name' => '新化县',
											),
										3 =>
											array (
												'id' => '431381',
												'name' => '冷水江市',
											),
										4 =>
											array (
												'id' => '431382',
												'name' => '涟源市',
											),
									),
							),
						13 =>
							array (
								'id' => '433100',
								'name' => '湘西土家族苗族自治州',
								'children' =>
									array (
										0 =>
											array (
												'id' => '433101',
												'name' => '吉首市',
											),
										1 =>
											array (
												'id' => '433122',
												'name' => '泸溪县',
											),
										2 =>
											array (
												'id' => '433123',
												'name' => '凤凰县',
											),
										3 =>
											array (
												'id' => '433124',
												'name' => '花垣县',
											),
										4 =>
											array (
												'id' => '433125',
												'name' => '保靖县',
											),
										5 =>
											array (
												'id' => '433126',
												'name' => '古丈县',
											),
										6 =>
											array (
												'id' => '433127',
												'name' => '永顺县',
											),
										7 =>
											array (
												'id' => '433130',
												'name' => '龙山县',
											),
									),
							),
					),
			),
		18 =>
			array (
				'id' => '440000',
				'name' => '广东省',
				'children' =>
					array (
						0 =>
							array (
								'id' => '440100',
								'name' => '广州市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '440102',
												'name' => '东山区',
											),
										1 =>
											array (
												'id' => '440103',
												'name' => '荔湾区',
											),
										2 =>
											array (
												'id' => '440104',
												'name' => '越秀区',
											),
										3 =>
											array (
												'id' => '440105',
												'name' => '海珠区',
											),
										4 =>
											array (
												'id' => '440106',
												'name' => '天河区',
											),
										5 =>
											array (
												'id' => '440107',
												'name' => '芳村区',
											),
										6 =>
											array (
												'id' => '440111',
												'name' => '白云区',
											),
										7 =>
											array (
												'id' => '440112',
												'name' => '黄埔区',
											),
										8 =>
											array (
												'id' => '440113',
												'name' => '番禺区',
											),
										9 =>
											array (
												'id' => '440114',
												'name' => '花都区',
											),
										10 =>
											array (
												'id' => '440183',
												'name' => '增城市',
											),
										11 =>
											array (
												'id' => '440184',
												'name' => '从化市',
											),
									),
							),
						1 =>
							array (
								'id' => '440200',
								'name' => '韶关市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '440203',
												'name' => '武江区',
											),
										1 =>
											array (
												'id' => '440204',
												'name' => '浈江区',
											),
										2 =>
											array (
												'id' => '440205',
												'name' => '曲江区',
											),
										3 =>
											array (
												'id' => '440222',
												'name' => '始兴县',
											),
										4 =>
											array (
												'id' => '440224',
												'name' => '仁化县',
											),
										5 =>
											array (
												'id' => '440229',
												'name' => '翁源县',
											),
										6 =>
											array (
												'id' => '440232',
												'name' => '乳源瑶族自治县',
											),
										7 =>
											array (
												'id' => '440233',
												'name' => '新丰县',
											),
										8 =>
											array (
												'id' => '440281',
												'name' => '乐昌市',
											),
										9 =>
											array (
												'id' => '440282',
												'name' => '南雄市',
											),
									),
							),
						2 =>
							array (
								'id' => '440300',
								'name' => '深圳市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '440303',
												'name' => '罗湖区',
											),
										1 =>
											array (
												'id' => '440304',
												'name' => '福田区',
											),
										2 =>
											array (
												'id' => '440305',
												'name' => '南山区',
											),
										3 =>
											array (
												'id' => '440306',
												'name' => '宝安区',
											),
										4 =>
											array (
												'id' => '440307',
												'name' => '龙岗区',
											),
										5 =>
											array (
												'id' => '440308',
												'name' => '盐田区',
											),
									),
							),
						3 =>
							array (
								'id' => '440400',
								'name' => '珠海市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '440402',
												'name' => '香洲区',
											),
										1 =>
											array (
												'id' => '440403',
												'name' => '斗门区',
											),
										2 =>
											array (
												'id' => '440404',
												'name' => '金湾区',
											),
									),
							),
						4 =>
							array (
								'id' => '440500',
								'name' => '汕头市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '440507',
												'name' => '龙湖区',
											),
										1 =>
											array (
												'id' => '440511',
												'name' => '金平区',
											),
										2 =>
											array (
												'id' => '440512',
												'name' => '濠江区',
											),
										3 =>
											array (
												'id' => '440513',
												'name' => '潮阳区',
											),
										4 =>
											array (
												'id' => '440514',
												'name' => '潮南区',
											),
										5 =>
											array (
												'id' => '440515',
												'name' => '澄海区',
											),
										6 =>
											array (
												'id' => '440523',
												'name' => '南澳县',
											),
									),
							),
						5 =>
							array (
								'id' => '440600',
								'name' => '佛山市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '440604',
												'name' => '禅城区',
											),
										1 =>
											array (
												'id' => '440605',
												'name' => '南海区',
											),
										2 =>
											array (
												'id' => '440606',
												'name' => '顺德区',
											),
										3 =>
											array (
												'id' => '440607',
												'name' => '三水区',
											),
										4 =>
											array (
												'id' => '440608',
												'name' => '高明区',
											),
									),
							),
						6 =>
							array (
								'id' => '440700',
								'name' => '江门市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '440703',
												'name' => '蓬江区',
											),
										1 =>
											array (
												'id' => '440704',
												'name' => '江海区',
											),
										2 =>
											array (
												'id' => '440705',
												'name' => '新会区',
											),
										3 =>
											array (
												'id' => '440781',
												'name' => '台山市',
											),
										4 =>
											array (
												'id' => '440783',
												'name' => '开平市',
											),
										5 =>
											array (
												'id' => '440784',
												'name' => '鹤山市',
											),
										6 =>
											array (
												'id' => '440785',
												'name' => '恩平市',
											),
									),
							),
						7 =>
							array (
								'id' => '440800',
								'name' => '湛江市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '440802',
												'name' => '赤坎区',
											),
										1 =>
											array (
												'id' => '440803',
												'name' => '霞山区',
											),
										2 =>
											array (
												'id' => '440804',
												'name' => '坡头区',
											),
										3 =>
											array (
												'id' => '440811',
												'name' => '麻章区',
											),
										4 =>
											array (
												'id' => '440823',
												'name' => '遂溪县',
											),
										5 =>
											array (
												'id' => '440825',
												'name' => '徐闻县',
											),
										6 =>
											array (
												'id' => '440881',
												'name' => '廉江市',
											),
										7 =>
											array (
												'id' => '440882',
												'name' => '雷州市',
											),
										8 =>
											array (
												'id' => '440883',
												'name' => '吴川市',
											),
									),
							),
						8 =>
							array (
								'id' => '440900',
								'name' => '茂名市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '440902',
												'name' => '茂南区',
											),
										1 =>
											array (
												'id' => '440903',
												'name' => '茂港区',
											),
										2 =>
											array (
												'id' => '440923',
												'name' => '电白县',
											),
										3 =>
											array (
												'id' => '440981',
												'name' => '高州市',
											),
										4 =>
											array (
												'id' => '440982',
												'name' => '化州市',
											),
										5 =>
											array (
												'id' => '440983',
												'name' => '信宜市',
											),
									),
							),
						9 =>
							array (
								'id' => '441200',
								'name' => '肇庆市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '441202',
												'name' => '端州区',
											),
										1 =>
											array (
												'id' => '441203',
												'name' => '鼎湖区',
											),
										2 =>
											array (
												'id' => '441223',
												'name' => '广宁县',
											),
										3 =>
											array (
												'id' => '441224',
												'name' => '怀集县',
											),
										4 =>
											array (
												'id' => '441225',
												'name' => '封开县',
											),
										5 =>
											array (
												'id' => '441226',
												'name' => '德庆县',
											),
										6 =>
											array (
												'id' => '441283',
												'name' => '高要市',
											),
										7 =>
											array (
												'id' => '441284',
												'name' => '四会市',
											),
									),
							),
						10 =>
							array (
								'id' => '441300',
								'name' => '惠州市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '441302',
												'name' => '惠城区',
											),
										1 =>
											array (
												'id' => '441303',
												'name' => '惠阳区',
											),
										2 =>
											array (
												'id' => '441322',
												'name' => '博罗县',
											),
										3 =>
											array (
												'id' => '441323',
												'name' => '惠东县',
											),
										4 =>
											array (
												'id' => '441324',
												'name' => '龙门县',
											),
									),
							),
						11 =>
							array (
								'id' => '441400',
								'name' => '梅州市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '441402',
												'name' => '梅江区',
											),
										1 =>
											array (
												'id' => '441421',
												'name' => '梅　县',
											),
										2 =>
											array (
												'id' => '441422',
												'name' => '大埔县',
											),
										3 =>
											array (
												'id' => '441423',
												'name' => '丰顺县',
											),
										4 =>
											array (
												'id' => '441424',
												'name' => '五华县',
											),
										5 =>
											array (
												'id' => '441426',
												'name' => '平远县',
											),
										6 =>
											array (
												'id' => '441427',
												'name' => '蕉岭县',
											),
										7 =>
											array (
												'id' => '441481',
												'name' => '兴宁市',
											),
									),
							),
						12 =>
							array (
								'id' => '441500',
								'name' => '汕尾市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '441502',
												'name' => '城　区',
											),
										1 =>
											array (
												'id' => '441521',
												'name' => '海丰县',
											),
										2 =>
											array (
												'id' => '441523',
												'name' => '陆河县',
											),
										3 =>
											array (
												'id' => '441581',
												'name' => '陆丰市',
											),
									),
							),
						13 =>
							array (
								'id' => '441600',
								'name' => '河源市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '441602',
												'name' => '源城区',
											),
										1 =>
											array (
												'id' => '441621',
												'name' => '紫金县',
											),
										2 =>
											array (
												'id' => '441622',
												'name' => '龙川县',
											),
										3 =>
											array (
												'id' => '441623',
												'name' => '连平县',
											),
										4 =>
											array (
												'id' => '441624',
												'name' => '和平县',
											),
										5 =>
											array (
												'id' => '441625',
												'name' => '东源县',
											),
									),
							),
						14 =>
							array (
								'id' => '441700',
								'name' => '阳江市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '441702',
												'name' => '江城区',
											),
										1 =>
											array (
												'id' => '441721',
												'name' => '阳西县',
											),
										2 =>
											array (
												'id' => '441723',
												'name' => '阳东县',
											),
										3 =>
											array (
												'id' => '441781',
												'name' => '阳春市',
											),
									),
							),
						15 =>
							array (
								'id' => '441800',
								'name' => '清远市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '441802',
												'name' => '清城区',
											),
										1 =>
											array (
												'id' => '441821',
												'name' => '佛冈县',
											),
										2 =>
											array (
												'id' => '441823',
												'name' => '阳山县',
											),
										3 =>
											array (
												'id' => '441825',
												'name' => '连山壮族瑶族自治县',
											),
										4 =>
											array (
												'id' => '441826',
												'name' => '连南瑶族自治县',
											),
										5 =>
											array (
												'id' => '441827',
												'name' => '清新县',
											),
										6 =>
											array (
												'id' => '441881',
												'name' => '英德市',
											),
										7 =>
											array (
												'id' => '441882',
												'name' => '连州市',
											),
									),
							),
						16 =>
							array (
								'id' => '441900',
								'name' => '东莞市',
							),
						17 =>
							array (
								'id' => '442000',
								'name' => '中山市',
							),
						18 =>
							array (
								'id' => '445100',
								'name' => '潮州市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '445102',
												'name' => '湘桥区',
											),
										1 =>
											array (
												'id' => '445121',
												'name' => '潮安县',
											),
										2 =>
											array (
												'id' => '445122',
												'name' => '饶平县',
											),
									),
							),
						19 =>
							array (
								'id' => '445200',
								'name' => '揭阳市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '445202',
												'name' => '榕城区',
											),
										1 =>
											array (
												'id' => '445221',
												'name' => '揭东县',
											),
										2 =>
											array (
												'id' => '445222',
												'name' => '揭西县',
											),
										3 =>
											array (
												'id' => '445224',
												'name' => '惠来县',
											),
										4 =>
											array (
												'id' => '445281',
												'name' => '普宁市',
											),
									),
							),
						20 =>
							array (
								'id' => '445300',
								'name' => '云浮市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '445302',
												'name' => '云城区',
											),
										1 =>
											array (
												'id' => '445321',
												'name' => '新兴县',
											),
										2 =>
											array (
												'id' => '445322',
												'name' => '郁南县',
											),
										3 =>
											array (
												'id' => '445323',
												'name' => '云安县',
											),
										4 =>
											array (
												'id' => '445381',
												'name' => '罗定市',
											),
									),
							),
					),
			),
		19 =>
			array (
				'id' => '450000',
				'name' => '广西壮族自治区',
				'children' =>
					array (
						0 =>
							array (
								'id' => '450100',
								'name' => '南宁市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '450102',
												'name' => '兴宁区',
											),
										1 =>
											array (
												'id' => '450103',
												'name' => '青秀区',
											),
										2 =>
											array (
												'id' => '450105',
												'name' => '江南区',
											),
										3 =>
											array (
												'id' => '450107',
												'name' => '西乡塘区',
											),
										4 =>
											array (
												'id' => '450108',
												'name' => '良庆区',
											),
										5 =>
											array (
												'id' => '450109',
												'name' => '邕宁区',
											),
										6 =>
											array (
												'id' => '450122',
												'name' => '武鸣县',
											),
										7 =>
											array (
												'id' => '450123',
												'name' => '隆安县',
											),
										8 =>
											array (
												'id' => '450124',
												'name' => '马山县',
											),
										9 =>
											array (
												'id' => '450125',
												'name' => '上林县',
											),
										10 =>
											array (
												'id' => '450126',
												'name' => '宾阳县',
											),
										11 =>
											array (
												'id' => '450127',
												'name' => '横　县',
											),
									),
							),
						1 =>
							array (
								'id' => '450200',
								'name' => '柳州市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '450202',
												'name' => '城中区',
											),
										1 =>
											array (
												'id' => '450203',
												'name' => '鱼峰区',
											),
										2 =>
											array (
												'id' => '450204',
												'name' => '柳南区',
											),
										3 =>
											array (
												'id' => '450205',
												'name' => '柳北区',
											),
										4 =>
											array (
												'id' => '450221',
												'name' => '柳江县',
											),
										5 =>
											array (
												'id' => '450222',
												'name' => '柳城县',
											),
										6 =>
											array (
												'id' => '450223',
												'name' => '鹿寨县',
											),
										7 =>
											array (
												'id' => '450224',
												'name' => '融安县',
											),
										8 =>
											array (
												'id' => '450225',
												'name' => '融水苗族自治县',
											),
										9 =>
											array (
												'id' => '450226',
												'name' => '三江侗族自治县',
											),
									),
							),
						2 =>
							array (
								'id' => '450300',
								'name' => '桂林市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '450302',
												'name' => '秀峰区',
											),
										1 =>
											array (
												'id' => '450303',
												'name' => '叠彩区',
											),
										2 =>
											array (
												'id' => '450304',
												'name' => '象山区',
											),
										3 =>
											array (
												'id' => '450305',
												'name' => '七星区',
											),
										4 =>
											array (
												'id' => '450311',
												'name' => '雁山区',
											),
										5 =>
											array (
												'id' => '450321',
												'name' => '阳朔县',
											),
										6 =>
											array (
												'id' => '450322',
												'name' => '临桂县',
											),
										7 =>
											array (
												'id' => '450323',
												'name' => '灵川县',
											),
										8 =>
											array (
												'id' => '450324',
												'name' => '全州县',
											),
										9 =>
											array (
												'id' => '450325',
												'name' => '兴安县',
											),
										10 =>
											array (
												'id' => '450326',
												'name' => '永福县',
											),
										11 =>
											array (
												'id' => '450327',
												'name' => '灌阳县',
											),
										12 =>
											array (
												'id' => '450328',
												'name' => '龙胜各族自治县',
											),
										13 =>
											array (
												'id' => '450329',
												'name' => '资源县',
											),
										14 =>
											array (
												'id' => '450330',
												'name' => '平乐县',
											),
										15 =>
											array (
												'id' => '450331',
												'name' => '荔蒲县',
											),
										16 =>
											array (
												'id' => '450332',
												'name' => '恭城瑶族自治县',
											),
									),
							),
						3 =>
							array (
								'id' => '450400',
								'name' => '梧州市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '450403',
												'name' => '万秀区',
											),
										1 =>
											array (
												'id' => '450404',
												'name' => '蝶山区',
											),
										2 =>
											array (
												'id' => '450405',
												'name' => '长洲区',
											),
										3 =>
											array (
												'id' => '450421',
												'name' => '苍梧县',
											),
										4 =>
											array (
												'id' => '450422',
												'name' => '藤　县',
											),
										5 =>
											array (
												'id' => '450423',
												'name' => '蒙山县',
											),
										6 =>
											array (
												'id' => '450481',
												'name' => '岑溪市',
											),
									),
							),
						4 =>
							array (
								'id' => '450500',
								'name' => '北海市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '450502',
												'name' => '海城区',
											),
										1 =>
											array (
												'id' => '450503',
												'name' => '银海区',
											),
										2 =>
											array (
												'id' => '450512',
												'name' => '铁山港区',
											),
										3 =>
											array (
												'id' => '450521',
												'name' => '合浦县',
											),
									),
							),
						5 =>
							array (
								'id' => '450600',
								'name' => '防城港市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '450602',
												'name' => '港口区',
											),
										1 =>
											array (
												'id' => '450603',
												'name' => '防城区',
											),
										2 =>
											array (
												'id' => '450621',
												'name' => '上思县',
											),
										3 =>
											array (
												'id' => '450681',
												'name' => '东兴市',
											),
									),
							),
						6 =>
							array (
								'id' => '450700',
								'name' => '钦州市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '450702',
												'name' => '钦南区',
											),
										1 =>
											array (
												'id' => '450703',
												'name' => '钦北区',
											),
										2 =>
											array (
												'id' => '450721',
												'name' => '灵山县',
											),
										3 =>
											array (
												'id' => '450722',
												'name' => '浦北县',
											),
									),
							),
						7 =>
							array (
								'id' => '450800',
								'name' => '贵港市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '450802',
												'name' => '港北区',
											),
										1 =>
											array (
												'id' => '450803',
												'name' => '港南区',
											),
										2 =>
											array (
												'id' => '450804',
												'name' => '覃塘区',
											),
										3 =>
											array (
												'id' => '450821',
												'name' => '平南县',
											),
										4 =>
											array (
												'id' => '450881',
												'name' => '桂平市',
											),
									),
							),
						8 =>
							array (
								'id' => '450900',
								'name' => '玉林市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '450902',
												'name' => '玉州区',
											),
										1 =>
											array (
												'id' => '450921',
												'name' => '容　县',
											),
										2 =>
											array (
												'id' => '450922',
												'name' => '陆川县',
											),
										3 =>
											array (
												'id' => '450923',
												'name' => '博白县',
											),
										4 =>
											array (
												'id' => '450924',
												'name' => '兴业县',
											),
										5 =>
											array (
												'id' => '450981',
												'name' => '北流市',
											),
									),
							),
						9 =>
							array (
								'id' => '451000',
								'name' => '百色市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '451002',
												'name' => '右江区',
											),
										1 =>
											array (
												'id' => '451021',
												'name' => '田阳县',
											),
										2 =>
											array (
												'id' => '451022',
												'name' => '田东县',
											),
										3 =>
											array (
												'id' => '451023',
												'name' => '平果县',
											),
										4 =>
											array (
												'id' => '451024',
												'name' => '德保县',
											),
										5 =>
											array (
												'id' => '451025',
												'name' => '靖西县',
											),
										6 =>
											array (
												'id' => '451026',
												'name' => '那坡县',
											),
										7 =>
											array (
												'id' => '451027',
												'name' => '凌云县',
											),
										8 =>
											array (
												'id' => '451028',
												'name' => '乐业县',
											),
										9 =>
											array (
												'id' => '451029',
												'name' => '田林县',
											),
										10 =>
											array (
												'id' => '451030',
												'name' => '西林县',
											),
										11 =>
											array (
												'id' => '451031',
												'name' => '隆林各族自治县',
											),
									),
							),
						10 =>
							array (
								'id' => '451100',
								'name' => '贺州市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '451102',
												'name' => '八步区',
											),
										1 =>
											array (
												'id' => '451121',
												'name' => '昭平县',
											),
										2 =>
											array (
												'id' => '451122',
												'name' => '钟山县',
											),
										3 =>
											array (
												'id' => '451123',
												'name' => '富川瑶族自治县',
											),
									),
							),
						11 =>
							array (
								'id' => '451200',
								'name' => '河池市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '451202',
												'name' => '金城江区',
											),
										1 =>
											array (
												'id' => '451221',
												'name' => '南丹县',
											),
										2 =>
											array (
												'id' => '451222',
												'name' => '天峨县',
											),
										3 =>
											array (
												'id' => '451223',
												'name' => '凤山县',
											),
										4 =>
											array (
												'id' => '451224',
												'name' => '东兰县',
											),
										5 =>
											array (
												'id' => '451225',
												'name' => '罗城仫佬族自治县',
											),
										6 =>
											array (
												'id' => '451226',
												'name' => '环江毛南族自治县',
											),
										7 =>
											array (
												'id' => '451227',
												'name' => '巴马瑶族自治县',
											),
										8 =>
											array (
												'id' => '451228',
												'name' => '都安瑶族自治县',
											),
										9 =>
											array (
												'id' => '451229',
												'name' => '大化瑶族自治县',
											),
										10 =>
											array (
												'id' => '451281',
												'name' => '宜州市',
											),
									),
							),
						12 =>
							array (
								'id' => '451300',
								'name' => '来宾市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '451302',
												'name' => '兴宾区',
											),
										1 =>
											array (
												'id' => '451321',
												'name' => '忻城县',
											),
										2 =>
											array (
												'id' => '451322',
												'name' => '象州县',
											),
										3 =>
											array (
												'id' => '451323',
												'name' => '武宣县',
											),
										4 =>
											array (
												'id' => '451324',
												'name' => '金秀瑶族自治县',
											),
										5 =>
											array (
												'id' => '451381',
												'name' => '合山市',
											),
									),
							),
						13 =>
							array (
								'id' => '451400',
								'name' => '崇左市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '451402',
												'name' => '江洲区',
											),
										1 =>
											array (
												'id' => '451421',
												'name' => '扶绥县',
											),
										2 =>
											array (
												'id' => '451422',
												'name' => '宁明县',
											),
										3 =>
											array (
												'id' => '451423',
												'name' => '龙州县',
											),
										4 =>
											array (
												'id' => '451424',
												'name' => '大新县',
											),
										5 =>
											array (
												'id' => '451425',
												'name' => '天等县',
											),
										6 =>
											array (
												'id' => '451481',
												'name' => '凭祥市',
											),
									),
							),
					),
			),
		20 =>
			array (
				'id' => '460000',
				'name' => '海南省',
				'children' =>
					array (
						0 =>
							array (
								'id' => '460100',
								'name' => '海口市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '460105',
												'name' => '秀英区',
											),
										1 =>
											array (
												'id' => '460106',
												'name' => '龙华区',
											),
										2 =>
											array (
												'id' => '460107',
												'name' => '琼山区',
											),
										3 =>
											array (
												'id' => '460108',
												'name' => '美兰区',
											),
									),
							),
						1 =>
							array (
								'id' => '460200',
								'name' => '三亚市',
							),
						2 =>
							array (
								'id' => '469000',
								'name' => '省直辖县级行政单位',
								'children' =>
									array (
										0 =>
											array (
												'id' => '469001',
												'name' => '五指山市',
											),
										1 =>
											array (
												'id' => '469002',
												'name' => '琼海市',
											),
										2 =>
											array (
												'id' => '469003',
												'name' => '儋州市',
											),
										3 =>
											array (
												'id' => '469005',
												'name' => '文昌市',
											),
										4 =>
											array (
												'id' => '469006',
												'name' => '万宁市',
											),
										5 =>
											array (
												'id' => '469007',
												'name' => '东方市',
											),
										6 =>
											array (
												'id' => '469025',
												'name' => '定安县',
											),
										7 =>
											array (
												'id' => '469026',
												'name' => '屯昌县',
											),
										8 =>
											array (
												'id' => '469027',
												'name' => '澄迈县',
											),
										9 =>
											array (
												'id' => '469028',
												'name' => '临高县',
											),
										10 =>
											array (
												'id' => '469030',
												'name' => '白沙黎族自治县',
											),
										11 =>
											array (
												'id' => '469031',
												'name' => '昌江黎族自治县',
											),
										12 =>
											array (
												'id' => '469033',
												'name' => '乐东黎族自治县',
											),
										13 =>
											array (
												'id' => '469034',
												'name' => '陵水黎族自治县',
											),
										14 =>
											array (
												'id' => '469035',
												'name' => '保亭黎族苗族自治县',
											),
										15 =>
											array (
												'id' => '469036',
												'name' => '琼中黎族苗族自治县',
											),
										16 =>
											array (
												'id' => '469037',
												'name' => '西沙群岛',
											),
										17 =>
											array (
												'id' => '469038',
												'name' => '南沙群岛',
											),
										18 =>
											array (
												'id' => '469039',
												'name' => '中沙群岛的岛礁及其海域',
											),
									),
							),
					),
			),
		21 =>
			array (
				'id' => '500000',
				'name' => '重庆市',
				'children' =>
					array (
						0 =>
							array (
								'id' => '500101',
								'name' => '万州区',
							),
						1 =>
							array (
								'id' => '500102',
								'name' => '涪陵区',
							),
						2 =>
							array (
								'id' => '500103',
								'name' => '渝中区',
							),
						3 =>
							array (
								'id' => '500104',
								'name' => '大渡口区',
							),
						4 =>
							array (
								'id' => '500105',
								'name' => '江北区',
							),
						5 =>
							array (
								'id' => '500106',
								'name' => '沙坪坝区',
							),
						6 =>
							array (
								'id' => '500107',
								'name' => '九龙坡区',
							),
						7 =>
							array (
								'id' => '500108',
								'name' => '南岸区',
							),
						8 =>
							array (
								'id' => '500109',
								'name' => '北碚区',
							),
						9 =>
							array (
								'id' => '500110',
								'name' => '万盛区',
							),
						10 =>
							array (
								'id' => '500111',
								'name' => '双桥区',
							),
						11 =>
							array (
								'id' => '500112',
								'name' => '渝北区',
							),
						12 =>
							array (
								'id' => '500113',
								'name' => '巴南区',
							),
						13 =>
							array (
								'id' => '500114',
								'name' => '黔江区',
							),
						14 =>
							array (
								'id' => '500115',
								'name' => '长寿区',
							),
						15 =>
							array (
								'id' => '500200',
								'name' => '县',
								'children' =>
									array (
										0 =>
											array (
												'id' => '500222',
												'name' => '綦江县',
											),
										1 =>
											array (
												'id' => '500223',
												'name' => '潼南县',
											),
										2 =>
											array (
												'id' => '500224',
												'name' => '铜梁县',
											),
										3 =>
											array (
												'id' => '500225',
												'name' => '大足县',
											),
										4 =>
											array (
												'id' => '500226',
												'name' => '荣昌县',
											),
										5 =>
											array (
												'id' => '500227',
												'name' => '璧山县',
											),
										6 =>
											array (
												'id' => '500228',
												'name' => '梁平县',
											),
										7 =>
											array (
												'id' => '500229',
												'name' => '城口县',
											),
										8 =>
											array (
												'id' => '500230',
												'name' => '丰都县',
											),
										9 =>
											array (
												'id' => '500231',
												'name' => '垫江县',
											),
										10 =>
											array (
												'id' => '500232',
												'name' => '武隆县',
											),
										11 =>
											array (
												'id' => '500233',
												'name' => '忠　县',
											),
										12 =>
											array (
												'id' => '500234',
												'name' => '开　县',
											),
										13 =>
											array (
												'id' => '500235',
												'name' => '云阳县',
											),
										14 =>
											array (
												'id' => '500236',
												'name' => '奉节县',
											),
										15 =>
											array (
												'id' => '500237',
												'name' => '巫山县',
											),
										16 =>
											array (
												'id' => '500238',
												'name' => '巫溪县',
											),
										17 =>
											array (
												'id' => '500240',
												'name' => '石柱土家族自治县',
											),
										18 =>
											array (
												'id' => '500241',
												'name' => '秀山土家族苗族自治县',
											),
										19 =>
											array (
												'id' => '500242',
												'name' => '酉阳土家族苗族自治县',
											),
										20 =>
											array (
												'id' => '500243',
												'name' => '彭水苗族土家族自治县',
											),
									),
							),
						16 =>
							array (
								'id' => '500300',
								'name' => '市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '500381',
												'name' => '江津市',
											),
										1 =>
											array (
												'id' => '500382',
												'name' => '合川市',
											),
										2 =>
											array (
												'id' => '500383',
												'name' => '永川市',
											),
										3 =>
											array (
												'id' => '500384',
												'name' => '南川市',
											),
									),
							),
					),
			),
		22 =>
			array (
				'id' => '510000',
				'name' => '四川省',
				'children' =>
					array (
						0 =>
							array (
								'id' => '510100',
								'name' => '成都市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '510104',
												'name' => '锦江区',
											),
										1 =>
											array (
												'id' => '510105',
												'name' => '青羊区',
											),
										2 =>
											array (
												'id' => '510106',
												'name' => '金牛区',
											),
										3 =>
											array (
												'id' => '510107',
												'name' => '武侯区',
											),
										4 =>
											array (
												'id' => '510108',
												'name' => '成华区',
											),
										5 =>
											array (
												'id' => '510112',
												'name' => '龙泉驿区',
											),
										6 =>
											array (
												'id' => '510113',
												'name' => '青白江区',
											),
										7 =>
											array (
												'id' => '510114',
												'name' => '新都区',
											),
										8 =>
											array (
												'id' => '510115',
												'name' => '温江区',
											),
										9 =>
											array (
												'id' => '510121',
												'name' => '金堂县',
											),
										10 =>
											array (
												'id' => '510122',
												'name' => '双流县',
											),
										11 =>
											array (
												'id' => '510124',
												'name' => '郫　县',
											),
										12 =>
											array (
												'id' => '510129',
												'name' => '大邑县',
											),
										13 =>
											array (
												'id' => '510131',
												'name' => '蒲江县',
											),
										14 =>
											array (
												'id' => '510132',
												'name' => '新津县',
											),
										15 =>
											array (
												'id' => '510181',
												'name' => '都江堰市',
											),
										16 =>
											array (
												'id' => '510182',
												'name' => '彭州市',
											),
										17 =>
											array (
												'id' => '510183',
												'name' => '邛崃市',
											),
										18 =>
											array (
												'id' => '510184',
												'name' => '崇州市',
											),
									),
							),
						1 =>
							array (
								'id' => '510300',
								'name' => '自贡市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '510302',
												'name' => '自流井区',
											),
										1 =>
											array (
												'id' => '510303',
												'name' => '贡井区',
											),
										2 =>
											array (
												'id' => '510304',
												'name' => '大安区',
											),
										3 =>
											array (
												'id' => '510311',
												'name' => '沿滩区',
											),
										4 =>
											array (
												'id' => '510321',
												'name' => '荣　县',
											),
										5 =>
											array (
												'id' => '510322',
												'name' => '富顺县',
											),
									),
							),
						2 =>
							array (
								'id' => '510400',
								'name' => '攀枝花市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '510402',
												'name' => '东　区',
											),
										1 =>
											array (
												'id' => '510403',
												'name' => '西　区',
											),
										2 =>
											array (
												'id' => '510411',
												'name' => '仁和区',
											),
										3 =>
											array (
												'id' => '510421',
												'name' => '米易县',
											),
										4 =>
											array (
												'id' => '510422',
												'name' => '盐边县',
											),
									),
							),
						3 =>
							array (
								'id' => '510500',
								'name' => '泸州市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '510502',
												'name' => '江阳区',
											),
										1 =>
											array (
												'id' => '510503',
												'name' => '纳溪区',
											),
										2 =>
											array (
												'id' => '510504',
												'name' => '龙马潭区',
											),
										3 =>
											array (
												'id' => '510521',
												'name' => '泸　县',
											),
										4 =>
											array (
												'id' => '510522',
												'name' => '合江县',
											),
										5 =>
											array (
												'id' => '510524',
												'name' => '叙永县',
											),
										6 =>
											array (
												'id' => '510525',
												'name' => '古蔺县',
											),
									),
							),
						4 =>
							array (
								'id' => '510600',
								'name' => '德阳市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '510603',
												'name' => '旌阳区',
											),
										1 =>
											array (
												'id' => '510623',
												'name' => '中江县',
											),
										2 =>
											array (
												'id' => '510626',
												'name' => '罗江县',
											),
										3 =>
											array (
												'id' => '510681',
												'name' => '广汉市',
											),
										4 =>
											array (
												'id' => '510682',
												'name' => '什邡市',
											),
										5 =>
											array (
												'id' => '510683',
												'name' => '绵竹市',
											),
									),
							),
						5 =>
							array (
								'id' => '510700',
								'name' => '绵阳市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '510703',
												'name' => '涪城区',
											),
										1 =>
											array (
												'id' => '510704',
												'name' => '游仙区',
											),
										2 =>
											array (
												'id' => '510722',
												'name' => '三台县',
											),
										3 =>
											array (
												'id' => '510723',
												'name' => '盐亭县',
											),
										4 =>
											array (
												'id' => '510724',
												'name' => '安　县',
											),
										5 =>
											array (
												'id' => '510725',
												'name' => '梓潼县',
											),
										6 =>
											array (
												'id' => '510726',
												'name' => '北川羌族自治县',
											),
										7 =>
											array (
												'id' => '510727',
												'name' => '平武县',
											),
										8 =>
											array (
												'id' => '510781',
												'name' => '江油市',
											),
									),
							),
						6 =>
							array (
								'id' => '510800',
								'name' => '广元市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '510802',
												'name' => '市中区',
											),
										1 =>
											array (
												'id' => '510811',
												'name' => '元坝区',
											),
										2 =>
											array (
												'id' => '510812',
												'name' => '朝天区',
											),
										3 =>
											array (
												'id' => '510821',
												'name' => '旺苍县',
											),
										4 =>
											array (
												'id' => '510822',
												'name' => '青川县',
											),
										5 =>
											array (
												'id' => '510823',
												'name' => '剑阁县',
											),
										6 =>
											array (
												'id' => '510824',
												'name' => '苍溪县',
											),
									),
							),
						7 =>
							array (
								'id' => '510900',
								'name' => '遂宁市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '510903',
												'name' => '船山区',
											),
										1 =>
											array (
												'id' => '510904',
												'name' => '安居区',
											),
										2 =>
											array (
												'id' => '510921',
												'name' => '蓬溪县',
											),
										3 =>
											array (
												'id' => '510922',
												'name' => '射洪县',
											),
										4 =>
											array (
												'id' => '510923',
												'name' => '大英县',
											),
									),
							),
						8 =>
							array (
								'id' => '511000',
								'name' => '内江市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '511002',
												'name' => '市中区',
											),
										1 =>
											array (
												'id' => '511011',
												'name' => '东兴区',
											),
										2 =>
											array (
												'id' => '511024',
												'name' => '威远县',
											),
										3 =>
											array (
												'id' => '511025',
												'name' => '资中县',
											),
										4 =>
											array (
												'id' => '511028',
												'name' => '隆昌县',
											),
									),
							),
						9 =>
							array (
								'id' => '511100',
								'name' => '乐山市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '511102',
												'name' => '市中区',
											),
										1 =>
											array (
												'id' => '511111',
												'name' => '沙湾区',
											),
										2 =>
											array (
												'id' => '511112',
												'name' => '五通桥区',
											),
										3 =>
											array (
												'id' => '511113',
												'name' => '金口河区',
											),
										4 =>
											array (
												'id' => '511123',
												'name' => '犍为县',
											),
										5 =>
											array (
												'id' => '511124',
												'name' => '井研县',
											),
										6 =>
											array (
												'id' => '511126',
												'name' => '夹江县',
											),
										7 =>
											array (
												'id' => '511129',
												'name' => '沐川县',
											),
										8 =>
											array (
												'id' => '511132',
												'name' => '峨边彝族自治县',
											),
										9 =>
											array (
												'id' => '511133',
												'name' => '马边彝族自治县',
											),
										10 =>
											array (
												'id' => '511181',
												'name' => '峨眉山市',
											),
									),
							),
						10 =>
							array (
								'id' => '511300',
								'name' => '南充市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '511302',
												'name' => '顺庆区',
											),
										1 =>
											array (
												'id' => '511303',
												'name' => '高坪区',
											),
										2 =>
											array (
												'id' => '511304',
												'name' => '嘉陵区',
											),
										3 =>
											array (
												'id' => '511321',
												'name' => '南部县',
											),
										4 =>
											array (
												'id' => '511322',
												'name' => '营山县',
											),
										5 =>
											array (
												'id' => '511323',
												'name' => '蓬安县',
											),
										6 =>
											array (
												'id' => '511324',
												'name' => '仪陇县',
											),
										7 =>
											array (
												'id' => '511325',
												'name' => '西充县',
											),
										8 =>
											array (
												'id' => '511381',
												'name' => '阆中市',
											),
									),
							),
						11 =>
							array (
								'id' => '511400',
								'name' => '眉山市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '511402',
												'name' => '东坡区',
											),
										1 =>
											array (
												'id' => '511421',
												'name' => '仁寿县',
											),
										2 =>
											array (
												'id' => '511422',
												'name' => '彭山县',
											),
										3 =>
											array (
												'id' => '511423',
												'name' => '洪雅县',
											),
										4 =>
											array (
												'id' => '511424',
												'name' => '丹棱县',
											),
										5 =>
											array (
												'id' => '511425',
												'name' => '青神县',
											),
									),
							),
						12 =>
							array (
								'id' => '511500',
								'name' => '宜宾市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '511502',
												'name' => '翠屏区',
											),
										1 =>
											array (
												'id' => '511521',
												'name' => '宜宾县',
											),
										2 =>
											array (
												'id' => '511522',
												'name' => '南溪县',
											),
										3 =>
											array (
												'id' => '511523',
												'name' => '江安县',
											),
										4 =>
											array (
												'id' => '511524',
												'name' => '长宁县',
											),
										5 =>
											array (
												'id' => '511525',
												'name' => '高　县',
											),
										6 =>
											array (
												'id' => '511526',
												'name' => '珙　县',
											),
										7 =>
											array (
												'id' => '511527',
												'name' => '筠连县',
											),
										8 =>
											array (
												'id' => '511528',
												'name' => '兴文县',
											),
										9 =>
											array (
												'id' => '511529',
												'name' => '屏山县',
											),
									),
							),
						13 =>
							array (
								'id' => '511600',
								'name' => '广安市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '511602',
												'name' => '广安区',
											),
										1 =>
											array (
												'id' => '511621',
												'name' => '岳池县',
											),
										2 =>
											array (
												'id' => '511622',
												'name' => '武胜县',
											),
										3 =>
											array (
												'id' => '511623',
												'name' => '邻水县',
											),
										4 =>
											array (
												'id' => '511681',
												'name' => '华莹市',
											),
									),
							),
						14 =>
							array (
								'id' => '511700',
								'name' => '达州市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '511702',
												'name' => '通川区',
											),
										1 =>
											array (
												'id' => '511721',
												'name' => '达　县',
											),
										2 =>
											array (
												'id' => '511722',
												'name' => '宣汉县',
											),
										3 =>
											array (
												'id' => '511723',
												'name' => '开江县',
											),
										4 =>
											array (
												'id' => '511724',
												'name' => '大竹县',
											),
										5 =>
											array (
												'id' => '511725',
												'name' => '渠　县',
											),
										6 =>
											array (
												'id' => '511781',
												'name' => '万源市',
											),
									),
							),
						15 =>
							array (
								'id' => '511800',
								'name' => '雅安市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '511802',
												'name' => '雨城区',
											),
										1 =>
											array (
												'id' => '511821',
												'name' => '名山县',
											),
										2 =>
											array (
												'id' => '511822',
												'name' => '荥经县',
											),
										3 =>
											array (
												'id' => '511823',
												'name' => '汉源县',
											),
										4 =>
											array (
												'id' => '511824',
												'name' => '石棉县',
											),
										5 =>
											array (
												'id' => '511825',
												'name' => '天全县',
											),
										6 =>
											array (
												'id' => '511826',
												'name' => '芦山县',
											),
										7 =>
											array (
												'id' => '511827',
												'name' => '宝兴县',
											),
									),
							),
						16 =>
							array (
								'id' => '511900',
								'name' => '巴中市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '511902',
												'name' => '巴州区',
											),
										1 =>
											array (
												'id' => '511921',
												'name' => '通江县',
											),
										2 =>
											array (
												'id' => '511922',
												'name' => '南江县',
											),
										3 =>
											array (
												'id' => '511923',
												'name' => '平昌县',
											),
									),
							),
						17 =>
							array (
								'id' => '512000',
								'name' => '资阳市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '512002',
												'name' => '雁江区',
											),
										1 =>
											array (
												'id' => '512021',
												'name' => '安岳县',
											),
										2 =>
											array (
												'id' => '512022',
												'name' => '乐至县',
											),
										3 =>
											array (
												'id' => '512081',
												'name' => '简阳市',
											),
									),
							),
						18 =>
							array (
								'id' => '513200',
								'name' => '阿坝藏族羌族自治州',
								'children' =>
									array (
										0 =>
											array (
												'id' => '513221',
												'name' => '汶川县',
											),
										1 =>
											array (
												'id' => '513222',
												'name' => '理　县',
											),
										2 =>
											array (
												'id' => '513223',
												'name' => '茂　县',
											),
										3 =>
											array (
												'id' => '513224',
												'name' => '松潘县',
											),
										4 =>
											array (
												'id' => '513225',
												'name' => '九寨沟县',
											),
										5 =>
											array (
												'id' => '513226',
												'name' => '金川县',
											),
										6 =>
											array (
												'id' => '513227',
												'name' => '小金县',
											),
										7 =>
											array (
												'id' => '513228',
												'name' => '黑水县',
											),
										8 =>
											array (
												'id' => '513229',
												'name' => '马尔康县',
											),
										9 =>
											array (
												'id' => '513230',
												'name' => '壤塘县',
											),
										10 =>
											array (
												'id' => '513231',
												'name' => '阿坝县',
											),
										11 =>
											array (
												'id' => '513232',
												'name' => '若尔盖县',
											),
										12 =>
											array (
												'id' => '513233',
												'name' => '红原县',
											),
									),
							),
						19 =>
							array (
								'id' => '513300',
								'name' => '甘孜藏族自治州',
								'children' =>
									array (
										0 =>
											array (
												'id' => '513321',
												'name' => '康定县',
											),
										1 =>
											array (
												'id' => '513322',
												'name' => '泸定县',
											),
										2 =>
											array (
												'id' => '513323',
												'name' => '丹巴县',
											),
										3 =>
											array (
												'id' => '513324',
												'name' => '九龙县',
											),
										4 =>
											array (
												'id' => '513325',
												'name' => '雅江县',
											),
										5 =>
											array (
												'id' => '513326',
												'name' => '道孚县',
											),
										6 =>
											array (
												'id' => '513327',
												'name' => '炉霍县',
											),
										7 =>
											array (
												'id' => '513328',
												'name' => '甘孜县',
											),
										8 =>
											array (
												'id' => '513329',
												'name' => '新龙县',
											),
										9 =>
											array (
												'id' => '513330',
												'name' => '德格县',
											),
										10 =>
											array (
												'id' => '513331',
												'name' => '白玉县',
											),
										11 =>
											array (
												'id' => '513332',
												'name' => '石渠县',
											),
										12 =>
											array (
												'id' => '513333',
												'name' => '色达县',
											),
										13 =>
											array (
												'id' => '513334',
												'name' => '理塘县',
											),
										14 =>
											array (
												'id' => '513335',
												'name' => '巴塘县',
											),
										15 =>
											array (
												'id' => '513336',
												'name' => '乡城县',
											),
										16 =>
											array (
												'id' => '513337',
												'name' => '稻城县',
											),
										17 =>
											array (
												'id' => '513338',
												'name' => '得荣县',
											),
									),
							),
						20 =>
							array (
								'id' => '513400',
								'name' => '凉山彝族自治州',
								'children' =>
									array (
										0 =>
											array (
												'id' => '513401',
												'name' => '西昌市',
											),
										1 =>
											array (
												'id' => '513422',
												'name' => '木里藏族自治县',
											),
										2 =>
											array (
												'id' => '513423',
												'name' => '盐源县',
											),
										3 =>
											array (
												'id' => '513424',
												'name' => '德昌县',
											),
										4 =>
											array (
												'id' => '513425',
												'name' => '会理县',
											),
										5 =>
											array (
												'id' => '513426',
												'name' => '会东县',
											),
										6 =>
											array (
												'id' => '513427',
												'name' => '宁南县',
											),
										7 =>
											array (
												'id' => '513428',
												'name' => '普格县',
											),
										8 =>
											array (
												'id' => '513429',
												'name' => '布拖县',
											),
										9 =>
											array (
												'id' => '513430',
												'name' => '金阳县',
											),
										10 =>
											array (
												'id' => '513431',
												'name' => '昭觉县',
											),
										11 =>
											array (
												'id' => '513432',
												'name' => '喜德县',
											),
										12 =>
											array (
												'id' => '513433',
												'name' => '冕宁县',
											),
										13 =>
											array (
												'id' => '513434',
												'name' => '越西县',
											),
										14 =>
											array (
												'id' => '513435',
												'name' => '甘洛县',
											),
										15 =>
											array (
												'id' => '513436',
												'name' => '美姑县',
											),
										16 =>
											array (
												'id' => '513437',
												'name' => '雷波县',
											),
									),
							),
					),
			),
		23 =>
			array (
				'id' => '520000',
				'name' => '贵州省',
				'children' =>
					array (
						0 =>
							array (
								'id' => '520100',
								'name' => '贵阳市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '520102',
												'name' => '南明区',
											),
										1 =>
											array (
												'id' => '520103',
												'name' => '云岩区',
											),
										2 =>
											array (
												'id' => '520111',
												'name' => '花溪区',
											),
										3 =>
											array (
												'id' => '520112',
												'name' => '乌当区',
											),
										4 =>
											array (
												'id' => '520113',
												'name' => '白云区',
											),
										5 =>
											array (
												'id' => '520114',
												'name' => '小河区',
											),
										6 =>
											array (
												'id' => '520121',
												'name' => '开阳县',
											),
										7 =>
											array (
												'id' => '520122',
												'name' => '息烽县',
											),
										8 =>
											array (
												'id' => '520123',
												'name' => '修文县',
											),
										9 =>
											array (
												'id' => '520181',
												'name' => '清镇市',
											),
									),
							),
						1 =>
							array (
								'id' => '520200',
								'name' => '六盘水市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '520201',
												'name' => '钟山区',
											),
										1 =>
											array (
												'id' => '520203',
												'name' => '六枝特区',
											),
										2 =>
											array (
												'id' => '520221',
												'name' => '水城县',
											),
										3 =>
											array (
												'id' => '520222',
												'name' => '盘　县',
											),
									),
							),
						2 =>
							array (
								'id' => '520300',
								'name' => '遵义市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '520302',
												'name' => '红花岗区',
											),
										1 =>
											array (
												'id' => '520303',
												'name' => '汇川区',
											),
										2 =>
											array (
												'id' => '520321',
												'name' => '遵义县',
											),
										3 =>
											array (
												'id' => '520322',
												'name' => '桐梓县',
											),
										4 =>
											array (
												'id' => '520323',
												'name' => '绥阳县',
											),
										5 =>
											array (
												'id' => '520324',
												'name' => '正安县',
											),
										6 =>
											array (
												'id' => '520325',
												'name' => '道真仡佬族苗族自治县',
											),
										7 =>
											array (
												'id' => '520326',
												'name' => '务川仡佬族苗族自治县',
											),
										8 =>
											array (
												'id' => '520327',
												'name' => '凤冈县',
											),
										9 =>
											array (
												'id' => '520328',
												'name' => '湄潭县',
											),
										10 =>
											array (
												'id' => '520329',
												'name' => '余庆县',
											),
										11 =>
											array (
												'id' => '520330',
												'name' => '习水县',
											),
										12 =>
											array (
												'id' => '520381',
												'name' => '赤水市',
											),
										13 =>
											array (
												'id' => '520382',
												'name' => '仁怀市',
											),
									),
							),
						3 =>
							array (
								'id' => '520400',
								'name' => '安顺市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '520402',
												'name' => '西秀区',
											),
										1 =>
											array (
												'id' => '520421',
												'name' => '平坝县',
											),
										2 =>
											array (
												'id' => '520422',
												'name' => '普定县',
											),
										3 =>
											array (
												'id' => '520423',
												'name' => '镇宁布依族苗族自治县',
											),
										4 =>
											array (
												'id' => '520424',
												'name' => '关岭布依族苗族自治县',
											),
										5 =>
											array (
												'id' => '520425',
												'name' => '紫云苗族布依族自治县',
											),
									),
							),
						4 =>
							array (
								'id' => '522200',
								'name' => '铜仁地区',
								'children' =>
									array (
										0 =>
											array (
												'id' => '522201',
												'name' => '铜仁市',
											),
										1 =>
											array (
												'id' => '522222',
												'name' => '江口县',
											),
										2 =>
											array (
												'id' => '522223',
												'name' => '玉屏侗族自治县',
											),
										3 =>
											array (
												'id' => '522224',
												'name' => '石阡县',
											),
										4 =>
											array (
												'id' => '522225',
												'name' => '思南县',
											),
										5 =>
											array (
												'id' => '522226',
												'name' => '印江土家族苗族自治县',
											),
										6 =>
											array (
												'id' => '522227',
												'name' => '德江县',
											),
										7 =>
											array (
												'id' => '522228',
												'name' => '沿河土家族自治县',
											),
										8 =>
											array (
												'id' => '522229',
												'name' => '松桃苗族自治县',
											),
										9 =>
											array (
												'id' => '522230',
												'name' => '万山特区',
											),
									),
							),
						5 =>
							array (
								'id' => '522300',
								'name' => '黔西南布依族苗族自治州',
								'children' =>
									array (
										0 =>
											array (
												'id' => '522301',
												'name' => '兴义市',
											),
										1 =>
											array (
												'id' => '522322',
												'name' => '兴仁县',
											),
										2 =>
											array (
												'id' => '522323',
												'name' => '普安县',
											),
										3 =>
											array (
												'id' => '522324',
												'name' => '晴隆县',
											),
										4 =>
											array (
												'id' => '522325',
												'name' => '贞丰县',
											),
										5 =>
											array (
												'id' => '522326',
												'name' => '望谟县',
											),
										6 =>
											array (
												'id' => '522327',
												'name' => '册亨县',
											),
										7 =>
											array (
												'id' => '522328',
												'name' => '安龙县',
											),
									),
							),
						6 =>
							array (
								'id' => '522400',
								'name' => '毕节地区',
								'children' =>
									array (
										0 =>
											array (
												'id' => '522401',
												'name' => '毕节市',
											),
										1 =>
											array (
												'id' => '522422',
												'name' => '大方县',
											),
										2 =>
											array (
												'id' => '522423',
												'name' => '黔西县',
											),
										3 =>
											array (
												'id' => '522424',
												'name' => '金沙县',
											),
										4 =>
											array (
												'id' => '522425',
												'name' => '织金县',
											),
										5 =>
											array (
												'id' => '522426',
												'name' => '纳雍县',
											),
										6 =>
											array (
												'id' => '522427',
												'name' => '威宁彝族回族苗族自治县',
											),
										7 =>
											array (
												'id' => '522428',
												'name' => '赫章县',
											),
									),
							),
						7 =>
							array (
								'id' => '522600',
								'name' => '黔东南苗族侗族自治州',
								'children' =>
									array (
										0 =>
											array (
												'id' => '522601',
												'name' => '凯里市',
											),
										1 =>
											array (
												'id' => '522622',
												'name' => '黄平县',
											),
										2 =>
											array (
												'id' => '522623',
												'name' => '施秉县',
											),
										3 =>
											array (
												'id' => '522624',
												'name' => '三穗县',
											),
										4 =>
											array (
												'id' => '522625',
												'name' => '镇远县',
											),
										5 =>
											array (
												'id' => '522626',
												'name' => '岑巩县',
											),
										6 =>
											array (
												'id' => '522627',
												'name' => '天柱县',
											),
										7 =>
											array (
												'id' => '522628',
												'name' => '锦屏县',
											),
										8 =>
											array (
												'id' => '522629',
												'name' => '剑河县',
											),
										9 =>
											array (
												'id' => '522630',
												'name' => '台江县',
											),
										10 =>
											array (
												'id' => '522631',
												'name' => '黎平县',
											),
										11 =>
											array (
												'id' => '522632',
												'name' => '榕江县',
											),
										12 =>
											array (
												'id' => '522633',
												'name' => '从江县',
											),
										13 =>
											array (
												'id' => '522634',
												'name' => '雷山县',
											),
										14 =>
											array (
												'id' => '522635',
												'name' => '麻江县',
											),
										15 =>
											array (
												'id' => '522636',
												'name' => '丹寨县',
											),
									),
							),
						8 =>
							array (
								'id' => '522700',
								'name' => '黔南布依族苗族自治州',
								'children' =>
									array (
										0 =>
											array (
												'id' => '522701',
												'name' => '都匀市',
											),
										1 =>
											array (
												'id' => '522702',
												'name' => '福泉市',
											),
										2 =>
											array (
												'id' => '522722',
												'name' => '荔波县',
											),
										3 =>
											array (
												'id' => '522723',
												'name' => '贵定县',
											),
										4 =>
											array (
												'id' => '522725',
												'name' => '瓮安县',
											),
										5 =>
											array (
												'id' => '522726',
												'name' => '独山县',
											),
										6 =>
											array (
												'id' => '522727',
												'name' => '平塘县',
											),
										7 =>
											array (
												'id' => '522728',
												'name' => '罗甸县',
											),
										8 =>
											array (
												'id' => '522729',
												'name' => '长顺县',
											),
										9 =>
											array (
												'id' => '522730',
												'name' => '龙里县',
											),
										10 =>
											array (
												'id' => '522731',
												'name' => '惠水县',
											),
										11 =>
											array (
												'id' => '522732',
												'name' => '三都水族自治县',
											),
									),
							),
					),
			),
		24 =>
			array (
				'id' => '530000',
				'name' => '云南省',
				'children' =>
					array (
						0 =>
							array (
								'id' => '530100',
								'name' => '昆明市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '530102',
												'name' => '五华区',
											),
										1 =>
											array (
												'id' => '530103',
												'name' => '盘龙区',
											),
										2 =>
											array (
												'id' => '530111',
												'name' => '官渡区',
											),
										3 =>
											array (
												'id' => '530112',
												'name' => '西山区',
											),
										4 =>
											array (
												'id' => '530113',
												'name' => '东川区',
											),
										5 =>
											array (
												'id' => '530121',
												'name' => '呈贡县',
											),
										6 =>
											array (
												'id' => '530122',
												'name' => '晋宁县',
											),
										7 =>
											array (
												'id' => '530124',
												'name' => '富民县',
											),
										8 =>
											array (
												'id' => '530125',
												'name' => '宜良县',
											),
										9 =>
											array (
												'id' => '530126',
												'name' => '石林彝族自治县',
											),
										10 =>
											array (
												'id' => '530127',
												'name' => '嵩明县',
											),
										11 =>
											array (
												'id' => '530128',
												'name' => '禄劝彝族苗族自治县',
											),
										12 =>
											array (
												'id' => '530129',
												'name' => '寻甸回族彝族自治县',
											),
										13 =>
											array (
												'id' => '530181',
												'name' => '安宁市',
											),
									),
							),
						1 =>
							array (
								'id' => '530300',
								'name' => '曲靖市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '530302',
												'name' => '麒麟区',
											),
										1 =>
											array (
												'id' => '530321',
												'name' => '马龙县',
											),
										2 =>
											array (
												'id' => '530322',
												'name' => '陆良县',
											),
										3 =>
											array (
												'id' => '530323',
												'name' => '师宗县',
											),
										4 =>
											array (
												'id' => '530324',
												'name' => '罗平县',
											),
										5 =>
											array (
												'id' => '530325',
												'name' => '富源县',
											),
										6 =>
											array (
												'id' => '530326',
												'name' => '会泽县',
											),
										7 =>
											array (
												'id' => '530328',
												'name' => '沾益县',
											),
										8 =>
											array (
												'id' => '530381',
												'name' => '宣威市',
											),
									),
							),
						2 =>
							array (
								'id' => '530400',
								'name' => '玉溪市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '530402',
												'name' => '红塔区',
											),
										1 =>
											array (
												'id' => '530421',
												'name' => '江川县',
											),
										2 =>
											array (
												'id' => '530422',
												'name' => '澄江县',
											),
										3 =>
											array (
												'id' => '530423',
												'name' => '通海县',
											),
										4 =>
											array (
												'id' => '530424',
												'name' => '华宁县',
											),
										5 =>
											array (
												'id' => '530425',
												'name' => '易门县',
											),
										6 =>
											array (
												'id' => '530426',
												'name' => '峨山彝族自治县',
											),
										7 =>
											array (
												'id' => '530427',
												'name' => '新平彝族傣族自治县',
											),
										8 =>
											array (
												'id' => '530428',
												'name' => '元江哈尼族彝族傣族自治县',
											),
									),
							),
						3 =>
							array (
								'id' => '530500',
								'name' => '保山市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '530502',
												'name' => '隆阳区',
											),
										1 =>
											array (
												'id' => '530521',
												'name' => '施甸县',
											),
										2 =>
											array (
												'id' => '530522',
												'name' => '腾冲县',
											),
										3 =>
											array (
												'id' => '530523',
												'name' => '龙陵县',
											),
										4 =>
											array (
												'id' => '530524',
												'name' => '昌宁县',
											),
									),
							),
						4 =>
							array (
								'id' => '530600',
								'name' => '昭通市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '530602',
												'name' => '昭阳区',
											),
										1 =>
											array (
												'id' => '530621',
												'name' => '鲁甸县',
											),
										2 =>
											array (
												'id' => '530622',
												'name' => '巧家县',
											),
										3 =>
											array (
												'id' => '530623',
												'name' => '盐津县',
											),
										4 =>
											array (
												'id' => '530624',
												'name' => '大关县',
											),
										5 =>
											array (
												'id' => '530625',
												'name' => '永善县',
											),
										6 =>
											array (
												'id' => '530626',
												'name' => '绥江县',
											),
										7 =>
											array (
												'id' => '530627',
												'name' => '镇雄县',
											),
										8 =>
											array (
												'id' => '530628',
												'name' => '彝良县',
											),
										9 =>
											array (
												'id' => '530629',
												'name' => '威信县',
											),
										10 =>
											array (
												'id' => '530630',
												'name' => '水富县',
											),
									),
							),
						5 =>
							array (
								'id' => '530700',
								'name' => '丽江市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '530702',
												'name' => '古城区',
											),
										1 =>
											array (
												'id' => '530721',
												'name' => '玉龙纳西族自治县',
											),
										2 =>
											array (
												'id' => '530722',
												'name' => '永胜县',
											),
										3 =>
											array (
												'id' => '530723',
												'name' => '华坪县',
											),
										4 =>
											array (
												'id' => '530724',
												'name' => '宁蒗彝族自治县',
											),
									),
							),
						6 =>
							array (
								'id' => '530800',
								'name' => '思茅市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '530802',
												'name' => '翠云区',
											),
										1 =>
											array (
												'id' => '530821',
												'name' => '普洱哈尼族彝族自治县',
											),
										2 =>
											array (
												'id' => '530822',
												'name' => '墨江哈尼族自治县',
											),
										3 =>
											array (
												'id' => '530823',
												'name' => '景东彝族自治县',
											),
										4 =>
											array (
												'id' => '530824',
												'name' => '景谷傣族彝族自治县',
											),
										5 =>
											array (
												'id' => '530825',
												'name' => '镇沅彝族哈尼族拉祜族自治县',
											),
										6 =>
											array (
												'id' => '530826',
												'name' => '江城哈尼族彝族自治县',
											),
										7 =>
											array (
												'id' => '530827',
												'name' => '孟连傣族拉祜族佤族自治县',
											),
										8 =>
											array (
												'id' => '530828',
												'name' => '澜沧拉祜族自治县',
											),
										9 =>
											array (
												'id' => '530829',
												'name' => '西盟佤族自治县',
											),
									),
							),
						7 =>
							array (
								'id' => '530900',
								'name' => '临沧市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '530902',
												'name' => '临翔区',
											),
										1 =>
											array (
												'id' => '530921',
												'name' => '凤庆县',
											),
										2 =>
											array (
												'id' => '530922',
												'name' => '云　县',
											),
										3 =>
											array (
												'id' => '530923',
												'name' => '永德县',
											),
										4 =>
											array (
												'id' => '530924',
												'name' => '镇康县',
											),
										5 =>
											array (
												'id' => '530925',
												'name' => '双江拉祜族佤族布朗族傣族自治县',
											),
										6 =>
											array (
												'id' => '530926',
												'name' => '耿马傣族佤族自治县',
											),
										7 =>
											array (
												'id' => '530927',
												'name' => '沧源佤族自治县',
											),
									),
							),
						8 =>
							array (
								'id' => '532300',
								'name' => '楚雄彝族自治州',
								'children' =>
									array (
										0 =>
											array (
												'id' => '532301',
												'name' => '楚雄市',
											),
										1 =>
											array (
												'id' => '532322',
												'name' => '双柏县',
											),
										2 =>
											array (
												'id' => '532323',
												'name' => '牟定县',
											),
										3 =>
											array (
												'id' => '532324',
												'name' => '南华县',
											),
										4 =>
											array (
												'id' => '532325',
												'name' => '姚安县',
											),
										5 =>
											array (
												'id' => '532326',
												'name' => '大姚县',
											),
										6 =>
											array (
												'id' => '532327',
												'name' => '永仁县',
											),
										7 =>
											array (
												'id' => '532328',
												'name' => '元谋县',
											),
										8 =>
											array (
												'id' => '532329',
												'name' => '武定县',
											),
										9 =>
											array (
												'id' => '532331',
												'name' => '禄丰县',
											),
									),
							),
						9 =>
							array (
								'id' => '532500',
								'name' => '红河哈尼族彝族自治州',
								'children' =>
									array (
										0 =>
											array (
												'id' => '532501',
												'name' => '个旧市',
											),
										1 =>
											array (
												'id' => '532502',
												'name' => '开远市',
											),
										2 =>
											array (
												'id' => '532522',
												'name' => '蒙自县',
											),
										3 =>
											array (
												'id' => '532523',
												'name' => '屏边苗族自治县',
											),
										4 =>
											array (
												'id' => '532524',
												'name' => '建水县',
											),
										5 =>
											array (
												'id' => '532525',
												'name' => '石屏县',
											),
										6 =>
											array (
												'id' => '532526',
												'name' => '弥勒县',
											),
										7 =>
											array (
												'id' => '532527',
												'name' => '泸西县',
											),
										8 =>
											array (
												'id' => '532528',
												'name' => '元阳县',
											),
										9 =>
											array (
												'id' => '532529',
												'name' => '红河县',
											),
										10 =>
											array (
												'id' => '532530',
												'name' => '金平苗族瑶族傣族自治县',
											),
										11 =>
											array (
												'id' => '532531',
												'name' => '绿春县',
											),
										12 =>
											array (
												'id' => '532532',
												'name' => '河口瑶族自治县',
											),
									),
							),
						10 =>
							array (
								'id' => '532600',
								'name' => '文山壮族苗族自治州',
								'children' =>
									array (
										0 =>
											array (
												'id' => '532621',
												'name' => '文山县',
											),
										1 =>
											array (
												'id' => '532622',
												'name' => '砚山县',
											),
										2 =>
											array (
												'id' => '532623',
												'name' => '西畴县',
											),
										3 =>
											array (
												'id' => '532624',
												'name' => '麻栗坡县',
											),
										4 =>
											array (
												'id' => '532625',
												'name' => '马关县',
											),
										5 =>
											array (
												'id' => '532626',
												'name' => '丘北县',
											),
										6 =>
											array (
												'id' => '532627',
												'name' => '广南县',
											),
										7 =>
											array (
												'id' => '532628',
												'name' => '富宁县',
											),
									),
							),
						11 =>
							array (
								'id' => '532800',
								'name' => '西双版纳傣族自治州',
								'children' =>
									array (
										0 =>
											array (
												'id' => '532801',
												'name' => '景洪市',
											),
										1 =>
											array (
												'id' => '532822',
												'name' => '勐海县',
											),
										2 =>
											array (
												'id' => '532823',
												'name' => '勐腊县',
											),
									),
							),
						12 =>
							array (
								'id' => '532900',
								'name' => '大理白族自治州',
								'children' =>
									array (
										0 =>
											array (
												'id' => '532901',
												'name' => '大理市',
											),
										1 =>
											array (
												'id' => '532922',
												'name' => '漾濞彝族自治县',
											),
										2 =>
											array (
												'id' => '532923',
												'name' => '祥云县',
											),
										3 =>
											array (
												'id' => '532924',
												'name' => '宾川县',
											),
										4 =>
											array (
												'id' => '532925',
												'name' => '弥渡县',
											),
										5 =>
											array (
												'id' => '532926',
												'name' => '南涧彝族自治县',
											),
										6 =>
											array (
												'id' => '532927',
												'name' => '巍山彝族回族自治县',
											),
										7 =>
											array (
												'id' => '532928',
												'name' => '永平县',
											),
										8 =>
											array (
												'id' => '532929',
												'name' => '云龙县',
											),
										9 =>
											array (
												'id' => '532930',
												'name' => '洱源县',
											),
										10 =>
											array (
												'id' => '532931',
												'name' => '剑川县',
											),
										11 =>
											array (
												'id' => '532932',
												'name' => '鹤庆县',
											),
									),
							),
						13 =>
							array (
								'id' => '533100',
								'name' => '德宏傣族景颇族自治州',
								'children' =>
									array (
										0 =>
											array (
												'id' => '533102',
												'name' => '瑞丽市',
											),
										1 =>
											array (
												'id' => '533103',
												'name' => '潞西市',
											),
										2 =>
											array (
												'id' => '533122',
												'name' => '梁河县',
											),
										3 =>
											array (
												'id' => '533123',
												'name' => '盈江县',
											),
										4 =>
											array (
												'id' => '533124',
												'name' => '陇川县',
											),
									),
							),
						14 =>
							array (
								'id' => '533300',
								'name' => '怒江傈僳族自治州',
								'children' =>
									array (
										0 =>
											array (
												'id' => '533321',
												'name' => '泸水县',
											),
										1 =>
											array (
												'id' => '533323',
												'name' => '福贡县',
											),
										2 =>
											array (
												'id' => '533324',
												'name' => '贡山独龙族怒族自治县',
											),
										3 =>
											array (
												'id' => '533325',
												'name' => '兰坪白族普米族自治县',
											),
									),
							),
						15 =>
							array (
								'id' => '533400',
								'name' => '迪庆藏族自治州',
								'children' =>
									array (
										0 =>
											array (
												'id' => '533421',
												'name' => '香格里拉县',
											),
										1 =>
											array (
												'id' => '533422',
												'name' => '德钦县',
											),
										2 =>
											array (
												'id' => '533423',
												'name' => '维西傈僳族自治县',
											),
									),
							),
					),
			),
		25 =>
			array (
				'id' => '540000',
				'name' => '西藏自治区',
				'children' =>
					array (
						0 =>
							array (
								'id' => '540100',
								'name' => '拉萨市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '540102',
												'name' => '城关区',
											),
										1 =>
											array (
												'id' => '540121',
												'name' => '林周县',
											),
										2 =>
											array (
												'id' => '540122',
												'name' => '当雄县',
											),
										3 =>
											array (
												'id' => '540123',
												'name' => '尼木县',
											),
										4 =>
											array (
												'id' => '540124',
												'name' => '曲水县',
											),
										5 =>
											array (
												'id' => '540125',
												'name' => '堆龙德庆县',
											),
										6 =>
											array (
												'id' => '540126',
												'name' => '达孜县',
											),
										7 =>
											array (
												'id' => '540127',
												'name' => '墨竹工卡县',
											),
									),
							),
						1 =>
							array (
								'id' => '542100',
								'name' => '昌都地区',
								'children' =>
									array (
										0 =>
											array (
												'id' => '542121',
												'name' => '昌都县',
											),
										1 =>
											array (
												'id' => '542122',
												'name' => '江达县',
											),
										2 =>
											array (
												'id' => '542123',
												'name' => '贡觉县',
											),
										3 =>
											array (
												'id' => '542124',
												'name' => '类乌齐县',
											),
										4 =>
											array (
												'id' => '542125',
												'name' => '丁青县',
											),
										5 =>
											array (
												'id' => '542126',
												'name' => '察雅县',
											),
										6 =>
											array (
												'id' => '542127',
												'name' => '八宿县',
											),
										7 =>
											array (
												'id' => '542128',
												'name' => '左贡县',
											),
										8 =>
											array (
												'id' => '542129',
												'name' => '芒康县',
											),
										9 =>
											array (
												'id' => '542132',
												'name' => '洛隆县',
											),
										10 =>
											array (
												'id' => '542133',
												'name' => '边坝县',
											),
									),
							),
						2 =>
							array (
								'id' => '542200',
								'name' => '山南地区',
								'children' =>
									array (
										0 =>
											array (
												'id' => '542221',
												'name' => '乃东县',
											),
										1 =>
											array (
												'id' => '542222',
												'name' => '扎囊县',
											),
										2 =>
											array (
												'id' => '542223',
												'name' => '贡嘎县',
											),
										3 =>
											array (
												'id' => '542224',
												'name' => '桑日县',
											),
										4 =>
											array (
												'id' => '542225',
												'name' => '琼结县',
											),
										5 =>
											array (
												'id' => '542226',
												'name' => '曲松县',
											),
										6 =>
											array (
												'id' => '542227',
												'name' => '措美县',
											),
										7 =>
											array (
												'id' => '542228',
												'name' => '洛扎县',
											),
										8 =>
											array (
												'id' => '542229',
												'name' => '加查县',
											),
										9 =>
											array (
												'id' => '542231',
												'name' => '隆子县',
											),
										10 =>
											array (
												'id' => '542232',
												'name' => '错那县',
											),
										11 =>
											array (
												'id' => '542233',
												'name' => '浪卡子县',
											),
									),
							),
						3 =>
							array (
								'id' => '542300',
								'name' => '日喀则地区',
								'children' =>
									array (
										0 =>
											array (
												'id' => '542301',
												'name' => '日喀则市',
											),
										1 =>
											array (
												'id' => '542322',
												'name' => '南木林县',
											),
										2 =>
											array (
												'id' => '542323',
												'name' => '江孜县',
											),
										3 =>
											array (
												'id' => '542324',
												'name' => '定日县',
											),
										4 =>
											array (
												'id' => '542325',
												'name' => '萨迦县',
											),
										5 =>
											array (
												'id' => '542326',
												'name' => '拉孜县',
											),
										6 =>
											array (
												'id' => '542327',
												'name' => '昂仁县',
											),
										7 =>
											array (
												'id' => '542328',
												'name' => '谢通门县',
											),
										8 =>
											array (
												'id' => '542329',
												'name' => '白朗县',
											),
										9 =>
											array (
												'id' => '542330',
												'name' => '仁布县',
											),
										10 =>
											array (
												'id' => '542331',
												'name' => '康马县',
											),
										11 =>
											array (
												'id' => '542332',
												'name' => '定结县',
											),
										12 =>
											array (
												'id' => '542333',
												'name' => '仲巴县',
											),
										13 =>
											array (
												'id' => '542334',
												'name' => '亚东县',
											),
										14 =>
											array (
												'id' => '542335',
												'name' => '吉隆县',
											),
										15 =>
											array (
												'id' => '542336',
												'name' => '聂拉木县',
											),
										16 =>
											array (
												'id' => '542337',
												'name' => '萨嘎县',
											),
										17 =>
											array (
												'id' => '542338',
												'name' => '岗巴县',
											),
									),
							),
						4 =>
							array (
								'id' => '542400',
								'name' => '那曲地区',
								'children' =>
									array (
										0 =>
											array (
												'id' => '542421',
												'name' => '那曲县',
											),
										1 =>
											array (
												'id' => '542422',
												'name' => '嘉黎县',
											),
										2 =>
											array (
												'id' => '542423',
												'name' => '比如县',
											),
										3 =>
											array (
												'id' => '542424',
												'name' => '聂荣县',
											),
										4 =>
											array (
												'id' => '542425',
												'name' => '安多县',
											),
										5 =>
											array (
												'id' => '542426',
												'name' => '申扎县',
											),
										6 =>
											array (
												'id' => '542427',
												'name' => '索　县',
											),
										7 =>
											array (
												'id' => '542428',
												'name' => '班戈县',
											),
										8 =>
											array (
												'id' => '542429',
												'name' => '巴青县',
											),
										9 =>
											array (
												'id' => '542430',
												'name' => '尼玛县',
											),
									),
							),
						5 =>
							array (
								'id' => '542500',
								'name' => '阿里地区',
								'children' =>
									array (
										0 =>
											array (
												'id' => '542521',
												'name' => '普兰县',
											),
										1 =>
											array (
												'id' => '542522',
												'name' => '札达县',
											),
										2 =>
											array (
												'id' => '542523',
												'name' => '噶尔县',
											),
										3 =>
											array (
												'id' => '542524',
												'name' => '日土县',
											),
										4 =>
											array (
												'id' => '542525',
												'name' => '革吉县',
											),
										5 =>
											array (
												'id' => '542526',
												'name' => '改则县',
											),
										6 =>
											array (
												'id' => '542527',
												'name' => '措勤县',
											),
									),
							),
						6 =>
							array (
								'id' => '542600',
								'name' => '林芝地区',
								'children' =>
									array (
										0 =>
											array (
												'id' => '542621',
												'name' => '林芝县',
											),
										1 =>
											array (
												'id' => '542622',
												'name' => '工布江达县',
											),
										2 =>
											array (
												'id' => '542623',
												'name' => '米林县',
											),
										3 =>
											array (
												'id' => '542624',
												'name' => '墨脱县',
											),
										4 =>
											array (
												'id' => '542625',
												'name' => '波密县',
											),
										5 =>
											array (
												'id' => '542626',
												'name' => '察隅县',
											),
										6 =>
											array (
												'id' => '542627',
												'name' => '朗　县',
											),
									),
							),
					),
			),
		26 =>
			array (
				'id' => '610000',
				'name' => '陕西省',
				'children' =>
					array (
						0 =>
							array (
								'id' => '610100',
								'name' => '西安市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '610102',
												'name' => '新城区',
											),
										1 =>
											array (
												'id' => '610103',
												'name' => '碑林区',
											),
										2 =>
											array (
												'id' => '610104',
												'name' => '莲湖区',
											),
										3 =>
											array (
												'id' => '610111',
												'name' => '灞桥区',
											),
										4 =>
											array (
												'id' => '610112',
												'name' => '未央区',
											),
										5 =>
											array (
												'id' => '610113',
												'name' => '雁塔区',
											),
										6 =>
											array (
												'id' => '610114',
												'name' => '阎良区',
											),
										7 =>
											array (
												'id' => '610115',
												'name' => '临潼区',
											),
										8 =>
											array (
												'id' => '610116',
												'name' => '长安区',
											),
										9 =>
											array (
												'id' => '610122',
												'name' => '蓝田县',
											),
										10 =>
											array (
												'id' => '610124',
												'name' => '周至县',
											),
										11 =>
											array (
												'id' => '610125',
												'name' => '户　县',
											),
										12 =>
											array (
												'id' => '610126',
												'name' => '高陵县',
											),
									),
							),
						1 =>
							array (
								'id' => '610200',
								'name' => '铜川市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '610202',
												'name' => '王益区',
											),
										1 =>
											array (
												'id' => '610203',
												'name' => '印台区',
											),
										2 =>
											array (
												'id' => '610204',
												'name' => '耀州区',
											),
										3 =>
											array (
												'id' => '610222',
												'name' => '宜君县',
											),
									),
							),
						2 =>
							array (
								'id' => '610300',
								'name' => '宝鸡市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '610302',
												'name' => '渭滨区',
											),
										1 =>
											array (
												'id' => '610303',
												'name' => '金台区',
											),
										2 =>
											array (
												'id' => '610304',
												'name' => '陈仓区',
											),
										3 =>
											array (
												'id' => '610322',
												'name' => '凤翔县',
											),
										4 =>
											array (
												'id' => '610323',
												'name' => '岐山县',
											),
										5 =>
											array (
												'id' => '610324',
												'name' => '扶风县',
											),
										6 =>
											array (
												'id' => '610326',
												'name' => '眉　县',
											),
										7 =>
											array (
												'id' => '610327',
												'name' => '陇　县',
											),
										8 =>
											array (
												'id' => '610328',
												'name' => '千阳县',
											),
										9 =>
											array (
												'id' => '610329',
												'name' => '麟游县',
											),
										10 =>
											array (
												'id' => '610330',
												'name' => '凤　县',
											),
										11 =>
											array (
												'id' => '610331',
												'name' => '太白县',
											),
									),
							),
						3 =>
							array (
								'id' => '610400',
								'name' => '咸阳市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '610402',
												'name' => '秦都区',
											),
										1 =>
											array (
												'id' => '610403',
												'name' => '杨凌区',
											),
										2 =>
											array (
												'id' => '610404',
												'name' => '渭城区',
											),
										3 =>
											array (
												'id' => '610422',
												'name' => '三原县',
											),
										4 =>
											array (
												'id' => '610423',
												'name' => '泾阳县',
											),
										5 =>
											array (
												'id' => '610424',
												'name' => '乾　县',
											),
										6 =>
											array (
												'id' => '610425',
												'name' => '礼泉县',
											),
										7 =>
											array (
												'id' => '610426',
												'name' => '永寿县',
											),
										8 =>
											array (
												'id' => '610427',
												'name' => '彬　县',
											),
										9 =>
											array (
												'id' => '610428',
												'name' => '长武县',
											),
										10 =>
											array (
												'id' => '610429',
												'name' => '旬邑县',
											),
										11 =>
											array (
												'id' => '610430',
												'name' => '淳化县',
											),
										12 =>
											array (
												'id' => '610431',
												'name' => '武功县',
											),
										13 =>
											array (
												'id' => '610481',
												'name' => '兴平市',
											),
									),
							),
						4 =>
							array (
								'id' => '610500',
								'name' => '渭南市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '610502',
												'name' => '临渭区',
											),
										1 =>
											array (
												'id' => '610521',
												'name' => '华　县',
											),
										2 =>
											array (
												'id' => '610522',
												'name' => '潼关县',
											),
										3 =>
											array (
												'id' => '610523',
												'name' => '大荔县',
											),
										4 =>
											array (
												'id' => '610524',
												'name' => '合阳县',
											),
										5 =>
											array (
												'id' => '610525',
												'name' => '澄城县',
											),
										6 =>
											array (
												'id' => '610526',
												'name' => '蒲城县',
											),
										7 =>
											array (
												'id' => '610527',
												'name' => '白水县',
											),
										8 =>
											array (
												'id' => '610528',
												'name' => '富平县',
											),
										9 =>
											array (
												'id' => '610581',
												'name' => '韩城市',
											),
										10 =>
											array (
												'id' => '610582',
												'name' => '华阴市',
											),
									),
							),
						5 =>
							array (
								'id' => '610600',
								'name' => '延安市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '610602',
												'name' => '宝塔区',
											),
										1 =>
											array (
												'id' => '610621',
												'name' => '延长县',
											),
										2 =>
											array (
												'id' => '610622',
												'name' => '延川县',
											),
										3 =>
											array (
												'id' => '610623',
												'name' => '子长县',
											),
										4 =>
											array (
												'id' => '610624',
												'name' => '安塞县',
											),
										5 =>
											array (
												'id' => '610625',
												'name' => '志丹县',
											),
										6 =>
											array (
												'id' => '610626',
												'name' => '吴旗县',
											),
										7 =>
											array (
												'id' => '610627',
												'name' => '甘泉县',
											),
										8 =>
											array (
												'id' => '610628',
												'name' => '富　县',
											),
										9 =>
											array (
												'id' => '610629',
												'name' => '洛川县',
											),
										10 =>
											array (
												'id' => '610630',
												'name' => '宜川县',
											),
										11 =>
											array (
												'id' => '610631',
												'name' => '黄龙县',
											),
										12 =>
											array (
												'id' => '610632',
												'name' => '黄陵县',
											),
									),
							),
						6 =>
							array (
								'id' => '610700',
								'name' => '汉中市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '610702',
												'name' => '汉台区',
											),
										1 =>
											array (
												'id' => '610721',
												'name' => '南郑县',
											),
										2 =>
											array (
												'id' => '610722',
												'name' => '城固县',
											),
										3 =>
											array (
												'id' => '610723',
												'name' => '洋　县',
											),
										4 =>
											array (
												'id' => '610724',
												'name' => '西乡县',
											),
										5 =>
											array (
												'id' => '610725',
												'name' => '勉　县',
											),
										6 =>
											array (
												'id' => '610726',
												'name' => '宁强县',
											),
										7 =>
											array (
												'id' => '610727',
												'name' => '略阳县',
											),
										8 =>
											array (
												'id' => '610728',
												'name' => '镇巴县',
											),
										9 =>
											array (
												'id' => '610729',
												'name' => '留坝县',
											),
										10 =>
											array (
												'id' => '610730',
												'name' => '佛坪县',
											),
									),
							),
						7 =>
							array (
								'id' => '610800',
								'name' => '榆林市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '610802',
												'name' => '榆阳区',
											),
										1 =>
											array (
												'id' => '610821',
												'name' => '神木县',
											),
										2 =>
											array (
												'id' => '610822',
												'name' => '府谷县',
											),
										3 =>
											array (
												'id' => '610823',
												'name' => '横山县',
											),
										4 =>
											array (
												'id' => '610824',
												'name' => '靖边县',
											),
										5 =>
											array (
												'id' => '610825',
												'name' => '定边县',
											),
										6 =>
											array (
												'id' => '610826',
												'name' => '绥德县',
											),
										7 =>
											array (
												'id' => '610827',
												'name' => '米脂县',
											),
										8 =>
											array (
												'id' => '610828',
												'name' => '佳　县',
											),
										9 =>
											array (
												'id' => '610829',
												'name' => '吴堡县',
											),
										10 =>
											array (
												'id' => '610830',
												'name' => '清涧县',
											),
										11 =>
											array (
												'id' => '610831',
												'name' => '子洲县',
											),
									),
							),
						8 =>
							array (
								'id' => '610900',
								'name' => '安康市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '610902',
												'name' => '汉滨区',
											),
										1 =>
											array (
												'id' => '610921',
												'name' => '汉阴县',
											),
										2 =>
											array (
												'id' => '610922',
												'name' => '石泉县',
											),
										3 =>
											array (
												'id' => '610923',
												'name' => '宁陕县',
											),
										4 =>
											array (
												'id' => '610924',
												'name' => '紫阳县',
											),
										5 =>
											array (
												'id' => '610925',
												'name' => '岚皋县',
											),
										6 =>
											array (
												'id' => '610926',
												'name' => '平利县',
											),
										7 =>
											array (
												'id' => '610927',
												'name' => '镇坪县',
											),
										8 =>
											array (
												'id' => '610928',
												'name' => '旬阳县',
											),
										9 =>
											array (
												'id' => '610929',
												'name' => '白河县',
											),
									),
							),
						9 =>
							array (
								'id' => '611000',
								'name' => '商洛市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '611002',
												'name' => '商州区',
											),
										1 =>
											array (
												'id' => '611021',
												'name' => '洛南县',
											),
										2 =>
											array (
												'id' => '611022',
												'name' => '丹凤县',
											),
										3 =>
											array (
												'id' => '611023',
												'name' => '商南县',
											),
										4 =>
											array (
												'id' => '611024',
												'name' => '山阳县',
											),
										5 =>
											array (
												'id' => '611025',
												'name' => '镇安县',
											),
										6 =>
											array (
												'id' => '611026',
												'name' => '柞水县',
											),
									),
							),
					),
			),
		27 =>
			array (
				'id' => '620000',
				'name' => '甘肃省',
				'children' =>
					array (
						0 =>
							array (
								'id' => '620100',
								'name' => '兰州市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '620102',
												'name' => '城关区',
											),
										1 =>
											array (
												'id' => '620103',
												'name' => '七里河区',
											),
										2 =>
											array (
												'id' => '620104',
												'name' => '西固区',
											),
										3 =>
											array (
												'id' => '620105',
												'name' => '安宁区',
											),
										4 =>
											array (
												'id' => '620111',
												'name' => '红古区',
											),
										5 =>
											array (
												'id' => '620121',
												'name' => '永登县',
											),
										6 =>
											array (
												'id' => '620122',
												'name' => '皋兰县',
											),
										7 =>
											array (
												'id' => '620123',
												'name' => '榆中县',
											),
									),
							),
						1 =>
							array (
								'id' => '620200',
								'name' => '嘉峪关市',
							),
						2 =>
							array (
								'id' => '620300',
								'name' => '金昌市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '620302',
												'name' => '金川区',
											),
										1 =>
											array (
												'id' => '620321',
												'name' => '永昌县',
											),
									),
							),
						3 =>
							array (
								'id' => '620400',
								'name' => '白银市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '620402',
												'name' => '白银区',
											),
										1 =>
											array (
												'id' => '620403',
												'name' => '平川区',
											),
										2 =>
											array (
												'id' => '620421',
												'name' => '靖远县',
											),
										3 =>
											array (
												'id' => '620422',
												'name' => '会宁县',
											),
										4 =>
											array (
												'id' => '620423',
												'name' => '景泰县',
											),
									),
							),
						4 =>
							array (
								'id' => '620500',
								'name' => '天水市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '620502',
												'name' => '秦城区',
											),
										1 =>
											array (
												'id' => '620503',
												'name' => '北道区',
											),
										2 =>
											array (
												'id' => '620521',
												'name' => '清水县',
											),
										3 =>
											array (
												'id' => '620522',
												'name' => '秦安县',
											),
										4 =>
											array (
												'id' => '620523',
												'name' => '甘谷县',
											),
										5 =>
											array (
												'id' => '620524',
												'name' => '武山县',
											),
										6 =>
											array (
												'id' => '620525',
												'name' => '张家川回族自治县',
											),
									),
							),
						5 =>
							array (
								'id' => '620600',
								'name' => '武威市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '620602',
												'name' => '凉州区',
											),
										1 =>
											array (
												'id' => '620621',
												'name' => '民勤县',
											),
										2 =>
											array (
												'id' => '620622',
												'name' => '古浪县',
											),
										3 =>
											array (
												'id' => '620623',
												'name' => '天祝藏族自治县',
											),
									),
							),
						6 =>
							array (
								'id' => '620700',
								'name' => '张掖市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '620702',
												'name' => '甘州区',
											),
										1 =>
											array (
												'id' => '620721',
												'name' => '肃南裕固族自治县',
											),
										2 =>
											array (
												'id' => '620722',
												'name' => '民乐县',
											),
										3 =>
											array (
												'id' => '620723',
												'name' => '临泽县',
											),
										4 =>
											array (
												'id' => '620724',
												'name' => '高台县',
											),
										5 =>
											array (
												'id' => '620725',
												'name' => '山丹县',
											),
									),
							),
						7 =>
							array (
								'id' => '620800',
								'name' => '平凉市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '620802',
												'name' => '崆峒区',
											),
										1 =>
											array (
												'id' => '620821',
												'name' => '泾川县',
											),
										2 =>
											array (
												'id' => '620822',
												'name' => '灵台县',
											),
										3 =>
											array (
												'id' => '620823',
												'name' => '崇信县',
											),
										4 =>
											array (
												'id' => '620824',
												'name' => '华亭县',
											),
										5 =>
											array (
												'id' => '620825',
												'name' => '庄浪县',
											),
										6 =>
											array (
												'id' => '620826',
												'name' => '静宁县',
											),
									),
							),
						8 =>
							array (
								'id' => '620900',
								'name' => '酒泉市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '620902',
												'name' => '肃州区',
											),
										1 =>
											array (
												'id' => '620921',
												'name' => '金塔县',
											),
										2 =>
											array (
												'id' => '620922',
												'name' => '安西县',
											),
										3 =>
											array (
												'id' => '620923',
												'name' => '肃北蒙古族自治县',
											),
										4 =>
											array (
												'id' => '620924',
												'name' => '阿克塞哈萨克族自治县',
											),
										5 =>
											array (
												'id' => '620981',
												'name' => '玉门市',
											),
										6 =>
											array (
												'id' => '620982',
												'name' => '敦煌市',
											),
									),
							),
						9 =>
							array (
								'id' => '621000',
								'name' => '庆阳市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '621002',
												'name' => '西峰区',
											),
										1 =>
											array (
												'id' => '621021',
												'name' => '庆城县',
											),
										2 =>
											array (
												'id' => '621022',
												'name' => '环　县',
											),
										3 =>
											array (
												'id' => '621023',
												'name' => '华池县',
											),
										4 =>
											array (
												'id' => '621024',
												'name' => '合水县',
											),
										5 =>
											array (
												'id' => '621025',
												'name' => '正宁县',
											),
										6 =>
											array (
												'id' => '621026',
												'name' => '宁　县',
											),
										7 =>
											array (
												'id' => '621027',
												'name' => '镇原县',
											),
									),
							),
						10 =>
							array (
								'id' => '621100',
								'name' => '定西市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '621102',
												'name' => '安定区',
											),
										1 =>
											array (
												'id' => '621121',
												'name' => '通渭县',
											),
										2 =>
											array (
												'id' => '621122',
												'name' => '陇西县',
											),
										3 =>
											array (
												'id' => '621123',
												'name' => '渭源县',
											),
										4 =>
											array (
												'id' => '621124',
												'name' => '临洮县',
											),
										5 =>
											array (
												'id' => '621125',
												'name' => '漳　县',
											),
										6 =>
											array (
												'id' => '621126',
												'name' => '岷　县',
											),
									),
							),
						11 =>
							array (
								'id' => '621200',
								'name' => '陇南市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '621202',
												'name' => '武都区',
											),
										1 =>
											array (
												'id' => '621221',
												'name' => '成　县',
											),
										2 =>
											array (
												'id' => '621222',
												'name' => '文　县',
											),
										3 =>
											array (
												'id' => '621223',
												'name' => '宕昌县',
											),
										4 =>
											array (
												'id' => '621224',
												'name' => '康　县',
											),
										5 =>
											array (
												'id' => '621225',
												'name' => '西和县',
											),
										6 =>
											array (
												'id' => '621226',
												'name' => '礼　县',
											),
										7 =>
											array (
												'id' => '621227',
												'name' => '徽　县',
											),
										8 =>
											array (
												'id' => '621228',
												'name' => '两当县',
											),
									),
							),
						12 =>
							array (
								'id' => '622900',
								'name' => '临夏回族自治州',
								'children' =>
									array (
										0 =>
											array (
												'id' => '622901',
												'name' => '临夏市',
											),
										1 =>
											array (
												'id' => '622921',
												'name' => '临夏县',
											),
										2 =>
											array (
												'id' => '622922',
												'name' => '康乐县',
											),
										3 =>
											array (
												'id' => '622923',
												'name' => '永靖县',
											),
										4 =>
											array (
												'id' => '622924',
												'name' => '广河县',
											),
										5 =>
											array (
												'id' => '622925',
												'name' => '和政县',
											),
										6 =>
											array (
												'id' => '622926',
												'name' => '东乡族自治县',
											),
										7 =>
											array (
												'id' => '622927',
												'name' => '积石山保安族东乡族撒拉族自治县',
											),
									),
							),
						13 =>
							array (
								'id' => '623000',
								'name' => '甘南藏族自治州',
								'children' =>
									array (
										0 =>
											array (
												'id' => '623001',
												'name' => '合作市',
											),
										1 =>
											array (
												'id' => '623021',
												'name' => '临潭县',
											),
										2 =>
											array (
												'id' => '623022',
												'name' => '卓尼县',
											),
										3 =>
											array (
												'id' => '623023',
												'name' => '舟曲县',
											),
										4 =>
											array (
												'id' => '623024',
												'name' => '迭部县',
											),
										5 =>
											array (
												'id' => '623025',
												'name' => '玛曲县',
											),
										6 =>
											array (
												'id' => '623026',
												'name' => '碌曲县',
											),
										7 =>
											array (
												'id' => '623027',
												'name' => '夏河县',
											),
									),
							),
					),
			),
		28 =>
			array (
				'id' => '630000',
				'name' => '青海省',
				'children' =>
					array (
						0 =>
							array (
								'id' => '630100',
								'name' => '西宁市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '630102',
												'name' => '城东区',
											),
										1 =>
											array (
												'id' => '630103',
												'name' => '城中区',
											),
										2 =>
											array (
												'id' => '630104',
												'name' => '城西区',
											),
										3 =>
											array (
												'id' => '630105',
												'name' => '城北区',
											),
										4 =>
											array (
												'id' => '630121',
												'name' => '大通回族土族自治县',
											),
										5 =>
											array (
												'id' => '630122',
												'name' => '湟中县',
											),
										6 =>
											array (
												'id' => '630123',
												'name' => '湟源县',
											),
									),
							),
						1 =>
							array (
								'id' => '632100',
								'name' => '海东地区',
								'children' =>
									array (
										0 =>
											array (
												'id' => '632121',
												'name' => '平安县',
											),
										1 =>
											array (
												'id' => '632122',
												'name' => '民和回族土族自治县',
											),
										2 =>
											array (
												'id' => '632123',
												'name' => '乐都县',
											),
										3 =>
											array (
												'id' => '632126',
												'name' => '互助土族自治县',
											),
										4 =>
											array (
												'id' => '632127',
												'name' => '化隆回族自治县',
											),
										5 =>
											array (
												'id' => '632128',
												'name' => '循化撒拉族自治县',
											),
									),
							),
						2 =>
							array (
								'id' => '632200',
								'name' => '海北藏族自治州',
								'children' =>
									array (
										0 =>
											array (
												'id' => '632221',
												'name' => '门源回族自治县',
											),
										1 =>
											array (
												'id' => '632222',
												'name' => '祁连县',
											),
										2 =>
											array (
												'id' => '632223',
												'name' => '海晏县',
											),
										3 =>
											array (
												'id' => '632224',
												'name' => '刚察县',
											),
									),
							),
						3 =>
							array (
								'id' => '632300',
								'name' => '黄南藏族自治州',
								'children' =>
									array (
										0 =>
											array (
												'id' => '632321',
												'name' => '同仁县',
											),
										1 =>
											array (
												'id' => '632322',
												'name' => '尖扎县',
											),
										2 =>
											array (
												'id' => '632323',
												'name' => '泽库县',
											),
										3 =>
											array (
												'id' => '632324',
												'name' => '河南蒙古族自治县',
											),
									),
							),
						4 =>
							array (
								'id' => '632500',
								'name' => '海南藏族自治州',
								'children' =>
									array (
										0 =>
											array (
												'id' => '632521',
												'name' => '共和县',
											),
										1 =>
											array (
												'id' => '632522',
												'name' => '同德县',
											),
										2 =>
											array (
												'id' => '632523',
												'name' => '贵德县',
											),
										3 =>
											array (
												'id' => '632524',
												'name' => '兴海县',
											),
										4 =>
											array (
												'id' => '632525',
												'name' => '贵南县',
											),
									),
							),
						5 =>
							array (
								'id' => '632600',
								'name' => '果洛藏族自治州',
								'children' =>
									array (
										0 =>
											array (
												'id' => '632621',
												'name' => '玛沁县',
											),
										1 =>
											array (
												'id' => '632622',
												'name' => '班玛县',
											),
										2 =>
											array (
												'id' => '632623',
												'name' => '甘德县',
											),
										3 =>
											array (
												'id' => '632624',
												'name' => '达日县',
											),
										4 =>
											array (
												'id' => '632625',
												'name' => '久治县',
											),
										5 =>
											array (
												'id' => '632626',
												'name' => '玛多县',
											),
									),
							),
						6 =>
							array (
								'id' => '632700',
								'name' => '玉树藏族自治州',
								'children' =>
									array (
										0 =>
											array (
												'id' => '632721',
												'name' => '玉树县',
											),
										1 =>
											array (
												'id' => '632722',
												'name' => '杂多县',
											),
										2 =>
											array (
												'id' => '632723',
												'name' => '称多县',
											),
										3 =>
											array (
												'id' => '632724',
												'name' => '治多县',
											),
										4 =>
											array (
												'id' => '632725',
												'name' => '囊谦县',
											),
										5 =>
											array (
												'id' => '632726',
												'name' => '曲麻莱县',
											),
									),
							),
						7 =>
							array (
								'id' => '632800',
								'name' => '海西蒙古族藏族自治州',
								'children' =>
									array (
										0 =>
											array (
												'id' => '632801',
												'name' => '格尔木市',
											),
										1 =>
											array (
												'id' => '632802',
												'name' => '德令哈市',
											),
										2 =>
											array (
												'id' => '632821',
												'name' => '乌兰县',
											),
										3 =>
											array (
												'id' => '632822',
												'name' => '都兰县',
											),
										4 =>
											array (
												'id' => '632823',
												'name' => '天峻县',
											),
									),
							),
					),
			),
		29 =>
			array (
				'id' => '640000',
				'name' => '宁夏回族自治区',
				'children' =>
					array (
						0 =>
							array (
								'id' => '640100',
								'name' => '银川市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '640104',
												'name' => '兴庆区',
											),
										1 =>
											array (
												'id' => '640105',
												'name' => '西夏区',
											),
										2 =>
											array (
												'id' => '640106',
												'name' => '金凤区',
											),
										3 =>
											array (
												'id' => '640121',
												'name' => '永宁县',
											),
										4 =>
											array (
												'id' => '640122',
												'name' => '贺兰县',
											),
										5 =>
											array (
												'id' => '640181',
												'name' => '灵武市',
											),
									),
							),
						1 =>
							array (
								'id' => '640200',
								'name' => '石嘴山市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '640202',
												'name' => '大武口区',
											),
										1 =>
											array (
												'id' => '640205',
												'name' => '惠农区',
											),
										2 =>
											array (
												'id' => '640221',
												'name' => '平罗县',
											),
									),
							),
						2 =>
							array (
								'id' => '640300',
								'name' => '吴忠市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '640302',
												'name' => '利通区',
											),
										1 =>
											array (
												'id' => '640323',
												'name' => '盐池县',
											),
										2 =>
											array (
												'id' => '640324',
												'name' => '同心县',
											),
										3 =>
											array (
												'id' => '640381',
												'name' => '青铜峡市',
											),
									),
							),
						3 =>
							array (
								'id' => '640400',
								'name' => '固原市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '640402',
												'name' => '原州区',
											),
										1 =>
											array (
												'id' => '640422',
												'name' => '西吉县',
											),
										2 =>
											array (
												'id' => '640423',
												'name' => '隆德县',
											),
										3 =>
											array (
												'id' => '640424',
												'name' => '泾源县',
											),
										4 =>
											array (
												'id' => '640425',
												'name' => '彭阳县',
											),
									),
							),
						4 =>
							array (
								'id' => '640500',
								'name' => '中卫市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '640502',
												'name' => '沙坡头区',
											),
										1 =>
											array (
												'id' => '640521',
												'name' => '中宁县',
											),
										2 =>
											array (
												'id' => '640522',
												'name' => '海原县',
											),
									),
							),
					),
			),
		30 =>
			array (
				'id' => '650000',
				'name' => '新疆维吾尔自治区',
				'children' =>
					array (
						0 =>
							array (
								'id' => '650100',
								'name' => '乌鲁木齐市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '650102',
												'name' => '天山区',
											),
										1 =>
											array (
												'id' => '650103',
												'name' => '沙依巴克区',
											),
										2 =>
											array (
												'id' => '650104',
												'name' => '新市区',
											),
										3 =>
											array (
												'id' => '650105',
												'name' => '水磨沟区',
											),
										4 =>
											array (
												'id' => '650106',
												'name' => '头屯河区',
											),
										5 =>
											array (
												'id' => '650107',
												'name' => '达坂城区',
											),
										6 =>
											array (
												'id' => '650108',
												'name' => '东山区',
											),
										7 =>
											array (
												'id' => '650121',
												'name' => '乌鲁木齐县',
											),
									),
							),
						1 =>
							array (
								'id' => '650200',
								'name' => '克拉玛依市',
								'children' =>
									array (
										0 =>
											array (
												'id' => '650202',
												'name' => '独山子区',
											),
										1 =>
											array (
												'id' => '650203',
												'name' => '克拉玛依区',
											),
										2 =>
											array (
												'id' => '650204',
												'name' => '白碱滩区',
											),
										3 =>
											array (
												'id' => '650205',
												'name' => '乌尔禾区',
											),
									),
							),
						2 =>
							array (
								'id' => '652100',
								'name' => '吐鲁番地区',
								'children' =>
									array (
										0 =>
											array (
												'id' => '652101',
												'name' => '吐鲁番市',
											),
										1 =>
											array (
												'id' => '652122',
												'name' => '鄯善县',
											),
										2 =>
											array (
												'id' => '652123',
												'name' => '托克逊县',
											),
									),
							),
						3 =>
							array (
								'id' => '652200',
								'name' => '哈密地区',
								'children' =>
									array (
										0 =>
											array (
												'id' => '652201',
												'name' => '哈密市',
											),
										1 =>
											array (
												'id' => '652222',
												'name' => '巴里坤哈萨克自治县',
											),
										2 =>
											array (
												'id' => '652223',
												'name' => '伊吾县',
											),
									),
							),
						4 =>
							array (
								'id' => '652300',
								'name' => '昌吉回族自治州',
								'children' =>
									array (
										0 =>
											array (
												'id' => '652301',
												'name' => '昌吉市',
											),
										1 =>
											array (
												'id' => '652302',
												'name' => '阜康市',
											),
										2 =>
											array (
												'id' => '652303',
												'name' => '米泉市',
											),
										3 =>
											array (
												'id' => '652323',
												'name' => '呼图壁县',
											),
										4 =>
											array (
												'id' => '652324',
												'name' => '玛纳斯县',
											),
										5 =>
											array (
												'id' => '652325',
												'name' => '奇台县',
											),
										6 =>
											array (
												'id' => '652327',
												'name' => '吉木萨尔县',
											),
										7 =>
											array (
												'id' => '652328',
												'name' => '木垒哈萨克自治县',
											),
									),
							),
						5 =>
							array (
								'id' => '652700',
								'name' => '博尔塔拉蒙古自治州',
								'children' =>
									array (
										0 =>
											array (
												'id' => '652701',
												'name' => '博乐市',
											),
										1 =>
											array (
												'id' => '652722',
												'name' => '精河县',
											),
										2 =>
											array (
												'id' => '652723',
												'name' => '温泉县',
											),
									),
							),
						6 =>
							array (
								'id' => '652800',
								'name' => '巴音郭楞蒙古自治州',
								'children' =>
									array (
										0 =>
											array (
												'id' => '652801',
												'name' => '库尔勒市',
											),
										1 =>
											array (
												'id' => '652822',
												'name' => '轮台县',
											),
										2 =>
											array (
												'id' => '652823',
												'name' => '尉犁县',
											),
										3 =>
											array (
												'id' => '652824',
												'name' => '若羌县',
											),
										4 =>
											array (
												'id' => '652825',
												'name' => '且末县',
											),
										5 =>
											array (
												'id' => '652826',
												'name' => '焉耆回族自治县',
											),
										6 =>
											array (
												'id' => '652827',
												'name' => '和静县',
											),
										7 =>
											array (
												'id' => '652828',
												'name' => '和硕县',
											),
										8 =>
											array (
												'id' => '652829',
												'name' => '博湖县',
											),
									),
							),
						7 =>
							array (
								'id' => '652900',
								'name' => '阿克苏地区',
								'children' =>
									array (
										0 =>
											array (
												'id' => '652901',
												'name' => '阿克苏市',
											),
										1 =>
											array (
												'id' => '652922',
												'name' => '温宿县',
											),
										2 =>
											array (
												'id' => '652923',
												'name' => '库车县',
											),
										3 =>
											array (
												'id' => '652924',
												'name' => '沙雅县',
											),
										4 =>
											array (
												'id' => '652925',
												'name' => '新和县',
											),
										5 =>
											array (
												'id' => '652926',
												'name' => '拜城县',
											),
										6 =>
											array (
												'id' => '652927',
												'name' => '乌什县',
											),
										7 =>
											array (
												'id' => '652928',
												'name' => '阿瓦提县',
											),
										8 =>
											array (
												'id' => '652929',
												'name' => '柯坪县',
											),
									),
							),
						8 =>
							array (
								'id' => '653000',
								'name' => '克孜勒苏柯尔克孜自治州',
								'children' =>
									array (
										0 =>
											array (
												'id' => '653001',
												'name' => '阿图什市',
											),
										1 =>
											array (
												'id' => '653022',
												'name' => '阿克陶县',
											),
										2 =>
											array (
												'id' => '653023',
												'name' => '阿合奇县',
											),
										3 =>
											array (
												'id' => '653024',
												'name' => '乌恰县',
											),
									),
							),
						9 =>
							array (
								'id' => '653100',
								'name' => '喀什地区',
								'children' =>
									array (
										0 =>
											array (
												'id' => '653101',
												'name' => '喀什市',
											),
										1 =>
											array (
												'id' => '653121',
												'name' => '疏附县',
											),
										2 =>
											array (
												'id' => '653122',
												'name' => '疏勒县',
											),
										3 =>
											array (
												'id' => '653123',
												'name' => '英吉沙县',
											),
										4 =>
											array (
												'id' => '653124',
												'name' => '泽普县',
											),
										5 =>
											array (
												'id' => '653125',
												'name' => '莎车县',
											),
										6 =>
											array (
												'id' => '653126',
												'name' => '叶城县',
											),
										7 =>
											array (
												'id' => '653127',
												'name' => '麦盖提县',
											),
										8 =>
											array (
												'id' => '653128',
												'name' => '岳普湖县',
											),
										9 =>
											array (
												'id' => '653129',
												'name' => '伽师县',
											),
										10 =>
											array (
												'id' => '653130',
												'name' => '巴楚县',
											),
										11 =>
											array (
												'id' => '653131',
												'name' => '塔什库尔干塔吉克自治县',
											),
									),
							),
						10 =>
							array (
								'id' => '653200',
								'name' => '和田地区',
								'children' =>
									array (
										0 =>
											array (
												'id' => '653201',
												'name' => '和田市',
											),
										1 =>
											array (
												'id' => '653221',
												'name' => '和田县',
											),
										2 =>
											array (
												'id' => '653222',
												'name' => '墨玉县',
											),
										3 =>
											array (
												'id' => '653223',
												'name' => '皮山县',
											),
										4 =>
											array (
												'id' => '653224',
												'name' => '洛浦县',
											),
										5 =>
											array (
												'id' => '653225',
												'name' => '策勒县',
											),
										6 =>
											array (
												'id' => '653226',
												'name' => '于田县',
											),
										7 =>
											array (
												'id' => '653227',
												'name' => '民丰县',
											),
									),
							),
						11 =>
							array (
								'id' => '654000',
								'name' => '伊犁哈萨克自治州',
								'children' =>
									array (
										0 =>
											array (
												'id' => '654002',
												'name' => '伊宁市',
											),
										1 =>
											array (
												'id' => '654003',
												'name' => '奎屯市',
											),
										2 =>
											array (
												'id' => '654021',
												'name' => '伊宁县',
											),
										3 =>
											array (
												'id' => '654022',
												'name' => '察布查尔锡伯自治县',
											),
										4 =>
											array (
												'id' => '654023',
												'name' => '霍城县',
											),
										5 =>
											array (
												'id' => '654024',
												'name' => '巩留县',
											),
										6 =>
											array (
												'id' => '654025',
												'name' => '新源县',
											),
										7 =>
											array (
												'id' => '654026',
												'name' => '昭苏县',
											),
										8 =>
											array (
												'id' => '654027',
												'name' => '特克斯县',
											),
										9 =>
											array (
												'id' => '654028',
												'name' => '尼勒克县',
											),
									),
							),
						12 =>
							array (
								'id' => '654200',
								'name' => '塔城地区',
								'children' =>
									array (
										0 =>
											array (
												'id' => '654201',
												'name' => '塔城市',
											),
										1 =>
											array (
												'id' => '654202',
												'name' => '乌苏市',
											),
										2 =>
											array (
												'id' => '654221',
												'name' => '额敏县',
											),
										3 =>
											array (
												'id' => '654223',
												'name' => '沙湾县',
											),
										4 =>
											array (
												'id' => '654224',
												'name' => '托里县',
											),
										5 =>
											array (
												'id' => '654225',
												'name' => '裕民县',
											),
										6 =>
											array (
												'id' => '654226',
												'name' => '和布克赛尔蒙古自治县',
											),
									),
							),
						13 =>
							array (
								'id' => '654300',
								'name' => '阿勒泰地区',
								'children' =>
									array (
										0 =>
											array (
												'id' => '654301',
												'name' => '阿勒泰市',
											),
										1 =>
											array (
												'id' => '654321',
												'name' => '布尔津县',
											),
										2 =>
											array (
												'id' => '654322',
												'name' => '富蕴县',
											),
										3 =>
											array (
												'id' => '654323',
												'name' => '福海县',
											),
										4 =>
											array (
												'id' => '654324',
												'name' => '哈巴河县',
											),
										5 =>
											array (
												'id' => '654325',
												'name' => '青河县',
											),
										6 =>
											array (
												'id' => '654326',
												'name' => '吉木乃县',
											),
									),
							),
						14 =>
							array (
								'id' => '659000',
								'name' => '省直辖行政单位',
								'children' =>
									array (
										0 =>
											array (
												'id' => '659001',
												'name' => '石河子市',
											),
										1 =>
											array (
												'id' => '659002',
												'name' => '阿拉尔市',
											),
										2 =>
											array (
												'id' => '659003',
												'name' => '图木舒克市',
											),
										3 =>
											array (
												'id' => '659004',
												'name' => '五家渠市',
											),
									),
							),
					),
			),
		31 =>
			array (
				'id' => '710000',
				'name' => '台湾省',
			),
		32 =>
			array (
				'id' => '810000',
				'name' => '香港特别行政区',
			),
		33 =>
			array (
				'id' => '820000',
				'name' => '澳门特别行政区',
			),
	);